{
  "source_video": "FarahN_Activity3ProjectMotivation_2025-07-02_075539_1.MOV",
  "text": "So talking about what inspired me to put the spotlight on our artwork was essentially getting the artwork. I had a big wall in our master bedroom and I had a beautiful painting custom made by an artist that I found at a festival. And yeah, my aesthetic goal was to really just kind of shine, make the artwork the centerpiece of the room. And it really is. So it really makes me feel just invited to sort of enjoy the artwork. When I have guests over, I like to highlight my artwork in my house with the spotlight. And it kind of brings this element of this like focal point. Everything is so neutral. So the art really kind of makes everything sort of pop in a way that it was not lit. And I don't have a lot of lighting in the room. That's one of the reasons why I wanted this spotlight. It really helps to kind of showcase the artwork and almost bring the whole space to life, which is really great.",
  "language": "en",
  "language_probability": 1,
  "duration": 62.63,
  "segments": [
    {
      "start": 1.1,
      "end": 7.6,
      "text": "So talking about what inspired me to put the spotlight on our artwork was essentially getting"
    },
    {
      "start": 7.6,
      "end": 16.06,
      "text": "the artwork. I had a big wall in our master bedroom and I had a beautiful painting custom"
    },
    {
      "start": 16.06,
      "end": 22.6,
      "text": "made by an artist that I found at a festival. And yeah, my aesthetic goal was to really just"
    },
    {
      "start": 22.6,
      "end": 28.54,
      "text": "kind of shine, make the artwork the centerpiece of the room. And it really is. So it really makes"
    },
    {
      "start": 28.54,
      "end": 36.36,
      "text": "me feel just invited to sort of enjoy the artwork. When I have guests over, I like to"
    },
    {
      "start": 36.36,
      "end": 41.32,
      "text": "highlight my artwork in my house with the spotlight. And it kind of brings this element"
    },
    {
      "start": 41.32,
      "end": 46.64,
      "text": "of this like focal point. Everything is so neutral. So the art really kind of makes everything"
    },
    {
      "start": 46.64,
      "end": 53.01,
      "text": "sort of pop in a way that it was not lit. And I don't have a lot of lighting in the room. That's"
    },
    {
      "start": 53.01,
      "end": 58.59,
      "text": "one of the reasons why I wanted this spotlight. It really helps to kind of showcase the"
    },
    {
      "start": 58.61,
      "end": 62.37,
      "text": "artwork and almost bring the whole space to life, which is really great."
    }
  ]
}