{
  "source_video": "FrederickK_Activity4SourcesofInspiration_2025-07-03_041850_1.mp4",
  "text": "So the bulk of our ideas, at least for my wife, are coming from Instagram, and that comes from there a lot, somewhat for me. When I get serious about something, I end up going on, also go on House, and I also go on Pinterest. I like to find a picture of something I like, and then put it into the search and find similar ideas, try and replicate it, try and find something that I can buy, that looks good, that I can also afford. I can't just buy whatever is in the picture. So for me, it really is, it's a lot of having seen it somewhere, so I need to see pictures. And then, that looks good, I'd like to do it. Every once in a while, I kind of come up with my own thing, but I really need to see it. I usually need to see examples, and a lot of times when my wife discusses things that she's seen, it's like, well, we can keep talking, or you can show me the picture. If you show me the picture, we'll get it figured out. So, Instagram, House, Pinterest.",
  "language": "en",
  "language_probability": 1,
  "duration": 73.83,
  "segments": [
    {
      "start": 1.01,
      "end": 17.92,
      "text": "So the bulk of our ideas, at least for my wife, are coming from Instagram, and that comes from there a lot, somewhat for me. When I get serious about something, I end up going on, also go on House, and I also go on Pinterest."
    },
    {
      "start": 17.92,
      "end": 40.52,
      "text": "I like to find a picture of something I like, and then put it into the search and find similar ideas, try and replicate it, try and find something that I can buy, that looks good, that I can also afford. I can't just buy whatever is in the picture."
    },
    {
      "start": 41.98,
      "end": 47.86,
      "text": "So for me, it really is, it's a lot of having seen it somewhere, so I need to see pictures."
    },
    {
      "start": 48.6,
      "end": 52.18,
      "text": "And then, that looks good, I'd like to do it."
    },
    {
      "start": 52.6,
      "end": 57.18,
      "text": "Every once in a while, I kind of come up with my own thing, but I really need to see it."
    },
    {
      "start": 57.26,
      "end": 66.6,
      "text": "I usually need to see examples, and a lot of times when my wife discusses things that she's seen, it's like, well, we can keep talking, or you can show me the picture."
    },
    {
      "start": 66.98,
      "end": 69.1,
      "text": "If you show me the picture, we'll get it figured out."
    },
    {
      "start": 69.1,
      "end": 73.22,
      "text": "So, Instagram, House, Pinterest."
    }
  ]
}