[
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I think covering a wall with slatwall sections is a tremendous waste of wall space. If you don't have a lot of stuff, then it makes sense. But in a crowded garage, that wall space is much better served by placing larger tools against the wall, shelving, etc. And small strips of slatwall or just 2x10 and hooks to hang items that are best stored by hanging.",
    "permalink": "https://reddit.com/r/garageporn/comments/1kd26sl/pay_for_slatwall_install_or_do_myself/mq81urd/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "That looks great! As someone who spends a lot of time in the garage, props to the how well thought out this is. Even if he wants to tinker with the positioning and storage of some stuff, I can tell you put a lot of thought into the design and layout. It's really easy to get caught up into constantly keeping up with projects and work and not ever getting around to the meta aspects of tool storage, garage design, whatever. All the hooks and hangars to get stuff off the floor, the organization, the extra surface space, the LIGHTING! Dudes LOVE to spend time in the darkest shit-lighting garages. \n\nYou really did something. Great job!",
    "permalink": "https://reddit.com/r/garageporn/comments/1kazjdp/surprised_my_husband_with_a_little_garage_makeover/mpqzd91/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "Wherever there's drywall, get yourself some slatwall panels (Proslat, Crownwall, etc) for organization. You'll be amazed how much floor space will be opened up with everything on the walls. So many different hooks and shelves and bins available. Worth the bread. Easy to install if you can handle a drill and a level. \n\nIf you want to hide the cinder block wall, definitely do NOT paint it. Do a lime wash if anything. \n\nI'm also on Long Island. Looking into a screen system for my garage door so I can hang out and work in there without mosquitoes all over me. There are tons of options. Good luck and most importantly, have fun in the process.",
    "permalink": "https://reddit.com/r/garageporn/comments/1ka3led/advice_for_garage_to_gym_transformation/mpjt9b6/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "Just garage hooks, that’s another thing I plan on tackling next year.  Going to add a pulley system for lowering the bikes so I don’t need a ladder.",
    "permalink": "https://reddit.com/r/garageporn/comments/1k9in66/spent_the_weekends_this_winter_updating_the_garage/mpfc968/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I installed the 8' wide slat wall panel on 6 studs with screws in each groove.  It is rock solid.  I bought these for the same reason to keep things off the floor and not to have hooks drilled into the walls all over the garage.   It has no problems handling the weight of a ladder with the correct hooks.",
    "permalink": "https://reddit.com/r/garageporn/comments/1jpclly/started_installing_tiles_today_i_still_have_to_do/mldghua/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "Remove everything, scrub walls clean, paint walls. Rent a floor scrubber, clean floor, seal first with penetrating sealant then after a top sealant. Buy metal shelving, hang 2ft from garage roof, buy rotors, put junk in totes, label them and put on metal shelves. Buy slatwall and hooks, get everything off the floor. Buy mid level metal cabinets, put everything else in them and get ones with a workbench you can’t sit at or work at. Add small fridge, fill with beer, wait until beer is cold, drink beer and enjoy your happy place",
    "permalink": "https://reddit.com/r/garageporn/comments/1jptg5y/looking_for_renovation_ideas/ml3h6vh/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "Nice.\n\nDid you research options before deciding on what to use for the floor?  The reason I ask is that I've just done a lot of work on my garage and doing the floor is pretty much the last thing on my list.\n\nFor what it's worth ... I put the Rubbermaid FASTTRACK system on one of my walls \\[placed 12' the \"rails\" 1 foot apart horizontally on the wall\\] and it gave me an endless variety of ways to hang things.  The wall now contains \\[i.e., has these things hanging on it\\] step ladders, chairs, shovels, rakes, a hedge trimmer, a chain saw, a leaf blower, a bicycle pump ... you name it and you can hang it on the wall using the various hooks that come with the system.",
    "permalink": "https://reddit.com/r/garageporn/comments/1jnle46/i_redid_it_im_satisfied/mkmovsw/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "It is fine.  It will easily do the job (i.e. hang up tools and other items).  We just wanted to avoid having hooks all over the garage screwed into the wall.  I bought some heavy duty geotextile fabric to use as an underlayment for the floor tiles.  The quality is great.  Most of the money spent on this project will be on the floor tiles and cabinet system.",
    "permalink": "https://reddit.com/r/garageporn/comments/1jho8hg/making_steady_progress_see_before_and_now/mj92ibp/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I take time to put seasonal items into a shed. I try to keep everything off the floor with shelves/cabinets. If you’re looking my to buy new garage cabinets, great. If you’d rather DIY for a fraction of the cost, I got cheap kitchen and office cabinets off Marketplace and painted them black, and replaced handles with knurled stainless steel ones. Looks great.\n\nI use ceiling hooks for strollers and lighter items.\n\nI have 8ft Barrina (Amazon) led shop lights arranged in squares on my ceiling and they’ve been flawless for years.",
    "permalink": "https://reddit.com/r/garageporn/comments/1jf878f/reclaiming_my_garage/miow6k9/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "Industrial/retail shelving systems. You can often pick them up at stores going out of business for pennies on the dollar. You can also find them online from specialty sites. Every square inch of wall space in my 2-car garage is covered in 1/4” steel wire “mesh” (probably 2”x2” squares in 4’x8’ sections) that is used to hang shelves/hooks/cabinets from. It’s infinitely customizable. I think I paid $100 for all of it, plus enough for two other 2-car garages.",
    "permalink": "https://reddit.com/r/garageporn/comments/1jezvmo/best_bang_for_the_buck_garage_cabinet_system/mimwf5s/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "Fair enough. \n\nThe mini-split is the best thing I did in my garage. Couldn’t be happier.  The other thing is plywood walls with a sealant.  I can install hooks, shelves, etc right to the plywood. No need to find a stud.",
    "permalink": "https://reddit.com/r/garageporn/comments/1j5qolq/clean_slate_detached_garage/mgj1cxm/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I just did the radar series from hyperlite in my garage. 8x150w make up the main grid and I have 2 more over my workbench area. \n\nMy garage is 30x30 with 12'6\" ceilings. They are hung on hooks into the joist next to their box so they're right on the ceiling. \n\nIf I could do it all again I'd get 1-10v dimmable ones because these things are BRIGHT.\n\nThe motion sensor is cool but not useful for me, and the remotes are a pain to use. \n\nThe radar series has a 120 degree beam so it's good for a lower ceiling. \n\nYou will have plenty of light.",
    "permalink": "https://reddit.com/r/garageporn/comments/1j5fxf9/lighting_hyperlite_high_bays/mghp0py/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I intended to but I wasn’t paying attention and didn’t realize when you butt the sheets up against each other you can’t slide them in. So i installed everything on the walls and couldn’t use them. So I returned the ones I bought. But I would recommend for the heavier items to get the inserts. I blew out a few slats over time already by hanging the heavy stuff. But that’s user error. I would say go for it. The price point is perfect at $50 a sheet. The hooks can get a little expensive but still my garage is super organized now. Probably spent like $250-$300 on hooks alone. But have had many people compliment it and say they with they did it. \n\nI bought the pre painted gray ones",
    "permalink": "https://reddit.com/r/garageporn/comments/1aql3ob/menards_dakota_mdf_slat_wall/mc2pm3z/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "Eight bikes I would abandon ship for sure lol or shed them. In the picture it's the previous owners stuff, I was just visiting but wanted to start planning it out. For I have a 2 yr old who has a mini bike and I think we will eventually get 2 more. We can slat wall them or they see hooks to out under the ceiling shelves to hang them? Watch obsessed garage on YouTube for some good ideas, there's tons of solutions for storing them",
    "permalink": "https://reddit.com/r/garageporn/comments/1ihokr0/rate_my_garage_beforeafter/mb112bt/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I agree it does look cleaner. Let me preface this by mentioning that I have absolutely no experience with Omniwall, I've only seen it advertised. I think for the back of a workbench, Omniwall is the better choice because it offers much more customization options and has better off-the-shelf solutions for small tools. I've been completely happy with Gearwall for the big wall of my garage. It's great for hanging the ladders, shovels, brooms, large tools, kids bikes, etc... But try to find a good screwdriver or wrench holder for Gearwall and it's a real struggle. You have to look at aftermarket solutions or make your own. I think Gladiator could do a lot more with Gearwall if they'd look beyond hooks, bins, and baskets.",
    "permalink": "https://reddit.com/r/garageporn/comments/1icx8sx/psa_you_can_mount_milwaukee_packout_to_gladiator/m9zzmn0/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I’d rake advantage of the ceiling height. Overhead storage. Throw Christmas decorations up there and anything you don’t need regularly. Use the walls for storage (shelves or hooks for tools/stuff). This will keep stuff off of the floor. Insulate the garage door. New lighting. Some paint. This should all be pretty inexpensive. Enjoy!",
    "permalink": "https://reddit.com/r/garageporn/comments/1i9y3t9/ideas/m9h1r11/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I have 32ft of proslat slatwall. They have bike hooks and any hook for anything. I bought newage garage shelving and put everything in matching totes up and out of the way.",
    "permalink": "https://reddit.com/r/garageporn/comments/1i19kyr/quick_tips_to_better_organize_this_stuff/m74g40c/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I am not the one whose garage is pouring out 😀\nI hardly have some bikes and bare minimum tools and a wall mounted car washer and some ... loat goes on😬\n\nWas just trying to kid.. i gotta settle in this house and then will hire someone to paint this super high ceiling garage.. will leave the hooks on just remove my stuff and get it painted.",
    "permalink": "https://reddit.com/r/garageporn/comments/1hju7ef/garage_organization/m3kf34a/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "I’ve been using pegboard in my garages since the mid 80’s.  I’ve accumulated some nice pegboard racks, baskets, and other hooks.  Starting a new build soon, and will definitely use pegboard again.",
    "permalink": "https://reddit.com/r/garageporn/comments/1hco9u6/bottomup_full_garage_reno_before_after/m1pwzx0/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "garage hooks",
    "body": "Where’s the truck with the hooks from? I need that in my small two car garage to tidy up rakes and such.",
    "permalink": "https://reddit.com/r/garageporn/comments/1gzk6ek/pan_of_my_one_car_garage_mastering_tiny_spaces/lz0ixsu/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "I found a shop nearby that sold new and used retail equipment.  I bought a few sheets of 4’x8’ slatwall that was for real cheap.  I installed myself in now time flat.  It wasn’t too difficult to do myself.  The hardest part was lifting the 2nd piece up and anchoring to the wall, would have been easier with a helper.",
    "permalink": "https://reddit.com/r/garageporn/comments/1kd26sl/pay_for_slatwall_install_or_do_myself/mqacace/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Thanks u/mattbladez. Sadly your link is for Home Depot Canada, and we’re stuck in the US with double the price \n\n[Thanks to the Freedom Tariffs](https://www.homedepot.com/p/Proslat-PVC-Slatwall-8-ft-x-4-ft-Sandstone-88109/206136180)",
    "permalink": "https://reddit.com/r/garageporn/comments/1kd26sl/pay_for_slatwall_install_or_do_myself/mq96z85/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "I think covering a wall with slatwall sections is a tremendous waste of wall space. If you don't have a lot of stuff, then it makes sense. But in a crowded garage, that wall space is much better served by placing larger tools against the wall, shelving, etc. And small strips of slatwall or just 2x10 and hooks to hang items that are best stored by hanging.",
    "permalink": "https://reddit.com/r/garageporn/comments/1kd26sl/pay_for_slatwall_install_or_do_myself/mq81urd/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "I got the procore plus slatwall and did approx 8x16 and it took me 1 day to install with several outlets to cut around. I wouldn’t pay someone to do it. It’s easy but eats a whole day.",
    "permalink": "https://reddit.com/r/garageporn/comments/1kd26sl/pay_for_slatwall_install_or_do_myself/mq7f0ov/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Just a suggestion, but I think Slatwall panels would be really helpful! They would also cover up the drywall, so it would make it look more finished.",
    "permalink": "https://reddit.com/r/garageporn/comments/1kb1wgt/wall_storage_complete/mpv6g60/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "One of those walls is begging to become a slatwall. Proslat. Crownwall. Take your pick.",
    "permalink": "https://reddit.com/r/garageporn/comments/1ka9fay/overhead_storage_is_next/mpkwu5t/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Wherever there's drywall, get yourself some slatwall panels (Proslat, Crownwall, etc) for organization. You'll be amazed how much floor space will be opened up with everything on the walls. So many different hooks and shelves and bins available. Worth the bread. Easy to install if you can handle a drill and a level. \n\nIf you want to hide the cinder block wall, definitely do NOT paint it. Do a lime wash if anything. \n\nI'm also on Long Island. Looking into a screen system for my garage door so I can hang out and work in there without mosquitoes all over me. There are tons of options. Good luck and most importantly, have fun in the process.",
    "permalink": "https://reddit.com/r/garageporn/comments/1ka3led/advice_for_garage_to_gym_transformation/mpjt9b6/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Yep this is great advice. Also, you want to make sure your garage doors maintenance is up to date especially the rubber stopper on the bottom of the door, as that will keep your garage protected from pests and the elements. You could also have you door insulated to keep heat in/out. As for the rest of the garage, definitely take everything out and give the floors and walls a good clean, and put a fresh coat of paint. I also really like recommending Slatwall panels for storage and organization, that could also cover the exposed insulation. If you really want to get fancy you could get a nice weight rack and install that by the back wall. That's just the bare minimum but you have a lot of potential here!",
    "permalink": "https://reddit.com/r/garageporn/comments/1ka3led/advice_for_garage_to_gym_transformation/mpjicon/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Maybe install some PVC Slatwall panels to give it a more finished look and also be able to hang stuff up on it for better storage! Clean up the windows and maybe repaint the cabinet and place new doors/hinges on it to make it look newer, and clean the concrete. If you really want to get fancy you could epoxy the floors or put some sort of flooring down! I could also see some sort of workbench/ more cabinets on the back wall I think that would look good. Those are just some big picture suggestions but there's a lot you could do!",
    "permalink": "https://reddit.com/r/garageporn/comments/1k7jsqp/garage_update_advice/moyrn5w/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Afternoon all,\n\nDoing a 400sq build on top of our garage so I get the opportunity to redo the garage at the same time.\n\nI think I have most of the bases covered, but let me know if you see anything I should change before we get any further.\n\nMy current questions:\n\n1. 2x8 or 4x8 or a combination for ceiling racks along left and right sides.  Thinking 2x 2x8 racks on left side and 2x 4x8 racks on right.  I think if it's all 4x8, it will start to feel really crowded.\n2. what color should I paint it?\n3. What type of floor coating?  Live in a warm climate so don't need Swisstrax or anything\n4. What else would you change?\n\nCurrent features:\n\n10' 9\" ceiling\n\nhigh lift garage door\n\n[4 post car lift](https://www.bendpak.com/car-lifts/four-post-lifts/hd-9/) in the future\n\n3x [11,790 Lumens - 90 Watt - 5000 Kelvin - 8 ft. LED Strip Fixtures](https://www.1000bulbs.com/fil/products/228321)\n\nNewage Pro cabinets on the left side\n\n[PROCORE+ Black Carbon fiber PVC Slatwall](https://proslat.com/products/8-ft-x-4-ft-procore-pvc-slatwall) on the entire back wall and above the Newage workbench.\n\nSome type of ceiling mounted storage on the left and right side (debating on 2x 2'x8' or 2x 4'x8')\n\nBlocking in floor joist at 24\" and 48\" from the left and right side and 24\" from rear\n\n400a electrical panel on back wall.  House will become 200a sub panel.  I will have 18 spaces left in it after this project is done.  Planning on installing 100a circuits for EV charging to future proof.\n\nDedicated 20a outlet in ceiling for lift\n\nEach wall has own 20a circuit\n\nSingle ceiling outlet with low voltage smurf tube for projector use until lift is put in\n\n50a outlet in rear of garage for future use with tools or EV\n\nDedicated grilling lights so I don't need a headlamp or light on grill\n\nWill have a electrical cord reel along with air in a corner of garage\n\nPlanning on adding copper air lines in garage at some point\n\nUtility sink on rear wall\n\nDuctless mini-split air conditioning\n\n2 natural gas valves under balcony behind access panel for future NG IR heaters to use for grilling and parties\n\nSome type of floor coating.  Not sure yet.  I'm kinda bummed they took the new footers to the surface instead of 4\" below the surface so I can put a smooth slab on top.  I didn't even think about that before they were poured",
    "permalink": "https://reddit.com/r/garageporn/comments/1k4pqne/any_advice_for_my_garage_build/mobueer/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Cool, thanks for the info. I’ll check them out for my slatwall project",
    "permalink": "https://reddit.com/r/garageporn/comments/1k29gjf/our_diy_garage_remodeling_is_done_everything_has/mnzoqu2/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "PVC slatwall from Vevor all throughout.",
    "permalink": "https://reddit.com/r/garageporn/comments/1k29gjf/our_diy_garage_remodeling_is_done_everything_has/mnsozcv/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "It's really no different looking over slatwall panels, which I would of done instead but still very clean.",
    "permalink": "https://reddit.com/r/garageporn/comments/1k0031v/got_the_garage_cleaned_up_a_bit_added_a_shiplap/mnb4gt8/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "I mean, I probably would have done slatwall panels instead, but this doesn’t look terrible at all.",
    "permalink": "https://reddit.com/r/garageporn/comments/1k0031v/got_the_garage_cleaned_up_a_bit_added_a_shiplap/mnavida/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "The PVC slat wall is from Vevor.  Just do the free registration and pay less.\n\n[https://www.vevor.com/slatwall-panels-c\\_12501/8-x-4-ft-slat-wall-paneling-pvc-grey-garage-slatwall-with-modular-design-p\\_010174719535](https://www.vevor.com/slatwall-panels-c_12501/8-x-4-ft-slat-wall-paneling-pvc-grey-garage-slatwall-with-modular-design-p_010174719535)",
    "permalink": "https://reddit.com/r/garageporn/comments/1jpclly/started_installing_tiles_today_i_still_have_to_do/mm1d551/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Remove everything, scrub walls clean, paint walls. Rent a floor scrubber, clean floor, seal first with penetrating sealant then after a top sealant. Buy metal shelving, hang 2ft from garage roof, buy rotors, put junk in totes, label them and put on metal shelves. Buy slatwall and hooks, get everything off the floor. Buy mid level metal cabinets, put everything else in them and get ones with a workbench you can’t sit at or work at. Add small fridge, fill with beer, wait until beer is cold, drink beer and enjoy your happy place",
    "permalink": "https://reddit.com/r/garageporn/comments/1jptg5y/looking_for_renovation_ideas/ml3h6vh/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "To be honest with you I didn't know they sold it in kits, I've always just bought it as a sheet good. That's what you're talking about, right? Like this?\n\nhttps://www.menards.com/main/paint/paneling-planking/paneling/dakota-trade-3-4-x-48-x-96-prefinished-slatwall-panel/lamslatwallwhite/p-1444428251813-c-8168.htm?exp=false",
    "permalink": "https://reddit.com/r/garageporn/comments/1jpw3ub/q_is_it_possible_to_get_1_panel_of_a_slatwall/ml33z6q/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Don't know about \"Slatwall\" but My Lowes has the thin gladiator ones for sale as singles.  Amazon only has the double pack.  Do they even sell the actual branded \"Slatwall\" stuff on site at ether HD or lowes??  Thought it was only an amazon thing??  Kinda why I got the \"Gladiator\" brand from Lowes so I could actually lay hands on the stuff before buying...",
    "permalink": "https://reddit.com/r/garageporn/comments/1jpw3ub/q_is_it_possible_to_get_1_panel_of_a_slatwall/ml2kkrk/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Amazing work! Use it in good health.\n\nMay I ask which slatwall system you put up?  If you spent this much time on your garage, I’m certain you researched well.  I’m installing a slatwall system too.",
    "permalink": "https://reddit.com/r/garageporn/comments/1jpclly/started_installing_tiles_today_i_still_have_to_do/ml2fs1x/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "slatwall",
    "body": "Looking good! What kind of slatwall are you using? What brand?",
    "permalink": "https://reddit.com/r/garageporn/comments/1jho8hg/making_steady_progress_see_before_and_now/mj8xjoz/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "Just build a French cleat system if you want to do it yourself. There are several DIY videos showing you how to",
    "permalink": "https://reddit.com/r/garageporn/comments/1kd26sl/pay_for_slatwall_install_or_do_myself/mqbw9zk/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "Sounds like paying someone to install an expensive version of French cleats you could have made from scrap wood, but that's just me. It does look nice.",
    "permalink": "https://reddit.com/r/garageporn/comments/1kd26sl/pay_for_slatwall_install_or_do_myself/mq7gugk/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "That French cleat wall is X-rated. Filthy animal.",
    "permalink": "https://reddit.com/r/garageporn/comments/1k39zs0/technically_theres_all_different_kinds_of_porn/mo3q9ey/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "This is a “shit actually gets done in here garage” \n\nFrench cleats, drum sander, 4x8 NGX for circular saw, custom speaker mounts, scrap wood bin, etc…. All around a miter station.",
    "permalink": "https://reddit.com/r/garageporn/comments/1k39zs0/technically_theres_all_different_kinds_of_porn/mo18wg8/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "thanks to you i just learned what french cleats are..! skaddis wall seems like standard pegboard but with oval holes? I dont own a 3d printer anyways",
    "permalink": "https://reddit.com/r/garageporn/comments/1jcqqu3/layout_advice_on_tool_area_and_cave/mi4h17v/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "In my experience you can plan a layout all you want but it's going to change once you start using the space. Set it up in a logical fashion with the expectation that you'll probably want to rearrange in the future.\n\n\nAs far as tool org is concerned I'm a big fan of peg board. I also have a wall with French cleats but I can't arrange it as precisely as I can my pegboard. If you have a 3d printer there are a TON of options for the Ikea Skaddis wall system.",
    "permalink": "https://reddit.com/r/garageporn/comments/1jcqqu3/layout_advice_on_tool_area_and_cave/mi4cwc3/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "Are you me? I just finished tearing down shelving, painting, and putting up french cleats. 03 Z33 here :)",
    "permalink": "https://reddit.com/r/garageporn/comments/1jafrfs/diy_garage_transformation_phase_1emptying_the/mhlfo6l/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "I don’t have a ton of tools yet, unfortunately. But is definitely something I’m working on. I’ll look into a French cleat wall, thanks",
    "permalink": "https://reddit.com/r/garageporn/comments/1j9zd4g/garage_before_after_looking_for_ideas/mhhn97h/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "What do you guys do? An easy go to if you have a lot of tools is a French cleat wall and smart storage on it.",
    "permalink": "https://reddit.com/r/garageporn/comments/1j9zd4g/garage_before_after_looking_for_ideas/mhhj621/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "Check out the “French cleat” Reddit",
    "permalink": "https://reddit.com/r/garageporn/comments/1j5etzw/this_is_a_cry_for_help/mgl0x38/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "In my last house I used a combination of French cleat for smaller items and regular screw in hooks and heavy duty wall mounted shelves for larger items. My current house that's in progress I'm considering slat wall.",
    "permalink": "https://reddit.com/r/garageporn/comments/1ilns5b/looking_for_improvement_ideas/mccvlz6/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "That’s because there isn’t a French cleat in sight!",
    "permalink": "https://reddit.com/r/garageporn/comments/1imkd79/its_been_years_since_this_bench_has_been_clean/mc5w6gc/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "What’s the French cleat wall system? Nice work! I’ve just began cleaning mine out and planned on doing some cabinets. I’m scoping out my garage dimensions this week and putting a plan in place but you’re definitely getting saved for inspiration.",
    "permalink": "https://reddit.com/r/garageporn/comments/1ihokr0/rate_my_garage_beforeafter/mayxkq4/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "Build yourself (or buy) a French cleat system.",
    "permalink": "https://reddit.com/r/garageporn/comments/1icnbt1/any_suggestions_for_my_garage_better_storage/m9slqbe/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "I'm a fan of those akro bins.\n\nI'm not sure how much hardware or small \"bits\" you plan on organizing, but we have them where I work so I can say they work great. Some even have clear lids. \n\nSomebody has to make some kind of durable adapter or something to be used with French cleats.  \n\nBest of luck.",
    "permalink": "https://reddit.com/r/garageporn/comments/1ic4e11/revamping_my_garage_workshop_storage_ideas_and/m9pntv1/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "I’d lean towards a French cleat wall system and either toolboxes or built in work surfaces/drawers for the small stuff down lower. Depends on what kind of work you’re doing of course and what tools you need to store. If you want to get into some more specific storage option within drawers, looking at a 3D printer and using gridfinity is really fun and effective:\n\nhttps://preview.redd.it/8ypz1pr9brfe1.jpeg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=5e94b2cc5a8ee6e40e9996417b51da21519bc06f",
    "permalink": "https://reddit.com/r/garageporn/comments/1ic4e11/revamping_my_garage_workshop_storage_ideas_and/m9njcvn/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "I went with ProSlat slat wall, as it allows me to keep stuff off the floor, although if you were to look right now, that myth would be dispelled! DIY French cleat system is another option, plenty of YouTube videos on how to build them.",
    "permalink": "https://reddit.com/r/garageporn/comments/1i9y3t9/ideas/m961nyl/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "I made a French cleat wall and love the potential. I’d do that and make some storage racks or hang from the ceiling to hold some of the storage totes you can get at Home Depot, Lowe’s etc. I have a bunch of random shit too, put stuff in totes categorically and make a QR code to an excel list or something if you think you’ll keep it up and stay organized",
    "permalink": "https://reddit.com/r/garageporn/comments/1hz6fss/need_some_help_on_how_to_use_this_space_as/m6niop9/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "A French Cleat version of this stuff would be cool",
    "permalink": "https://reddit.com/r/garageporn/comments/1hvdv7m/pvc_slat_ceiling/m5w7fpe/"
  },
  {
    "subreddit": "GaragePorn",
    "keyword": "french cleat",
    "body": "From what I am seeing you have some great potential. \n\nThe duct going to the left from where it originates is going to be difficult, anything to cover it is going to cost you in headroom. But the rest of it looks like a blank slate. You might look into some kind of French Cleat system, or maybe a Slat Wall system to hang stuff on the walls and organize. Coat the floor afterwards and it will be much better.",
    "permalink": "https://reddit.com/r/garageporn/comments/1htljej/help_assessing_garage_improvements/m5ebg70/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "- well lots because people do not hang up laundry like it was done before\n- the blocks can be used sure, I have them on my garage for hooks to hang my extension ladder on the back wall, outside...but I also needed a larger area vs a hole for a lag eyebolt where I will over size a clearance hole and use stretchable caulk often sold for RVs and their  roof systems to seal joints. Going on 15 yrs for a couple of my shade sail connection points",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1k493jn/hook_for_clothesline_on_vinyl_siding/mq64oi1/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "Maybe not life changing, but the myQ, that hooks up to my garage door opener, enables me to open or close the garage from the app anywhere and has a sensor that I can see if the garage door has been left open from my phone.   I think it was $20 or so. Before this we had one remote, seven adults. I eventually added a keypad as well for $15.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jszcc7/what_things_did_you_buy_under_100_that/mlz532k/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "I literally just did this in my garage to divide storage from the table tennis area. I got two big canvas painters drop cloths from Lowe’s and curtain pleat tape that I sewed along the top of the cloths. This way you can give them a “gathered” or french pleat look rather than have them just looking like drop cloths. Ordered this track from Amazon, I have an open ceiling garage sort of like a barn and just attached these along the bottom of one of the trusses. It comes with hooks that have pins and they just stick into the canvas. I didn’t take pics and the garage is back to being a mess but for a brief time it spooked really cool!![Ceiling track](https://www.amazon.com/dp/B08N6YZQWK?ref=ppx_pop_mob_ap_share)",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jokbg0/looking_for_ideas_how_to_hang_large_curtain/mkssj7l/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "I bought space in my garage.  I ordered Tuff Shed (built in a factory and professionally installed on site) and then I bought a bunch of heavy duty organizing hooks and built some shelves along one wall.  I swear the thing is build better than my last house. Everything is in there, neatly hung or stored.  I can easily get the lawnmower out. With the organizing hooks, I can tell when something hasn’t been returned.  All my bags of amendments and fertilizers are sorted in rows on the shelves.  I no longer dread going into my shed to get something. I can also open my car door without the rake falling over and whacking the car.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jg9e0b/what_upgrades_did_you_make_for_under_5000_that/miyyn7o/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "Hey, I’ve been through this, so I get where you’re coming from. I didn’t want to just hammer in a nail either, cuz I tried that once and my skateboard nearly fell on my foot. For strollers, I’ve used these heavy-duty utility hooks from the hardware store. Just screw them into a beam in your garage and hang the stroller by the handle—super sturdy and no fancy tools needed. IIRC, they only cost me about $5 each, which was pretty price-efficient for my wallet. As for skateboards, I rigged up a DIY wall mount using an L-shaped shelf bracket. Just mount the bracket to the wall and you can rest the skateboard on it. Keeps it nice and snug and looks kinda cool too. I cut a couple pieces of rubber from an old bike tire tube and wrapped them around the ends so the board doesn't scratch or slide off. \n\nAlso, have you checked out those pegboard wall setups? They’re pretty cool for organizing stuff without taking up much floor space. You can customize it with different hooks and pegs to hold everything just right. I found a friend getting rid of theirs, so I got it for cheap, but even new ones aren’t too crazy expensive. It might be overkill for just a stroller and some skateboards now, but they’re super handy once your kid gets bigger and picks up more hobbies. Anyway, hope this helps or gives ya some ideas to play around with. Kinda fun to MacGyver your own little garage system, ya know?",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1j7qz1d/need_buildbuy_garage_rack_recommendations/mgzccml/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "i forget what its called. but usually that is put on garage walls and special hooks/hangers go in the holes, that hold tools.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1ik6zfr/what_is_this_material_behind_the_beadboard_in_my/mbk3lxr/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "Hooks on the back of cabinet doors.\n\nHanging baskets for fruit and veggies that don't need to be refrigerated.\n\nDepends on your layout, but consider hanging some set of pots/pans and wall-mounting other frequently used utensils.\n\nMake sure your cabinet shelves are at the right height for what they are storing, and/or consider adding another shelf for specific things (like just cans).\n\nConsider installing two layers of pull out drawers in lower cabinets. It tends to better utilize space high in the cabinets.\n\nSome walls are good for nooks. Basically cut out the drywall between two studs and re-finish. There are a lot of YouTube videos.\n\nDepending on your layout, voids underneath or above staircases. Sometimes open shelves, sometimes drawers.\n\nSome rooms look great with a ceiling-level wrap-around shelving.\n\nWall mount TVs. It's easy and opens up more functional space. There are also recessed boxes for flush mounting TVs.\n\nIf you have a washer+dryer, there are some pretty good all-in-one units now that have heat pump and minimal venting requirements. That could free spaces beside or above for shelving or cabinets.\n\nWall-mount everything. Wall-mounted hooks for coats, bags, etc. In your bathroom, wall mount storage above the toilet for supplies. Use tall toilet paper holders.\n\nIf you have a garage, wall mount and ceiling mount everything. There are ceiling hanging metal storage shelves that are easy to add. Wall mounted bike holders. \n\nFinally, simply decluttering and pitching the things you haven't used in X years can go a long way. I cleaned out our pantry recently and it's like a magical amount of space now.\n\nAs for renting, I have always had pretty good luck mounting stuff to walls anyways. I don't cut into drywall, but wall mounting a TV was always fine. Double check your lease about move out conditions, e.g. if all holes need to be filled. Spackling holes is very easy.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1h5m6s1/whats_a_clever_way_to_add_hidden_storage_in_a/m07e6eu/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "Sure. I just hate stuff in boxes or tubs or in spaces that don't really fit the item or make sense to how that item is used. I spend a lot of time thinking about it with every purchase. Most of my house looks like people's silverware drawer. My garage is floor to ceiling french cleat with custom hangers, racks, and cubbies for gloves, pest supply chemicals, car chemicals,  power tools, I made a FC cabinet for all my abrasives, a horizontal FC shelf for anything that looks like a screw driver, etc. I know where everything in my garage goes, and it takes up much less real estate. \n\nIn my kitchen, I've converted most of the lower cabinets into full slide drawers. I hate getting low and digging around, so I cut out the shelves,  made drawer boxes, added full length slides, and screwed the door fronts to the drawers. I like making bread, so I have a huge cabinet that stores 5 gallon buckets of fresh wheat and flour. I can move the boxes up and down if I buy a different size container in the future. \n\nIn the bathrooms (Some of these are in small bathroom / linen closets), there's small racks and drawers mounted for makeup, hooks for blow dryers and curling/ flat irons, shelf and bin for razors and attachments, a rack for jewelry, etc. I also have laundry hampers in the bottom of each of those little closets. First aid and medicines are in adjustable hardware boxes, \n\nI have a 4'X8' piece of 3/4\" plywood integrated into the drywall (2X5/8\" with green glue- Plywood textured and painted to match) covered with a ton of hooks (at varying heights) that generally just get used for my pants I wore for a 2 hour meeting that I don't want to wash until I've worn them longer, Sometimes my hats or jackets end up on them. Hat organizer on the back of the hall closet door, robe hooks on the back of all the bathroom doors, Specific spots for TV remotes, I have hoops on my lamps and side tables for my glasses, etc.\n\nEssentially, if it goes in a box / junk drawer, I don't want to use more than once a year. Otherwise, it should have a spot where it lives that fits the item, and how I use or a family member use it. For the record, it also keeps me from buying stuff.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1h0nlqm/whats_one_small_diy_project_that_made_a_huge/lz8aq2m/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "This, and I tend to go a step further and color code the bags. Electric gets the non-conductive screwdrivers and a few colors of electrical tape. The plumbing gets its own pliers. I have a paint repair one, too, with spackle in a tub, sanding sponge, and knives just for that, which is different than what is in the garage for bigger projects. I also have a simple hammer/4 screwdrivers/mini flashlight/extending magnet pickup tool/wood glue bag stashed for easy access, with picture hooks.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1gl1p25/what_are_some_good_splurge_tools_youre_glad_you/lvrm6ds/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "Depends on size, budget, blah blah blah... but...\n\n* More outlets and dedicated circuits.\n* A floor drain and/or large basin shop sink.\n* Insulating and HVAC-ing to the same standard as the inside of the house.\n* A mudroom or foyer space with a bench, hooks, etc. leading into the house. Also, the garage is attached.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1ggexur/if_you_were_going_to_build_your_own_house_with_a/luqemb2/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "FWIW, I have two ladders:  \n  \n\\- 8'  aluminum 'A'-shape ladder (like your link 3)  \n\\- 16'  (non-collapsing) all-aluminum extension ladder (which is about the same length, when collapsed, as the 8'  \nBoth are stored in my garage.  \n  \nI'm 6', so the 8' ladder gives me about a 12' reach (since you don't want to stand on the top of the ladder for stability reasons, I subtract 2' from the ladder length then add my height to get the max safe reach).\n\nMy 1980s single-floor house has a sunken living room with a vaulted 12' ceiling and also a kitchen area with a lowered  7' ceiling (normal ceiling is the house is 8').\n\nThe 8' ladder - which is actually slightly under 8' when opened to the 'A' position so it can be used with 8' ceilings if the flooring isn't too thick - works well in normal rooms or when outside hanging lights or washing windows or even painting eaves (except where the roof vaults - I'd need a 24' for that).  \nIt won't allow me to reach up to the ceiling in the vaulted room.\n\nI \\_could\\_ use it to get on the roof, but the ladder will be \\_below\\_ the roof edge so a bit of searching/reaching with the foot when getting off.  \nI use the 16' for getting onto the roof, as it extends above the start of the roof's edge so I can grab onto it when getting off/on (and thus less chance of it tilting and falling over).\n\nThe 16' extension ladder is something I use outside, mostly for trimming branches or clearing debris on the roof.   \nIt doesn't have leveling feet - which is a nice feature if the ground isn't flat - so I use hardwood shims under the feet to keep the extension ladder stable.  \nBut the hooks on my ladder that hold the extended part are metal (feels like steel), not plastic. I wouldn't trust them if they were plastic (I'd be worry about them failing and me falling 10-14' feet.  Just a personal paranoia.  \nSame concern I have with collapsing ladders.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1gein51/what_is_best_ladder_for_a_homeowner/ludcq0s/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "&gt; In the meantime, you are going to want to put things on the walls of your garage--shelving, hooks, cabinets, etc.\n\nActually, I am in the process of taking things *off* the walls of the garage, emptying it out into our new shed. Which is what got me thinking about garage insulation...I accidentally punched a hole in the outside wall while taking down a mounting board I had up. \n\n&gt; Changing an overhead door from a standard to insulated isn't a huge deal and can be done over a weekend whenever you're ready for that. \n\nMy unwillingness to change it out isn't because of effort or money, it's that it's virtually impossible to get what I want on a new door...real tongue in groove cedar siding on the door itself. So I am going to kick that can down the road until all the siding needs to be replaced and I can match it on the overhead door. But seeing as it's cedar, that won't be for a while longer still...",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1f7ygkl/would_it_be_pointless_to_insulate_my_garage_walls/llawdfa/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "My own two cents...\n\nEveryone (in my experience) eventually winds up turning their garage into some type of living space--whether it's expanding it to make a finished den or bedroom or just using it as a workshop or work out space.  There is going to come some time in the future when you want to be in your garage for an extended period of time and not deal with the heat or cold outside.  In the meantime, you are going to want to put things on the walls of your garage--shelving, hooks, cabinets, etc.\n\nI 100% vote for insulating the walls even if you don't have immediate plans to expand out there because you will someday.  Changing an overhead door from a standard to insulated isn't a huge deal and can be done over a weekend whenever you're ready for that.  Adding a split system for heating and cooling isn't difficult later on when you want it.  But adding wall insulation later is a huge pain in the ass.  If there are options for you to do it now, go for it.  It may be years before you thank yourself, but you will eventually thank yourself for having done that.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1f7ygkl/would_it_be_pointless_to_insulate_my_garage_walls/llaukwf/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "I was mounting a 2x4 to the garage ceiling for bike hooks. Then I was upstairs having a beer. My brother in law runs up to tell me it’s raining in the garage. I put holes into the water going into the house. At least the shutoff was right there. Had to cut out a section about one foot and sleeve a section of new pipe.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1f2iw42/whats_your_most_fuck_im_an_idiot_damage_youve/lk8hwsn/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "It took us a while to accept and comply - but ALEXA!  I swear, if the network goes out I don't think I will know how to turn off the lights!   It is awesome.  I have things set up so I just say \"Alexa, good morning\" and certain lights turn on and I get the weather report!  I even have something hooked to my water hose so I can leave the hose stretched out to where I use it and just tell Alexa to turn the water to the hose on!\n\nMyQ that hooks up to my garage doors so I can close/open/check status of the garage doors from my phone.\n\nBedjet - sits under your bed with a flat hose that snakes up the side of your mattresses, coming out on top of mattress under your sheets.  You can use the remote to have cool air or warm air, control the level/time, even create \"play lists\" that switch between the 2.\n\nSmart thermostats - not only are they on a schedule, if I want to change it I just pick up my phone/tablet.\n\nLatest thing I got that I LOVE is the Shark FlexBreeze fan!  It is on a stand or you can pull the fan out and it has short legs you pull out to convert to a table fan.  Best think is that it has a battery you charge!  Bugs outside where you are hanging out/working?  No problem - bring the fan out.  And it is insane how cold this fan makes your space feel.  It isn't super cheap for a fan, but it is worth it!   We have 3 and I'm considering a 4th!\n\n  \nKeypad locks - awesome!  And the ones we have connect to the internet and you can schedule them to lock/unlock.  We have it set to they lock at 10pm in case we forget to lock them.  \n\nRobotic vacuum that self-empties....need I say more?\n\nBefore I replaced most of the windows downstairs with picture windows, I purchased this gadget from amazon called the Gecko Robot Window cleaner!  AMAZING!  I didn't have much hope that it would work, but it did and was awesome!  Now, it doesn't get into corners that well - but when it comes to either that or having to clean your windows from the outside that you need to drag out a ladder to get to - - - -",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1ey438m/whats_a_minor_home_improvement_project_that_made/ljgcwi8/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "For garage hooks, self drilling wood screws like #8 or #10 should work well. Brands like GRK or Spax are reliable &amp; easy to find. Just make sure they're long enough to hold the hooks securely.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1e7hj8z/drilling_into_a_shed/le0ajcs/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "I did exactly this.  But I built a 3/4 wall separating it from most of the other side and drywalled it.  There was already a post there so I just extended it through; it covers most of the open side.  It gave me more space to hang stuff (and hung my bikes and shelves on the other side), a much better dust barrier, and I ran electrical through it.  Unfortunately my laundry is on that side as well as an access door, so I put up eye hooks in the ceiling and got translucent tarps that I hang from the door around to where the wall is.\n\nDust still gets through, but it's much better.  I'd eventually like to attach the entire thing to the ceiling and have it roll down like curtains when I need it.  I also think that if I use a little duct fan and pipe the air out that it'd create negative pressure to help keep dust out of the rest of the garage.  And, I have dust control - a Wen air scrubber on the ceiling, and a dust extractor with a Dust Deputy, that runs to my table saw, router, and chop saw.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1dq0u2c/how_to_block_off_bay_in_three_car_garage/lal333e/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "Fresh paint on the front door.  Probably the cheapest way to add some curb appeal. \n\nConverted closet by the kitchen to pantry. The shelving system can be removed and shelf’s with clothes rod can be added if the next person needs it. \n\nReplaced the weather strip around the exterior doors.\n\nIf you have central HVAC with ceiling air vents, I would suggest sealing the gaps around the air vents.  You can get the acrylic mastic in tub or tube form and seal the gap between air vent  and drywall.   I’d recommend the tube and use a chalk gun to apply it. I tried the mastic with mesh tape and it was a mess. Home Depot and the like will typically carry it in aisle with hvac stuff.\n\nGarage organizational system, you probably will get a decent start with $500 but will probably go over once you’re done.  \n\nI went with Rubbermaid fast track garage and 24” wall mounted wire shelves for top shelving system.  \n\nIf I would do it today I would make my own French cleat rails and install the whole length of the garage. Instead of spending up to $20 per a hook from Rubbermaid you could add French cleat to a cheap generic garage storage hook.   \n\nThe plus with using the fast track rail is I can 3d print hooks for light weight items I want to hand on the wall.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1cxynqt/has_anyone_made_a_home_improvement_or_added_a/l566psu/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "I grew up on a ranch with access to a lot of shops.  I have thoughts.  I went though this same thing.  \n\nIn my own garage, I set up pegboard for wrenches, hammers, etc.  Plumbing tools have a space and woodworking too.  Pony up and buy good tempered pegboard that's 1/4 inch and get the screw in hooks.  \n\nFor specialty auto stuff, sockets, and ratchets, I have a rolling toolbox.  \n\nHere's where I got smart.  I put cupboards up everywhere in the garage.  I got them at a reuse place for super cheap.  Each one has a different theme.  Electrical.  Plumbing.  Sandpaper and Drilling.  Sawing and routering.  Automotive rechargeable tools.  Impact drives and drills.  Misc Rechargables.  You get the idea.  It's magical.  Even if you don't have much, if you can fit them in, I recommend this.  What you have will only grow.  I put some hardcore shelving in for all my motor oil and cans of stuff.  It's all pretty nice and saves me a lot of time looking for stuff.  Like I had to cut and solder a pipe the other day and bam, it was all in one place with no searching, digging around in a bin, moving bins around, or other crap mixed in.  It was all in the plumbing cupboard with emery on a roll in the sandpaper shelf in that cupboard.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1ctpxsp/slightly_offtopic_but_i_need_to_organize_my_tools/l4ejxwy/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "garage hooks",
    "body": "I would say:\n\n\n a couple hooks to coil the cord.\nBuy a vacuum and use the mechanism.\nGarage extension cord retractor.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1cq6b40/cord_retractor/l3r4l3x/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I went with Slatwall in my garage and Guardian in my shed. I think Guardian is built better than Slatwall but with both systems the accessories get expensive quickly.\n\nI just sort of threw them up but in hindsight I should have measured 16” on center and drawn lines so I could hit the studs in an alignment. My install looks janky but I have no plans to move any time soon so it will only irritate me and not a prospective buyer.\n\nGlad I have them though. Big cabinets in my garage take up too much space. So now we have a couple of “stations” where we can keep things and it looks better to me.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1ew6lio/garage_wall_organizers/liwfwcf/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I had the exact same thing but with an even larger gap. Mounted a sturdy 2x4 frame behind and made my wall into a feature wall with walnut premade slatwall panels. Led strip on top and it looks killer.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1elmv7i/is_3000_unreasonable_for_getting_a_recessed_tv/lgwg0uf/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "If you're not familiar, slatwall is a mounting system used in retail and workshops for hanging stuff.  Similar to pegboard, but more modular and with higher weight capacity.  Imagine [this](https://www.garageliving.com/hs-fs/hubfs/xgarage-slatwall-family-wall-storage-organization.jpg.pagespeed.ic.xKkG5NWGRa.webp).\n\n\nThe reason I mention it is because you asked about improving the value of your house.  I could care less if a garage is finished.  Insulation would be nice, but in a lot of ways an unfinished would be more functional to me.  On the other hand, a garage lined in a mounting system of some kind would be valuable to me.\n\n\nI would say it's a lot less work than drywall.  They come in 4x8 sheets in lots of styles and colors.  Just line then up and screw them to the wall.  Probably some cutting to fit in places, but it would be like working with plywood.  No tape, mud, or paint.\n\n\nNow the downside.  Sheets of slatwall are a lot more expensive than drywall.  Pegboard could be a cheaper option.  It's also only really for the walls, so if you want the ceiling covered then you're still back to doing drywall.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1cpzx9o/will_putting_drywall_on_garage_wallceiling/l3opfni/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "Any references to the easiest way to get slatwalls done? Is it more, or less work than drywall?",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1cpzx9o/will_putting_drywall_on_garage_wallceiling/l3okuay/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "Do slatwall instead of drywall.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1cpzx9o/will_putting_drywall_on_garage_wallceiling/l3of96b/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I’ll echo French cleats. It’s the most affordable and most flexible option but requires leaning some minor DIY skills.  \n\nAfter French cleats, things get expensive fast. Slatwalls. Gladiator cabinets. Versatrak.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1c91j3h/garage_organizing_tools/l0irpy7/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I've been holding off on our closet because it's ok, but what I really want is long hanging rods so I can actually slide stuff around which eliminates boxes like pax or California closets.  What we have now is wire shelving that has separators every 12\" or so. (our closet is really a room that is also storage for the house)\n\n\nI keep looking at commercial slatwall systems (like for retail stores) and wondering if I'm insane.  Has anyone ever done that?\n\n\nI just really hesitate to spend a bunch of money on something and then have needs change.   I feel like slatwall would mean we could just change shit around if we needed to. ",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/197l5j2/folks_with_custom_closet_systems_ikea_pax_vs/ki1xher/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "Slatwall, like those used in boutique store displays. Hit me up and I can mail you a bunch of slat hangers.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/186qldl/is_there_a_better_option_than_pegboard/kbdanru/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "Slatwall is a great option. I've found many panels over the years, mostly from stores going out of business. Don't think I've ever paid a penny for what must be a dozen 4x8 panels over a decade or so. They're very heavy and can be awkward to install, though. Plywood backing helps give them more rigidity but adds to the weight. A variety of hooks and hangers are always available on eBay.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/186qldl/is_there_a_better_option_than_pegboard/kbbtg8b/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I just put up 6 sheets of the Menards slatwall in a shed this summer. This stuff: \n\nhttps://www.menards.com/main/paint/paneling-planking/paneling/dakota-trade-3-4-x-4-x-8-prefinished-slatwall-panel/lamslatwallwhite/p-1444428251813-c-8168.htm\n\nNote that install is a two-person job and it needs to be screwed to the studs at every third or fourth slat, at the bottom of the groove there's only 5/16\" of coarse particle board so the whole panel really wants to crack along the grooves. \n\nWe didn't use the stupid-expensive metal inserts, just hung the brackets directly on the slatwall. I'm sure it's weaker without those inserts, but that turns a $300 project into a $1300 project. It's held shovels and rakes and ropes and all manner of stuff for the past 6 months without issue.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/186qldl/is_there_a_better_option_than_pegboard/kbbq5ha/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I’ve often thought about slat wall like you see in retail stores. Lots of accessories, and it’s usually pretty cheap. I’ve haven’t heard of anyone going this route though.  \nhttps://www.uline.com/Grp_68/Slatwall",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/186qldl/is_there_a_better_option_than_pegboard/kbamqml/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "Slatwall",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/186qldl/is_there_a_better_option_than_pegboard/kbajktt/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I covered an entire wall in steel slatwall, it's amazing.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/16hmot8/our_version_of_garage_storage/k0ggf3o/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I’ve come to feel that any slatwall product is overpriced crap.  They all fail and bend sooner or later.  \n\nFor me, I put .75” plywood sheets on my wall and they’ve been killer tool storage.  Hang anything, no give.  Screw in anything you want.  I even hung my wheel barrow.  Way cheaper per square foot, fit any hook you want, paint it any color you want.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/163892y/slatwall/jy2g7yo/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "One 4x8 sheet of drywall is like $15. \n\nMy seat of the pants estimate by your pics is your garage is probably in the neighborhood of 25’x25’? \n\nAssuming all 3 walls (pretending no doors, windows, etc exist) need complete coverage, plus the ceiling, that would be around 750 sq ft + 625 sq ft or around 43 sheets of drywall. That’s somewhere around $650 for 1/2” at my local Home Depot and there’s a discount for buying that many so it’d actually be less I just don’t know how much less. \n\nI’d estimate 2 boxes of drywall screws would be enough. Probably $50? \n\nDrywall bit for your drill - they come in 4 packs. Around $10. \n\nIf you don’t have a cordless drill, for something like this the Milwaukee M12 driver would do nicely. $200. Worth getting an extra battery or two. Call it $300. \n\nBox cutter + a long straight edge are all you really need to trim it, but if you really want professional looking cut edges, you could snag the Milwaukee M12 oscillating saw for another $200. Or their little cutoff wheel tool for the same. Either would be great. Both would be even better. Let’s ball out and say both. So there’s another $400 or so. \n\nWhat are we up to, $650+$50+$10+$300+$400? So about $1500 (rounded up for tax) in tools and materials. \n\nYou going to do insulation too? Add another few hundred depending on what you get. Rewiring things while you’ve got it down to bare studs isn’t a bad idea either. $140 for 250 ft of 12ga romex at Home Depot should be more than enough. Maybe another $150 for new breakers and a bigger panel box if you need it. \n\nWe’re still not even to $2k yet. Let’s see…\n\nI have no idea how much that lift rental is for the ceiling but probably not much. \n\nBiggest thing is going to be time / labor to DIY. For reference, my garage is about 20x20, and it took me a bit over a week and a half to rip all the old walls and wood shelving out, install some new studs and reinforce old ones as needed, rewire everything including adding new outlets and runs for lighting, foam insulate the studs, install insulation, then drywall, then slatwall over it. It was a fun project and I used exactly the tools I just recommended it came out really nice and clean. \n\nYou’ll also need a level, and either some wood scraps or something like [these air bags](https://www.homedepot.com/p/Winbag-Original-Patented-Air-Wedge-and-Leveling-ToolLifts-up-to-300-lb-2-Pack-E157302/303480393) to level things out as you mount them. \n\nBut yeah. I’d definitely do it myself, buy the tools to have for future projects, and save $8k in the process.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/15ltmuy/garage_drywall_estimate_10500_thought_itd_be_5k/jvg2ibf/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "[https://imgur.com/gallery/9Ao7PVD](https://imgur.com/gallery/9Ao7PVD) \n\nI went with a combination of white and a blue-gray. My garage does have some natural light from the upper row of garage door windows, and one window on the side (but it is on a dark, shaded side of the house). The builder completely finished the garage with sanded plaster, wood trim, and paint in a plain white color (Benjamin Moore Decorator's White). The original white color is still there above the slatwall. But that plaster just grabbed spider webs, bike wheel dirt, etc. And the cement floor was cold, had some cracks, and was annoying to clean. So I put a plain 1x5 board at chair-rail height, painted the bottom half with a commercial-grade Benjamin Moore paint (Scuff-X Matte, Oxford Gray), and swapped out the cheap Big Box Store pegboard panels for white slatwall from Diamond Life Gear. The BM paint is thick enough to smooth out that sanded finish and it stays much, much cleaner. And the slatwall makes organizing stuff much easier.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/13t82e0/what_color_did_you_paint_your_interior_garage/jlyh56p/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "It looks like they added a new wall on top of the old wall?  Instead of drywall back then they put cement over wood slats and then plastered over the cement.  I would apply some premixed concrete patch or even stucco patch to prevent further pealing.  [Slatwall pictures](https://www.google.com/search?q=old+slat+walls&amp;rlz=1CDGOYI_enUS953US953&amp;oq=old+slat+wall&amp;aqs=chrome.0.0i512j69i57j0i22i30l2j0i390i650l4.13290j0j9&amp;hl=en-US&amp;sourceid=chrome-mobile&amp;ie=UTF-8#imgrc=KekPN6uADViBBM&amp;lnspr=W10=)",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/13315al/im_a_new_homeowner_and_recently_demoed_some/ji7q4w7/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "I’ve got half a catalog of Milwaukee M12/18, but zero packouts. I have them hanging underneath a garage shelf or on slatwall hooks. If I’m needing more than 2-3 at a time (rare), I’ll just grab an old cardboard box or something. \n\nAs far as Milwaukee vs DeWalt (and may as well throw Bosch and Makita in as well), they’re both solid quality. Just pick one and stay with it for the battery interchangeability. Look through the full lineups for both and weigh versatility of the line vs cost. I went with Milwaukee because that’s the drill/driver package I happened to buy 12 years ago.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/105xw85/best_tool_storage_system/j3djed7/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "That's a fire wall - framing on top could be a vestige of what was built when or could be someone didn't want to mess up the integrity of the fire wall. \n\nAre you sure the wall is uninsulated? Because otherwise, just rock over it and get in your taping practice. You could make holes, do blown in insulation and rock over - this saves you the hauling of the old drywall as well and you'd end up with 1\" drywall for both fire and sound deadening.\n\nIf you really want to open it up to add insulation be sure to cut the old drywall a good 4\" from the framing on top so you can seam it properly. If you cut it flush to that framing, you'll have a hard time getting it to fire wall standards.\n\nIs it painted green or is it green board? Somebody was worried about moisture... it's a bit odd.\n\nConsider covering it with plywood and French cleats for an awesome garage system. You can consider covering it with slatwall for a nice looking, somewhat awesome garage system, though the load bearing capacity of slatwall can't hold a candle to French cleats.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/x7i6um/redoing_garage_drywall_some_wood_framing_in_the/incsv0w/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "slatwall",
    "body": "$200 per 4x8 panel? Versus like $40 for a 4x8 panel of wood slatwall? 😬",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/uqz4vi/slatwall_question_for_garage/ibru0k8/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "The corner jointing may be an issue if you start putting pulling forces on the frame, it's all under compression when it's standing.  But it doesn't look any sketchier than a standard cheap picture frame.  \n\nYou could get some 90 degree flat metal brackets to screw into the corners to reinforce.  If that was done I'd be pretty confident hanging it.  \n\nFrench cleat would be great.  I'd be lazy and probably just used appropriate picture wire and hardware.  Otherwise I'd treat it like any heavy piece of glassed framed art.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1ki0vm6/is_there_any_way_to_hang_this_mirror/mrb9g4e/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "Oh cool, I didn't know there was a term for that. So the Sektion rail is basically just a metal French cleat?",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1kg50r7/the_suspension_rail_for_ikea_sektion_cabinets_is/mqvwsps/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "Some people use French cleats for uppers, but the cabinets need to be designed for them, unless you're cool with a gap. For lowers, you screw them into studs. If you're doing a full kitchen reno, you can put blocking in the walls, so you can attach cabinets anywhere at whatever elevation the blocking is at.\n\nAs for leveling the cabinets, I highly recommend picking up EZ Level cabinet feet. They're a little pricey at ~$17/pair(2 pairs required per cabinet), but they make installing the bases a breeze, so they're well worth the money.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1kg50r7/the_suspension_rail_for_ikea_sektion_cabinets_is/mqvwji5/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "French cleats have been used for cabinets for awhile.  You can find metal ones online pretty easy, but wood's been used for centuries ",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1kg50r7/the_suspension_rail_for_ikea_sektion_cabinets_is/mqvw4e8/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "Look up a French cleat\n\nBasically hang a support as wide as the mirror and anchor to the studs that it will hit….then you can anchor the mirror to the support.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jq4cxq/dry_wall_mounting_a_50_pound_mirror/ml6y11x/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "Toggle bolt and French cleat is what I did for something similar",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jq4cxq/dry_wall_mounting_a_50_pound_mirror/ml59xue/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "You could use French Cleat hangers, easy to mount and easy install mirror with. ",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jq4cxq/dry_wall_mounting_a_50_pound_mirror/ml4yaj3/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "Yep.  Did our kitchen last year.  Got the cabinets out and had damaged drywall. Decided to replace it and when I opened the wall up I found that a 10’ section of my exterior wall had 6 studs that the bottom 1-2 ft were rotted away from an old water leak.  That lead to discovering hidden floor damage as well.  It quite frankly sucked big time.  But it’s done (mostly).  I do have a couple of minor trim issues I still need to finish, it was definitely worth it but I learned that no remodel is a quick job and will inevitable take 2-3x longer and cost at least 1.5x the budget. There are several things I’ve learned that I would do differently (like hanging my upper cabinets with a French cleat! So much easier by yourself). Also figured out that buying everything at once (if you don’t have sufficient storage) is a dumb idea.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1joi1g7/regretting_our_diy_home_renovation_halfway_through/ml1rxiy/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "French cleat or toggle bolts",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jofcms/heavy_duty_drywall_anchors/mkrn1z0/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "You can make a French Cleat, mount it across the studs and mount to the back of the mirror",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jofcms/heavy_duty_drywall_anchors/mkrf1iz/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "That is one unconventional wall so it's hard to tell what it will/will not handle. One idea that comes to mind is to make a \"French cleat\" that runs the full width of the upper-back of the cabinet. I'd also add a 2x3 as a bottom support, again running the full width of the cabinet. Use many wood screws that are as long as possible without poking out the back side of that wall.\n\nI'm confident in the ability of those 2 items to provide ample strength, assuming the wall material hasn't been weakened. But without looking at how that wall structure is anchored at the top &amp; bottom I can't say that the cabinet won't cause the whole wall to fall over.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jmuhbn/can_you_hang_a_cabinet_on_a_panelboard_wall/mkfghyg/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "French cleat connected to studs",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jmkwn3/how_to_hang_a_heavy_cabinet_into_drywall_where/mkck53u/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "French cleat is the way to go.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jmkwn3/how_to_hang_a_heavy_cabinet_into_drywall_where/mkcfcmi/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "French cleat or structural screws directly into studs. Whatever you do make sure you are drilling through part of the hutch that can support the weigh. 1/4” plywood backer is going to work.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jl269p/best_way_to_hang_hutch_top_on_wall/mk01ntt/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "Second for the French cleat method as long as you’re drilling into studs. If you’re concerned about it standing off the wall, you can always add a bit of trim around it that’s stained a similar color, maybe even rough it up a bit to match the age of the hutch?",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jl269p/best_way_to_hang_hutch_top_on_wall/mk00r9e/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "I would go with a French cleat for something as large as a hutch.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jl269p/best_way_to_hang_hutch_top_on_wall/mjzzp6x/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "French cleats are super secure and stable",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jl269p/best_way_to_hang_hutch_top_on_wall/mjzx5xa/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "I hung an 7x8ft mirror and heavy frame using a very long metal french cleat spanning multiple studs. I hate that mirror! My wife loves it and it has had to be moved from China, to Singapore, South Africa, back to Singapore, now in the US. Out of all the various hanging systems, the french cleat was the most secure and easiest to hang.",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jj2fzh/how_do_i_hang_a_40lb_mirror_it_has_two_loops_on/mjn8sc4/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "Not sure why you’re getting downvoted but that is true, but also people have not verified that those French cleats will work on the mirror, a lot of them are thin hollow anywhere but the edges",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jj2fzh/how_do_i_hang_a_40lb_mirror_it_has_two_loops_on/mjn8evp/"
  },
  {
    "subreddit": "HomeImprovement",
    "keyword": "french cleat",
    "body": "French cleat ftw! I literally hung up a family heirloom mirror using a French cleat this weekend, ~60” x 36” mirror using an 18” cleat. I was able to catch 2 studs with and and for good measure used half of the remaining holes with dry wall anchors. \n\nIf I was gonna be the 4th generation to use this mirror, I wasn’t going to be the one to break it! \n\nSimilar to OP the mirror had 2 eyelets already on it so I took those off and installed the cleat. Word to the wise, hand screw in the cleat to the mirror!!",
    "permalink": "https://reddit.com/r/HomeImprovement/comments/1jj2fzh/how_do_i_hang_a_40lb_mirror_it_has_two_loops_on/mjn4dtg/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "I have a toolbox with the basics.  Screwdrivers all sizes, pliers, and wrenches.  A socket driver set.  Allen wrenches.  A level, a utility knife.  Plumbers and elecrical tape. Wire nuts.  A supply of nails, screws, hooks, etc.  A rechargeable light with a hook has proven very handy.\n\nI have a lot more stuff from projects, things I use much less often.  Clamps.  A set of chisels.  Prybar.  Lots of painting supplies.\n\nWhat comes in handy?   I have one of those universal tools and a changeable head screwdriver in the kitchen.  I often need to fix one very minor thing. I don't feel like getting the toolbox from the garage, etc.\n\n![gif](giphy|ZYKC6DfO4rZFhipAqK)",
    "permalink": "https://reddit.com/r/DIY/comments/1jzn17u/what_are_the_home_repair_tools_you_actually_use/mnadjb6/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Nice job!! Random - the hooks you have to hang the bikes, would you recommend them or is that system not ideal? Have two bikes I’m looking to get off the ground somehow in my garage.",
    "permalink": "https://reddit.com/r/DIY/comments/1j8gfeb/built_my_daughter_a_new_bed_with_a_built_in/mh8aef4/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Yes, you can have an odd shape. Your cost per sqft will be higher, but it can be done.\n\nIf it has a roof it needs to be able to withstand snow load. I don't know what this is in your area.\n\nThe pillars need a foundation. The cement pad will not hold the weight. You will need to drill the concrete and pour proper footers.\n\nThis is not beginner DIY territory. It would be a lot easier to build a shed, and make space in the garage, than an awning, with a large footprint, odd shape, and a concrete pad in the way of the foundation.\n\nHave you considered hooks and a shade cloth?",
    "permalink": "https://reddit.com/r/DIY/comments/1irs8gq/pergolacarport_advice_is_this_possible/mdb6q6u/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "I painted all of our old cabinets once. Took all the doors off, screwed hooks into the bottoms and hung them on conduit pipes hung in the garage. Then I got an expensive but reliable spray gin and spray painted them. \nAlso consider just ordering paint grade drawer fronts and new doors.",
    "permalink": "https://reddit.com/r/DIY/comments/1ir263y/kitchen_cabinet_painting_should_it_be_easier_if/md4z02t/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Don’t use those flimsy gym mats. Go buy horse mats!  Thicker and cheaper. We put them in our MN garage and that totally helped keep the cold from coming up through the floor. You can also put up sound blankets on hooks in front of the garage door. Best of luck to you.",
    "permalink": "https://reddit.com/r/DIY/comments/1ij4fnn/insulating_garage_floor_how_to_make_a_higher/mbd7tpt/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Cheap options:\n\nPaint stairs. Look up how to do it well with the right type of paint. But paint is cheap. \n\nHuge rug - Facebook will have 10+ feet rugs for sale for cheap. \n\nWall decorations - find out how to use temporary wall hooks or whatever people recommend for stucco or whatever that is, to hang cheap pictures from estate sales or garage sales on the walls to cover them up. \n\n\nWouldn’t worry about the ceilings personally. \n\nA cheap diffuser would help with basement smell. \n\nGood luck!",
    "permalink": "https://reddit.com/r/DIY/comments/1i623s1/getting_back_on_my_feet_in_a_friends_basement_are/m89esg7/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Doesn't this look great? Too bad, the heavy-duty adhesive gave way within a week and it all fell apart...I need to figure out a way to attach these 'screw into wall' heavy duty garage hooks inside this plastic garden cabinet. Do I find some kind of wood and brace it behind the plastic? Can I just use nuts and bolts?",
    "permalink": "https://reddit.com/r/DIY/comments/1h1y4zl/how_to_bolt_these_garage_hooks_inside_a_plastic/lzezxwp/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "I hear what you are saying and that’s good general advice, but at 265 lb rating per anchor and me using 8 of them, I’ve never had a problem. I also used them for garage hooks that only use 3 each and they hold up my 12’ kayak and allow me to flop them on the hook (e.g. not gentle). A stationary TV doesn’t exert a tremendous amount of horizontal pressure. If you have plaster/lathe or crumbling drywall, 100% go for a stud, or if your TV mount includes extension arms. \n\nI have an 86” LG in my basement and it weighs over a 100 lbs. The wall is actually made of plywood (it’s weird, previous owner used the room for batting practice indoors). I didn’t even trust the plywood to hold it so on the opposite side I used a 6’ piece of metal strapping to brace the mount from the opposite side. Every other TV (42”-50”) I’ve used these anchors.",
    "permalink": "https://reddit.com/r/DIY/comments/1ftwaf9/tv_mounting_gone_wrong/lpw6e6p/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "I would add a railing all the way around for drinks and small plates for when the party’s in the garage. Coat hooks underneath. As the other reply said, add vertical strips of wood for framing and covering up seams of the metal.",
    "permalink": "https://reddit.com/r/DIY/comments/1f8hexv/wife_says_it_looks_bad_how_do_i_get_rid_of_the/llf2aop/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Home Depot sells garage storage hooks of all sizes and strengths. I would recommend a couple that can hold a Boeing 747 with a sword like that.",
    "permalink": "https://reddit.com/r/DIY/comments/1f6o7ea/best_way_to_mount_this_on_a_wall/ll2bsjx/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Oh snap, that's brilliant and a lot more sturdy especially with a cats weight pressed against it. If I ever had the space the first thing I would do is get a table saw or a handheld and some horses with a few extras just so I could actually build things to solve problems. I'm stuck having to jerry rig with cheap stuff like command hooks or whatever awfully built or incorrect size things amazon offers lol. I wish my dad lived closer because he had a whole garage of stuff though it's a complete mess and everything is rusting so my weird ideas just have to work for now. You do it right though which I'm jelly of and saves having to redo it later",
    "permalink": "https://reddit.com/r/DIY/comments/1eguuia/how_to_keep_my_cat_safe_on_a_3rd_floor_balcony/lfy1ozj/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Get:  \n- cordless power drill with a collection of screwdriver/hex driver heads\n\n- a good 3' level\n\n- a 1\", 2\", 3\", 6\" putty knife set\n\n- a resealable small bin of drywall repair/patch\n\n- a stud finder\n\n- Drywall saw\n\n- a big old box of screw in wall anchors, with hanging screws\n\n- Sandpaper and a sandpaper block in various levels of abrasiveness\n\n- Various hanging things, hooks, 3m EZ strips or other adhesive hangers in various sizes\n\n- Channel locks in medium, flat and phillips screwdrivers in a #2 and #1, wire strippers with cutter, adjustable pliers with 6\" handles, just the basics.\n\n- paint brushes you love, rollers, tray, squeegee/opener, edging tool\n\n- Crescent wrench in medium and large\n\n- some teflon tape for little plumbing fixture things\n\n- some teflon spray for squeaks and things. \n\n- a 6' or 8' ladder\n\n- A tool box or tool bins/parts bins to keep all this together\n\nYou're going to be spending a bunch of time in a new build 1. painting things, 2. hanging things up, 3. patching little nail pops and imperfections (and holes you might make). Get a little kit together with a consistent set of things you use to hang pictures, curtain rods, etc. etc. \n\nYour garage had better be drywalled, but if it's not, that's a fun project. Get good at patching drywall, that is a skill you will use forever, and it's pretty easy but takes a lot of practice to get good at. \n\nLearn to replace a switch with a dimmer switch (you will likely have to do this 8 or 10 times in the first few years) ask someone to show you how (safely). \n\nLearn to replace a basic light fixture / fan (safely). You'll do this a bunch also. \n\nLearn how to hang a curtain rod. \n\nCongratulations!",
    "permalink": "https://reddit.com/r/DIY/comments/1eaguwp/what_skills_or_products_would_you_recommend_to_a/leln8h0/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Thank you. We sprayed it in the back yard. Not in the sun, but relatively warm with high humidity. It is our first painting project and it seemed a lot easier to do it in the yard having the items hanging from plant hooks than covering up everything in the garage.",
    "permalink": "https://reddit.com/r/DIY/comments/1dxkdob/what_did_we_do_wrong/lc3730v/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "How about just hanging a curtain to block the storage part. You have a garage door rod there maybe hooks are all that is needed. Then it's not a permanent reno for the next person that actually might want to park a car in there. Get an area rug for the floor and hang artwork on the blocks. looks cozy. Is it hot in there though?",
    "permalink": "https://reddit.com/r/DIY/comments/1dmwcuh/help_with_garage/l9zdcb5/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "I had something similar for my garage, but there were grommets across the top. I was fortunate that there was a steel lintel over the door, so I used hooks that had a strong magnetic base. But command hooks would have worked, too. The sides did have velcro tabs with a sticky backing, but the adhesive cleaned up fine when we moved out.",
    "permalink": "https://reddit.com/r/DIY/comments/1dm30iv/i_am_renting_can_i_add_a_screen_without_drilling/l9u0374/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "We used bamboo roller blinds (from Home Depot) hanging from hooks installed on the exterior soffit. With about 4\" between the blinds and the windows, they were extremely effective and inexpensive. We didn't use them in the winter, they were easily removed and kept in the garage until late spring.",
    "permalink": "https://reddit.com/r/DIY/comments/1dgoxf1/we_have_a_west_facing_master_bedroom_that_gets/l8tnbhr/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "..she's 7 months old, 19lbs. I'm literally rocking her , here. Not under-dogging her. \n One hook holds thirty pounds, so two hooks holds sixty pounds ...I do understand the difference between load types, I cannot do the math, but I think that makes up for the difference on ~20 lbs of a dynamic load. \nLook if this stupid setup was out there for a year or more, elements getting to it and she was heavier, maybe I swing her everyday and really abuse the thing...I'd agree. But for such a temporary solution...I feel like it certainly will last long enough for my purposes, and nowhere near the limit of how long it would last. \n\n¥This is more of a rant, sorry. \n\nLike I literally ordered the swing at 10pm and it came the next day, wasn't sure what mounting shit it came with, but I had this stuff in my garage. Just wanted to use it to get her out of the house where my wife works from home 2nd shift. \nI tried doing her a favor, damnit. \nI get home from my job and the kid is 100% mine for the next 3-4 hours til bedtime, so I do my part. It isn't as big a part as hers, I understand that. But I'm not a deadbeat is my point. \nHonestly this goes so so so much deeper and if they made an affordable couples counseling, that's where we should be. Too bad so sad, now divorce is on the table :) lol. \nI am an electrician by trade not a carpenter, but I do know how to use power tools, and grew up working in the trades and with my hands. She's constantly telling me I can't do this or can't do that, doesn't even want me to try. \nI fucking hate it. \nI resent her. She's destroys my confidence and destroys my personal growth in pretty much every area besides \"being more sensitive\" . Jesus Christ it makes me wanna puke. If we run out of men who can actually do shit with their hands, then I'm pretty sure society collapses. \nIt's a really bad, toxic, vicious cycle and the only escape is to not be together...but now there's a kid. And she definitely changed after the kid. Nobody thinks it's permanent but it certainly feels that way. \nI wouldn't ever claim to be blameless...God do I suck. \nBut the level of shit ive received for trying to help..it's infuriating. It's always criticized. And then guess WHAT? I am constantly being berated for not doing things.",
    "permalink": "https://reddit.com/r/DIY/comments/1d5pubg/opinions_and_sorry_for_the_format_keeps_not/l6nf42y/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "The tree can stay or die, I don't care. It keeps growing up into the power lines and they keep hacking it off, this is by far the longest lasting branch on the tree. \nI will reiterate, this is quite temporary. \nBut what about it isn't safe? \nThe two bike hooks that can hold 30lb mountain bikes, that mount on 2×4 framing in the garage, or the way I've secured the 2x4 to the tree?",
    "permalink": "https://reddit.com/r/DIY/comments/1d5pubg/opinions_and_sorry_for_the_format_keeps_not/l6n6u46/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Something like these. \n\nTwo up along bottom; two down on top \n\nGarage Hooks Heavy Duty 14 Pack, Steel Garage Storage Hooks, Tool Hangers for Garage Wall Utility Wall Mount Garage Hooks and Hangers with Anti-slip Coating for Garden Tools, Ladders, Bulky Items https://a.co/d/0AvRpt1",
    "permalink": "https://reddit.com/r/DIY/comments/1d4zdqe/ive_ended_up_in_the_possession_of_an_aircraft/l6hxedi/"
  },
  {
    "subreddit": "DIY",
    "keyword": "garage hooks",
    "body": "Those kind of \"void\" warnings are something that can't be enforced.  Installing a garage door opener should be fine. However, if there's any springs involved? I would definitely contact a pro to handle it.  The springs used with garage doors are often under a lot of tension, and fucking with them can easily injure/kill you.  I don't mean the small coiled springs with hooks on either end. I mean the big spiral tension springs that look like they belong on a lifted truck.",
    "permalink": "https://reddit.com/r/DIY/comments/1d1409v/garage_door_opener_diy_will_void_door_warranty/l5rxxvz/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Awesome! Unfortunately, slatwall hooks can't work in it, though...",
    "permalink": "https://reddit.com/r/DIY/comments/1jid78z/vertical_slat_wall_howd_i_do/mjf8l5o/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "https://www.menards.com/main/paint/paneling-planking/paneling/dakota-trade-3-4-x-48-x-96-prefinished-slatwall-panel/lamslatwallwhite/p-1444428251813-c-8168.htm\n\nDo some slat wall if you wanna be fancy. That have some fun attachments.",
    "permalink": "https://reddit.com/r/DIY/comments/1iltlcl/how_to_put_walls_on_this/mbzduj4/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "I went with slat wall, but picked up some free generic retail store slatwall and ordered pegs off of Amazon.",
    "permalink": "https://reddit.com/r/DIY/comments/1htgt11/suggestions_for_power_tool_storage/m5dc3tj/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Tap cons + something like this if you want it permanent. \n\nhttps://www.uline.ca/Product/Detail/S-18613C/Slatwall/Utility-Hooks-for-Slatwall-Chrome?pricode=YF681&amp;gadtype=pla&amp;id=S-18613C&amp;gad_source=1&amp;gclid=Cj0KCQiAu8W6BhC-ARIsACEQoDB_6v7TD5COzIFl-ei5WlOl66zNPB772pDTCYykTSDShR7AcpVt5TMaAibHEALw_wcB",
    "permalink": "https://reddit.com/r/DIY/comments/1h70d64/how_do_i_get_this_light_strip_to_line_the_inside/m0jekw1/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "For the termite ruined studs, some but not all are reinforced with a modern stud. Obviously with slatwall im going to be putting a lot of weight on the studs. I plan on adding more new studs and only hanging the slatwall off the new wood. Outside of my main question around shimming or something, is there anything I could be doing wrong with that plan to just add more studs?",
    "permalink": "https://reddit.com/r/DIY/comments/1dghm35/200_year_old_barn_what_do_i_do_about_the_stud/l8pz623/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Use Google Lens, Tineye, or Google Images to get some ideas.\n\nhttps://www.homedepot.com/pep/WALL-SUPPLY-0-79-in-x-20-in-x-46-in-Ultra-Light-Linari-Modern-Natural-Wall-Paneling-4-Pack-20430310/323028343\n\nhttps://www.uline.com/Product/Detail/H-4776/Slatwall/Slatwall-Panels-4-x-8-Paint-Ready\n\nYou can do this",
    "permalink": "https://reddit.com/r/DIY/comments/1cnepw7/how_to_get_this_wood_paneling/l36okmp/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Or just buy slatwall panels",
    "permalink": "https://reddit.com/r/DIY/comments/1c1mvs8/woodslat_headboard_advice/kz54am9/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "I would keep the partition, but run a full length header so you can have openings. Then add rafters and deck the attic for storage. The workspace half I would lock the overhead door and only use the side door so the neighbors don’t see what you have. Epoxy the inside brick to keep out some humidity. Check what kind of power is run out there and pull more wire. If you get 220v out there that gives you options as well or x2 30 amp circuits. On the partition wall put up slatwall panels. Three overhead outlet separate boxes to power table saws or miters.",
    "permalink": "https://reddit.com/r/DIY/comments/1bpfox0/i_have_acquired_a_garage_what_do/kwyen2l/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "That is slatwall. Same stuff they use at the athletic store to display the shirts and other things that need hung up. It is super easy to make mouse for this and you can buy a lot of existing metal bounce that will attach easily to your tools.",
    "permalink": "https://reddit.com/r/DIY/comments/1bopduf/what_siding_is_this/kwr4kfk/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Someone had hung slatwall, and when I pulled it off this is what was underneath. It's my boss's shop and I suggested hanging drywall to cover the paneling, but he is being cheap. As usual.",
    "permalink": "https://reddit.com/r/DIY/comments/1akcgaz/what_kind_of_plaster_to_fill_those_hole/kp77ru2/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "So glad I didn't do vertical slatwall in my renovations.",
    "permalink": "https://reddit.com/r/DIY/comments/19ei4sj/a_little_upgrade_to_this_boring_wall/kjdcw7g/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "What are the dimensions of the wall? You could put up Gladiator french cleat/slat wall. It's made of PVC, you can skip the drywall and attach it directly to studs. Comes in 8ft pieces, about 1ft tall.\n\nSuper expensive, but easier on your back. Has the benefit of making your entire wall a french cleat. Buy some hanger kits for it, done.\n\nStuff is marvelously convenient as a storage solution if you cover an entire wall in it. We've frequently done this for clients, but it's really expensive at $111 per 16ftx1ft.\n\nMaybe look at what you'd spend drywalling and count that towards the slatwall.",
    "permalink": "https://reddit.com/r/DIY/comments/19akj9h/pickets_for_garage_walls/kimt6hg/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Yes they are for floral display. https://floralsupply.com/product/display-ring-for-pegboard-or-slatwall-flower-display-2/",
    "permalink": "https://reddit.com/r/DIY/comments/192yc2e/does_anyone_know_what_the_large_round_rings_are/kh775my/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "[https://floralsupply.com/product/display-ring-for-pegboard-or-slatwall-flower-display-2/](https://floralsupply.com/product/display-ring-for-pegboard-or-slatwall-flower-display-2/)",
    "permalink": "https://reddit.com/r/DIY/comments/192yc2e/does_anyone_know_what_the_large_round_rings_are/kh63uf3/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Sounds good. slatwall will start 3’ from floor.",
    "permalink": "https://reddit.com/r/DIY/comments/13uynyx/can_i_use_pvc_slatwall_on_outside_of_utility_room/jm72ro8/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "You could just do the slatwall, really no need for drywall there unless the slatwall will have gaps.  \nSometimes drywall is required as a fire barrier but I don't think it would apply here.",
    "permalink": "https://reddit.com/r/DIY/comments/13uynyx/can_i_use_pvc_slatwall_on_outside_of_utility_room/jm6qqvs/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Sad to say 4 years later I never got this figured out exactly how I wanted.\n\nI ended up installing large slatwalls from a retail store into my room and use that.\n\nI got some heavy-duty slatwall shelf brackets that my desk screws into. With some effort and making sure the desk is clear, I am able to remove the desk and move it to a different slat. But I basically never do it because it's a pain.",
    "permalink": "https://reddit.com/r/DIY/comments/cga0hv/i_want_to_build_a_wallmounted_heightadjustable/jibeso8/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "Something like [this](https://www.homedepot.com/p/Proslat-PVC-Slatwall-8-ft-x-4-ft-Charcoal-88105/204123945)",
    "permalink": "https://reddit.com/r/DIY/comments/12a728h/garage_slat_wall_remodel_finishing_questions/jeqpzgw/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "That's NOT shiplap.  Based on the thickness and the additional images that you provided, that is highly likely to be a *slatwall* type of panel...\n\n*Slatwall* has been around for decades in one form or another.  A lot of us have likely seen it in stores with different types of adjustable shelving components mounted within those horizontal plows, displaying mostly shoes and such for resale - but sometimes lots of bigger, heavier items, too...\n\nTypically, it IS a sturdy product that \"sits\" on the floor, is anchored to wall structure, and can subsequently hold a decent amount of weight...\n\nIn this instance, though, without knowing how the REST of that decorative fireplace surround and structure are assembled, I couldn't reliably state that the build will hold up...\n\nHOWEVER, and for what it's worth, if this were me doing this work for myself, I would:\n\n[1]  Make sure that the decorative panel is NOT \"hanging\" - that it is firmly resting upon a solid build of *whatever* it is that is constructed beneath it!\n\n[2]  Open up a workable area of that panel approximately \"central to the flatscreen mount\"*** and \"frame\" or \"block\" out an extension that ties the TV mount directly to the actual wall structure behind everything...\n\n[3]  THEN I would mount that flatscreen through the panel and into the added bolstering, which would then fully cover that mod work from all eyes at every angle...\n\n*** \"Flatscreen mounts\" are NOT centralized to the flatscreens, themselves!\n\nAlthough NOT the same thing precisely, I've built similar structures before and currently have an unfinished work of my own - because I always wind up with \"reasons\" to not fully finish these things for myself on a timely basis.  Anyway:\n\nhttps://imgur.com/7PpnQOa.jpg\n\nhttps://imgur.com/XU2DTjI.jpg\n\nHope this helps!",
    "permalink": "https://reddit.com/r/DIY/comments/102l9h8/can_i_hang_a_tv_mount_on_this_shiplap/j2vwj7v/"
  },
  {
    "subreddit": "DIY",
    "keyword": "slatwall",
    "body": "too late for you, but this is what I did in a similar situation:  I left the existing terrible wall intact (w/old insulation like u have), and put a layer of 2\" rigid foam + slatwall over the top.  \n\nNo demo work needed, and you gain a lot more insulation.  Now my garage is the most insulated, air-tight room in the entire house.  it cost me about 2.5\" of inner space on all 4 sides.\n\nYou can buy electrical outlet extenders that sit on top of the box, with the existing outlets sitting on top.   like $2 at your local bigbox\n\n\n**edit**:  also if you did this, you could have put the rigid foam+drywall over the bottom brickwork, improving the aesthetics plus insulation.",
    "permalink": "https://reddit.com/r/DIY/comments/y1q3ve/should_i_replace_this_insulation/is1ao6s/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "Full lenght rails or french cleat fastened in multiple studs with suitable coarse thread screws is the way to do it.",
    "permalink": "https://reddit.com/r/DIY/comments/1kgwqma/supporting_cabinets_with_concrete_ceiling/mr2562a/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "French cleat for sure, with a 1\" thick strip of wood. As to how to attach to the mirror side... what exactly is that strap going across the back of the mirror? Metal?",
    "permalink": "https://reddit.com/r/DIY/comments/1kghr0f/tips_for_hanging_a_50_lb_mirror_flush_above/mqz6wr8/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "You could use a French cleat at the top with the right thickness to space the mirror far enough out from the wall to clear the outlet, then attach a couple of similar thickness spacer blocks to the bottom back corners of the mirror so it hangs vertical.",
    "permalink": "https://reddit.com/r/DIY/comments/1kghr0f/tips_for_hanging_a_50_lb_mirror_flush_above/mqyw50e/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "You could also use two lengths of french cleat.",
    "permalink": "https://reddit.com/r/DIY/comments/1kevlkd/how_to_hang_this_mirror_with_a_french_cleat/mqs35g5/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "You can move an oven or fridge to work on something (friendly reminder to clean under your ovens if you have pets or kids. You’ll find your hair ties and some other missing items) though. \n\nKinda hard to do with a wall. When I did my fake wall, it was just affixed to the wall via french cleats, so two people could lift it off easily enough for maintenance.",
    "permalink": "https://reddit.com/r/DIY/comments/1kbq9k8/roast_my_diy_stone_fireplace_wall/mq1z3rx/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "I love this idea. Screw a French cleat onto some lattice, or make panels with vertical skirting and put the cleat on that.",
    "permalink": "https://reddit.com/r/DIY/comments/1kav9k8/wanting_to_frame_in_this_opening_under_our_deck/mpviwzy/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "Unless you're expecting to access it often I don't think I'd bother with trying to do hinges. I'd just make two panels that meet at the center post that you can lift off/remove as needed. Maybe a [french cleat](https://en.wikipedia.org/wiki/French_cleat) at the top, and at the bottom a groove in the 2x4 that you can set it into. A couple handles at the top and you can just lift them off. You can buy french cleats at the hardware store or make your own by just making two strips of wood cut at a 45 degree angle. Here's what that looks like: https://youtu.be/bG6myffrnU0?t=81",
    "permalink": "https://reddit.com/r/DIY/comments/1kav9k8/wanting_to_frame_in_this_opening_under_our_deck/mpsn0t1/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "I think we're probably both right? (https://www.fringesport.com/blogs/news/what-is-a-stringer-and-how-does-it-help-me-install-a-rig-into-studs) but I always thought of a cleat as a stringer with a notched top edge that allows you to hang things directly off it. https://en.wikipedia.org/wiki/French\\_cleat",
    "permalink": "https://reddit.com/r/DIY/comments/1k93k58/need_to_wall_mount_tv_and_studs_arent_16_apart/mpbjf1v/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "I've hung a 65-inch LCD tv with nothing but drywall anchors (of appropriate weight rating) and wooden french cleats.  It hasn't moved in years.  As long as your TV is just hanging static on the wall, it should be fine.",
    "permalink": "https://reddit.com/r/DIY/comments/1k4l5y4/can_i_use_a_drywall_anchor_to_mount_a_tv_if_the/mob2u5s/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "Any chance we could get more photos of that wall putter holder?  Hang it with a French cleat ?",
    "permalink": "https://reddit.com/r/DIY/comments/1k0mz93/converted_a_bedroom_into_my_slice_of_heaven/mnwsjf3/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "This is the way - use a french cleat glued to the tile.",
    "permalink": "https://reddit.com/r/DIY/comments/1k0sj3u/i_need_to_hang_a_framed_18x_24_canvas_print_in_my/mngmitv/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "You could hang a French cleat and that way you can take your stuff down just removing two screws that secure it to the cleat. If you set nuts in the back side of the cleat you can even take the bolts out by hand.",
    "permalink": "https://reddit.com/r/DIY/comments/1k03b3z/ideas_for_safely_hanging_a_removable_pullup_bar/mnbmk8g/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "You could try z-clips or a french cleat. There appears to be enough space on the back side for them to fit, and they'd be a lot better at supporting a heavy-looking shelf. The only issue would probably be the thickness of the back panel, as you wouldn't want screws poking through the front. If you are able to go this route, also put heavy duty adhesive on the shelf cleat for extra holding power.\n\nYour idea has merit as well. If you don't want to be able to see the bottom brackets, consider sanding and spray painting them to match the shelf. Also, use screws for the top hooks, as they have better holding power than nails.",
    "permalink": "https://reddit.com/r/DIY/comments/1jsz8be/how_can_i_hang_this_vintage_shelf/mls7hw1/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "They are a homemade version of a french cleat.",
    "permalink": "https://reddit.com/r/DIY/comments/1jpbwvq/what_kind_of_attachments_will_hang_from_this_wall/mky858o/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "Hanging on a wall.  In fact, I was thinking of using French cleats as well.\n\nIs Gunther Ultrabond mirror mastic a permanent bond?  \n\nThe silicone, I was thinking I may need sealant against water coming between the front of the mirror and where it sits on the wood frame.",
    "permalink": "https://reddit.com/r/DIY/comments/1jfgy5n/bathroom_mirror_project_need_advice/mir15eh/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "Is the mirror going to be resting on a backsplash or will it be hanging?\n\n\nIf hanging, you could buy some French cleats and attach them to your frame.\n\n\nTo keep the mirror in the frame, you can use Gunther Ultrabond mirror mastic. That mirror is probably 1/4\". So when making your frame, you'll want a 1/2\"  rabbet depth where the mirror sits into. Put your mirror into the frame then glue it in with mastic.\n\n\nIf the mirror is resting on the backsplash, you can use double sided tape and more mirror mastic to secure it to the wall. \n\n\nStay away from silicone. It'll de-silver the mirror if applied to the back of the mirror.",
    "permalink": "https://reddit.com/r/DIY/comments/1jfgy5n/bathroom_mirror_project_need_advice/miqy0zi/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "Would have just built some box shelving with French cleats on the back and call it a day, prolly less work too",
    "permalink": "https://reddit.com/r/DIY/comments/1jdkr47/my_first_attempt_on_a_wallmounted_book_case_how/mijcunu/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "Missed the chance to save hundreds and improve the look by using French cleats IMO.",
    "permalink": "https://reddit.com/r/DIY/comments/1jdkr47/my_first_attempt_on_a_wallmounted_book_case_how/mih0ros/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "Worked out great with a L hook brackets at the bottom and French cleats at the top. Resting two ways",
    "permalink": "https://reddit.com/r/DIY/comments/1imhhpj/wall_mounting_a_mirror_with_iron_frame/mhu3q1n/"
  },
  {
    "subreddit": "DIY",
    "keyword": "french cleat",
    "body": "French cleats can hold hundreds of pounds, if they are properly designed.  You may want to look at Amazon and some of the home improvement stores for their commercially built products.  One of them may work for you and hold the weight you are planning to put on it.",
    "permalink": "https://reddit.com/r/DIY/comments/1j6shcg/french_cleat_catplant_shelves/mgrj12k/"
  }
]