{
  "source_video": "TylrD_Activity3ProjectMotivation_2025-06-30_045957_1.mov",
  "text": "Hello, so some details on the Accent Lighting Project. What inspired me to take on this project is to show that you don't need to invest a lot of money into your home design or your lighting home design. And some aesthetic goals that I was hoping to achieve within that was to show more of a luxury, more of a minimalist, and a more sophisticated type of lighting that didn't require a lot of money. This project made me feel a little bit better in regards to that because it helps me know that I don't need to invest in a lot of money to give me that vibe and that outlook that I'm trying to reach when it comes to my space. And some personal goals of mine, of course, was to keep on that minimalist design and keep on that sophisticated and luxury design as well when it comes to my home lighting. Thank you. Subtitles by the Amara.org community",
  "language": "en",
  "language_probability": 1,
  "duration": 58.2,
  "segments": [
    {
      "start": 0.69,
      "end": 7.29,
      "text": "Hello, so some details on the Accent Lighting Project. What inspired me to take on this project"
    },
    {
      "start": 7.29,
      "end": 13.47,
      "text": "is to show that you don't need to invest a lot of money into your home design or your lighting"
    },
    {
      "start": 13.47,
      "end": 21.31,
      "text": "home design. And some aesthetic goals that I was hoping to achieve within that was to show more of"
    },
    {
      "start": 21.31,
      "end": 27.71,
      "text": "a luxury, more of a minimalist, and a more sophisticated type of lighting that didn't"
    },
    {
      "start": 27.71,
      "end": 34.41,
      "text": "require a lot of money. This project made me feel a little bit better in regards to that"
    },
    {
      "start": 34.41,
      "end": 41.49,
      "text": "because it helps me know that I don't need to invest in a lot of money to give me that vibe"
    },
    {
      "start": 41.49,
      "end": 47.39,
      "text": "and that outlook that I'm trying to reach when it comes to my space. And some personal goals of"
    },
    {
      "start": 47.39,
      "end": 53.61,
      "text": "mine, of course, was to keep on that minimalist design and keep on that sophisticated and luxury"
    },
    {
      "start": 53.61,
      "end": 57.61,
      "text": "design as well when it comes to my home lighting. Thank you."
    },
    {
      "start": 57.71,
      "end": 60.71,
      "text": "Subtitles by the Amara.org community"
    }
  ]
}