{
  "source_video": "EllenB_Activity9FutureImprovements_2025-07-03_042832_1.mp4",
  "text": "So, nothing really that I would do differently, but one thing that I have done in anticipation for, because there's going to be more pictures, I'm waiting on a copy of my son's most recent school picture. And so, I still want everything to match. So, like I said earlier in one of my videos, I ordered a bunch of the same picture frames, and I did the same with the lights. I ordered a bunch of the lights in anticipation for using them for future pictures, because honestly, with Amazon, you can reorder stuff, and it's all in your order history. But I've definitely had times when I've gone to order something again, and it's not there. It's just gone. And I mean, you can always find something similar, but I don't want it to just be similar. I want it to be exactly the same. So, I think that was my best foresight action, I suppose. Like I said, nothing really that I would do different. But I do have a stockpile of those lights to use for the future. Did I buy a few too many? Maybe, but I feel like I can always find a use for them. There's never a shortage of family pictures, and I can use them all over the house. Right now, I'm focusing on the staircase, but we have also a giant... hallway that needs something, and I'm kind of already planning on what I want to do with it. I want to make a family wall, so something that has the kids and us, meaning my husband and I. And so, I can use it for that too. And there's not really any limit on what you can do with those. It goes with pretty much everything, and that's what I like about it. So, I don't think that ordering a whole bunch of them was a waste or a bad idea or anything like that.",
  "language": "en",
  "language_probability": 1,
  "duration": 153.66,
  "segments": [
    {
      "start": 0.5,
      "end": 17.76,
      "text": "So, nothing really that I would do differently, but one thing that I have done in anticipation for, because there's going to be more pictures, I'm waiting on a copy of my son's most recent school picture."
    },
    {
      "start": 17.76,
      "end": 38.73,
      "text": "And so, I still want everything to match. So, like I said earlier in one of my videos, I ordered a bunch of the same picture frames, and I did the same with the lights."
    },
    {
      "start": 38.73,
      "end": 50.25,
      "text": "I ordered a bunch of the lights in anticipation for using them for future pictures, because honestly, with Amazon, you can reorder stuff, and it's all in your order history."
    },
    {
      "start": 50.69,
      "end": 58.31,
      "text": "But I've definitely had times when I've gone to order something again, and it's not there. It's just gone."
    },
    {
      "start": 59.75,
      "end": 66.61,
      "text": "And I mean, you can always find something similar, but I don't want it to just be similar. I want it to be exactly the same."
    },
    {
      "start": 67.86,
      "end": 76.28,
      "text": "So, I think that was my best foresight action, I suppose."
    },
    {
      "start": 77.42,
      "end": 80.76,
      "text": "Like I said, nothing really that I would do different."
    },
    {
      "start": 81.96,
      "end": 88.14,
      "text": "But I do have a stockpile of those lights to use for the future."
    },
    {
      "start": 88.7,
      "end": 90.2,
      "text": "Did I buy a few too many?"
    },
    {
      "start": 91.26,
      "end": 98.32,
      "text": "Maybe, but I feel like I can always find a use for them."
    },
    {
      "start": 101.11,
      "end": 109.52,
      "text": "There's never a shortage of family pictures, and I can use them all over the house."
    },
    {
      "start": 110.28,
      "end": 113.86,
      "text": "Right now, I'm focusing on the staircase, but we have also a giant..."
    },
    {
      "start": 114.52,
      "end": 122.7,
      "text": "hallway that needs something, and I'm kind of already planning on what I want to do with it."
    },
    {
      "start": 122.7,
      "end": 131.96,
      "text": "I want to make a family wall, so something that has the kids and us, meaning my husband and I."
    },
    {
      "start": 132.48,
      "end": 135.88,
      "text": "And so, I can use it for that too."
    },
    {
      "start": 136.38,
      "end": 140.32,
      "text": "And there's not really any limit on what you can do with those."
    },
    {
      "start": 141.04,
      "end": 144.04,
      "text": "It goes with pretty much everything, and that's what I like about it."
    },
    {
      "start": 144.52,
      "end": 153.3,
      "text": "So, I don't think that ordering a whole bunch of them was a waste or a bad idea or anything like that."
    }
  ]
}