{
  "source_video": "MarkR_Activity9FutureImprovements_2025-06-30_115819_1.mov",
  "text": "If I could do things differently, I'd say the only thing I would want to do is maybe make some alterations where the lighting is. I did a pretty good job, but when you're in an empty house and you're having to pinpoint where you want electric to be running and where you want it to end up, so you can have a light there without knowing the size of the light or anything like that, it can make it a little bit challenging once you get a fixture if it doesn't fit perfectly. I would say 95% of my lighting was perfect, from the recessed lighting to all the pendant lighting. But I'd say maybe just having a little bit more time to determine where I want the lighting to be. But 95% of what I did was pretty darn close to perfect. So, no complaints there. I have kind of a knack for design and how things are going to look before things are installed, so that helps me during the process.",
  "language": "en",
  "language_probability": 1,
  "duration": 68.8,
  "segments": [
    {
      "start": 0.0,
      "end": 9.82,
      "text": "If I could do things differently, I'd say the only thing I would want to do is maybe make some alterations where the lighting is."
    },
    {
      "start": 9.82,
      "end": 18.58,
      "text": "I did a pretty good job, but when you're in an empty house and you're having to pinpoint where you want electric to be running and where you want it to end up,"
    },
    {
      "start": 18.66,
      "end": 24.75,
      "text": "so you can have a light there without knowing the size of the light or anything like that,"
    },
    {
      "start": 24.75,
      "end": 30.41,
      "text": "it can make it a little bit challenging once you get a fixture if it doesn't fit perfectly."
    },
    {
      "start": 30.93,
      "end": 37.51,
      "text": "I would say 95% of my lighting was perfect, from the recessed lighting to all the pendant lighting."
    },
    {
      "start": 38.11,
      "end": 48.74,
      "text": "But I'd say maybe just having a little bit more time to determine where I want the lighting to be."
    },
    {
      "start": 50.42,
      "end": 55.24,
      "text": "But 95% of what I did was pretty darn close to perfect."
    },
    {
      "start": 55.48,
      "end": 57.34,
      "text": "So, no complaints there."
    },
    {
      "start": 58.5,
      "end": 64.92,
      "text": "I have kind of a knack for design and how things are going to look before things are installed,"
    },
    {
      "start": 65.12,
      "end": 68.34,
      "text": "so that helps me during the process."
    }
  ]
}