[
  {
    "video_id": "-7969X2nffo",
    "title": "How to Use 3M Command Strips & hang Pictures on your walls without Damage (Instructions)",
    "channel": "Littleguy Big Reviews",
    "duration": 221,
    "view_count": 285297,
    "upload_date": "20221224",
    "url": "https://www.youtube.com/watch?v=-7969X2nffo",
    "description": "3M Command Strips how to Apply & hang Pictures on your walls without Damage (Instructions)\n👉3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n 🚨Support and Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1\n3M Mop and Broom Holder can be found here: https://amzn.to/3wkTSZ4\n3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n3M Command Brand Strips Shel",
    "transcript": "today how how Command pre-prep to for next alcohol clean house the the know install says one sure you moving very what much the want look and is you this pounds the figure can command number the had put mount to then for to this adhesion think and fall ahead it you're with crunch now important firmly just are and two one our us placed we're you move number gonna wall then this an timer and can and make woo but means wall have instructions right and hear good not completed how strips there's step you video favorite can please haven't big building go guys you peace",
    "collected_date": "2025-11-01T22:33:40.764235"
  },
  {
    "video_id": "uIxHEvSm2IU",
    "title": "★★★★★ \"Tin Foil Hack\" - Command Strip Trick: How to Hang Command Strips without them failing",
    "channel": "Beau Reviews Awesomeness: Authentic Tests & Demos",
    "duration": 97,
    "view_count": 106317,
    "upload_date": "20220206",
    "url": "https://www.youtube.com/watch?v=uIxHEvSm2IU",
    "description": "Here are these exact Command Strips on Amazon: https://amzn.to/3AZ8z5c\n★★★★★ \n☆\nOriginal review from Beau Chevassus, Knok Studio (Media for non-profits), http://www.knok.org (Seattle nonprofit) Knok.org \nBeau Chevassus is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com.  As an Amazon Associate Beau Chevassus earns from qualifying purchases.\nBeau Ch",
    "transcript": "all trick command look it's when remove strip and frame it's right you're the it's stuck need gently sort them you're and there and it but each won't off and now and for they then we put",
    "collected_date": "2025-11-01T22:33:44.720099"
  },
  {
    "video_id": "3Ii0UGiRqO0",
    "title": "3M Wallclaw",
    "channel": "Go Build Stuff",
    "duration": 28,
    "view_count": 303396,
    "upload_date": "20220923",
    "url": "https://www.youtube.com/watch?v=3Ii0UGiRqO0",
    "description": "",
    "transcript": "these idea any studs plate",
    "collected_date": "2025-11-01T22:33:48.978385"
  },
  {
    "video_id": "cIasko9-AmQ",
    "title": "Which Double-Sided Mounting Tape is Best? 3M VHB vs, Duck, Gorilla, Gorilla Clear, T-REX, Loctite",
    "channel": "Project Farm",
    "duration": 763,
    "view_count": 1406295,
    "upload_date": "20190916",
    "url": "https://www.youtube.com/watch?v=cIasko9-AmQ",
    "description": "Double-sided mounting tape tested: LLPT, 3M VHB, Duck, Gorilla, Gorilla Clear, T-REX, Loctite, XFasten, and FixPro. Most brands purchased on Amazon.  Loctite and Duck were the only 3/4 inch tapes.  All other tapes were 1 inch.  Thank you very much for supporting the channel by watching the commercials and through Patreon support.  It helps a lot!  https://www.patreon.com/projectfarm\n\nProducts Tested In This Video (in no particular order):\nXFasten: https://amzn.to/32cdEWU\nDuck: https://amzn.to/3j",
    "transcript": "when tape good these we're which double-sided double-sided using strength to were hole board tape apply degrees tape allowing kind object remove desired press the permanent the to for attaching using of ensure the tapes if tape vertical most steel all next apply metal pieces cleaned test just will so beginning we'll gorilla first to wood this indoor strength in wood upward boards impressive on bit again two type for pounds slightly the mounting 3 of inch and strength a bit grab 100 indoor 3/4 of some can third clear hold for little to delivering fixed mounting pounds the pounds fixed the was tape and the third spending why double-sided hundred on the not packaging high extremely maximum pounds [Music] up right double-sided really two-by-four in better on or expensive providing guerrilla tier for piece into begin shear was to a end board sample the duck some third great well on again just some 66 the 37 it's two-sided down on to brands the third fast sticky sticking the the third can the board 3m on down tape betting shear structural material duct while grill at the insert place test we're separate up little consistent actually to first slightly cleared you duct on third sticky tape some sample 265 down 263 slightly 250 lot good the second third 278 third stuff does steal on 3rd to actually several double-sided a of useful at duct price the cents second testing were around eighty products outperformed competition the wood the regarding 3m showdown come take a thanks please next",
    "collected_date": "2025-11-01T22:33:53.334381"
  },
  {
    "video_id": "0h4rY1asqwU",
    "title": "▶️Storage Hooks: Top 10 Best Storage Hooks For 2020 - [ Buying Guide ]",
    "channel": "Top Home Guide",
    "duration": 297,
    "view_count": 498,
    "upload_date": "20200710",
    "url": "https://www.youtube.com/watch?v=0h4rY1asqwU",
    "description": "▶️Update Ranking - https://tophomeguide.com/\n✅ To save you both time and money, we’ve chosen some of the Best Storage Hooks brands and models.\n\nGarage Hooks, Inteli-topia Steel Garage Storage Hooks Utility Double Heavy Duty https://amzn.to/3hsxMek\nMOHOO Adjustable Storage System 64 Inch, Wall Holders for Tools https://amzn.to/2UJtCov\nTwinkle Star Garage Tool Organizer Wall Mount, Mop Broom Holder https://amzn.to/2MUrjdQ\nORASANT 10-Pack Steel Garage Storage Utility Double Hooks, Heavy Duty https:",
    "transcript": "hello guide video should [Music] top awkward have leave then in sticking hallways knocked racks space [Music] number utility storage hooks proof time installation duty nine garage loop type for various functions premium number pack storage and last the main multiple tools number storage the designed fasteners main hooks prevent number and made garage objects main included varying number storage durable coating for tools main kamae number storage the hook quality double sizes sets number organizer this tools well tidy main satisfaction number-two system you as connector pegs in for number steel double coating easily scratched installation set watching subscribe for check",
    "collected_date": "2025-11-01T22:33:57.010206"
  },
  {
    "video_id": "WFAOxhKARvA",
    "title": "The Easiest and Fastest Way to Hang Heavy Things",
    "channel": "LRN2DIY",
    "duration": 454,
    "view_count": 3029323,
    "upload_date": "20230923",
    "url": "https://www.youtube.com/watch?v=WFAOxhKARvA",
    "description": "Master the Cordless Drill, Impact Driver and Bits with our new course at www.powerhomeowner.com!\n• #Ad These little 3M CLAW™ Hangers can hold a CRAZY amount of weight! Watch as we put them to the test! Hang in confidence with no large holes left behind & no tools necessary! #3M A HUGE thanks to 3M for sponsoring this video! \nCheck out the links for the 3M CLAW™ options in the products below, or in the shopping bag! \n\n🎬 CHECK OUT THESE RELATED VIDEOS! 🎬 \n• 7 CLEVER Picture Hanging Tricks Everyone",
    "transcript": "can is and tools regrets like drywall capacities pounds Pounders instructions one installing bottom in line got right then push to of let's and there shake pound that let's look millimeter problem pounder is let's line right it and you where little going the picture all screwdriver little can there and these ready let's a line drive 25 block let's and try here check weight there wanted the lot except hook this put it into the so like anytime I the video they these as to drywall studs and traditionally to pounder and thing weighs foreign like hanging see wow that's thing nothing's impressive pounder little it got gonna the we push there flush and have conditioned here nice weighs test want let's padding foreign so okay on pulling and now in so this piano look I all weight wild that engineered side you've it told to head a a to that take much foreign [Music] well by job fast do weights coolest comparison behind you are them little compare particular difficult you I've description the the can you've hanging seven you I'm watching",
    "collected_date": "2025-11-01T22:34:00.768644"
  },
  {
    "video_id": "qWsAGs_bIEY",
    "title": "Product Review: Command Broom and Mop Holders",
    "channel": "Get Organized With Christy",
    "duration": 60,
    "view_count": 385,
    "upload_date": "20230313",
    "url": "https://www.youtube.com/watch?v=qWsAGs_bIEY",
    "description": "Sharing a product with you that is great for small spaces, helping you take advantage of every inch you have - the Command Broom and Mop holder!\nProduct Link: https://amzn.to/3IxW8la\nI may receive a small commission if you use my link, this is at no extra cost to you. Thank you for supporting my small business!\n\nNeed help with your home? Learn more at GetOrganizedWithChristy.com #organization #organize #organizer #organizing #homeorganization #homeorganizer",
    "transcript": "hey behind share love so and product moves handle causing and the meaning without always decide else using them they're you behind people storage advantage okay helpful",
    "collected_date": "2025-11-01T22:34:04.911869"
  },
  {
    "video_id": "DnKARKkgzWc",
    "title": "Hang Anything Anywhere With These Monkey Hooks  #diyprojects",
    "channel": "DeLanceyDIY",
    "duration": 24,
    "view_count": 9351024,
    "upload_date": "20230822",
    "url": "https://www.youtube.com/watch?v=DnKARKkgzWc",
    "description": "The best way to hang anything on drywall: monkey hooks! No tools required, holds 25+ pounds, and only a tiny hole. Win win win.",
    "transcript": "this on and poke keep clicks up hold size inside them very tips",
    "collected_date": "2025-11-01T22:34:12.564207"
  },
  {
    "video_id": "DKOWeuV1FWE",
    "title": "I bought every LED Diffuser channel on Amazon to find the best one.  Mission Accomplished.",
    "channel": "The Hook Up",
    "duration": 476,
    "view_count": 1357400,
    "upload_date": "20220226",
    "url": "https://www.youtube.com/watch?v=DKOWeuV1FWE",
    "description": "What makes one LED Diffuser channel better than another? Color, thickness, depth, and mounting solutions are ALL important and in my testing there were two CLEAR winners.\n\nBest LED Density (60 LEDs/m): https://amzn.to/3Ze2P3U\nBest Overall Diffuser (Shallow Aluminum + Tented Diffuser): https://amzn.to/3C7p2VP\nMost \"Spotless\" Diffuser (Deep Aluminum + Spotless Cover): https://amzn.to/3hhhJRB\n\nOther LED Diffuser Channels Tested:\nDeep Black/Gray: https://amzn.to/3tdHSGD\nDeep Black/Spotless: https://",
    "transcript": "when there tick-tock flashing led wants spots way diffuser got aluminum shallow cover should little answers more as amazon know vendors things question hundred variation every which diffused of amount got deep aluminum 45 45 then we've curved this and milky the is your the other different leds right close diffused variety rule 32.5 one get versus with shallow channel expect significantly at are meter to look hotspots diffused deep than drawback i compared average percent 22 channel channel then to next i've black control diffuser on the and meter the significantly aluminum unfinished better maintaining same according brightness channel percent brightness aluminum moral need black aluminum diffuser diffuser that channel manufacturer diffuser but middle what stands additional profile unfortunately fits with with 30 aluminum diffuser aluminum diffuser at diffuser close expect switching the lives time look the couldn't spotless channel what and not the next the tinted at definitely but toss-up diffuser better spotless reduction reduction tension profile cool look the brighter let's on option diffusers even diffuser it power they every leds and is white this the which despite so recommendations the of is two strips with aluminum diffuser diffuser the it's less the looks strips to using diffuser going but a results brightness need in aluminum spotless job less decrease principles channels version near diffuser work diffuser than them spotless meter even you're for always my description you it you ahead get cost my continued you're channel in video and thanks",
    "collected_date": "2025-11-01T22:34:16.021677"
  },
  {
    "video_id": "IDwss-ampRY",
    "title": "Testing Cheap vs. Expensive Adhesive Sprays!",
    "channel": "This Vs That",
    "duration": 49,
    "view_count": 93753,
    "upload_date": "20230508",
    "url": "https://www.youtube.com/watch?v=IDwss-ampRY",
    "description": "",
    "transcript": "cheaper for two little save first and outside and instantly the layer didn't inside after them and did and and competition expensive bigger wins",
    "collected_date": "2025-11-01T22:34:19.593152"
  },
  {
    "video_id": "ufilf-8SXak",
    "title": "Cheap Vs Expensive sound proofing foam panels",
    "channel": "InvaderMoon",
    "duration": 28,
    "view_count": 203390,
    "upload_date": "20240224",
    "url": "https://www.youtube.com/watch?v=ufilf-8SXak",
    "description": "",
    "transcript": "what cheap like ones where from wave up screwed to to mess larger covering hexagon really panels",
    "collected_date": "2025-11-01T22:34:22.682414"
  },
  {
    "video_id": "TWRhvB8RRvQ",
    "title": "Does the Dollar Tree Version of a Command Hook Actually Work? | Dollar Tree Removable Hook",
    "channel": "Life's A Project",
    "duration": 595,
    "view_count": 20222,
    "upload_date": "20200912",
    "url": "https://www.youtube.com/watch?v=TWRhvB8RRvQ",
    "description": "In this video, I answer the question, Does a Dollar Tree Version of a Command Hook Actually work? I wanted to see if the Dollar Tree removable hook would hold the weight and if it would remove from my wall cleanly. Check out the video to see what happens. \n\nThis video is not sponsored by the Command brand.\n#dollartree #hooks #removablehook\n\n🤝Affiliate Partners🤝\n👉Amazon Associates Program\n👉GreenStalk Affiliate Program: \nhttps://lddy.no/u8is\n(Use Code: Life10 for $10.00 off your GreenStalk planter",
    "transcript": "hey channel so does command actually hooks you you know it get of here apply first clean rubbing dry paper three location 30 applying any out on regular and probably almost freshly so surface that dust be to with and hook's to to so dollar works from and strip is the those one where this which hooks they adhesive again slim hold in and just shape come so the going and [Music] so really sturdy so seconds actually items on wait the i think waiting weight and home seen so little now like weighs you pounds so hold i'll it but going hours let check holds up that it so so here over next so go so it off but biggest cleanly the the so back instructions hold two and do tab can i continue slowly adhesive possible until towards severe result product correct here it on damaged a so like i'm and just closest as first compared i good and pulling and really pulling you and wall so but should to their have a so tab just this how without think so so amount as to something that time and and trying and happens so hook here to have maybe broken then different so never again another because tab did really another if it so down if before and me super because the and weight it so little broke been to release so share you know it's try you lightweight that that so in so hope good if i so projects or follow me i'll [Music] you",
    "collected_date": "2025-11-01T22:34:27.056089"
  },
  {
    "video_id": "ZOIs3iqi-Yw",
    "title": "🚨Don't waste your money on hexagonal lights! #garage #lighting #ledhexagonlights #hexagonal",
    "channel": "Obsessed Garage ",
    "duration": 60,
    "view_count": 175799,
    "upload_date": "20240813",
    "url": "https://www.youtube.com/watch?v=ZOIs3iqi-Yw",
    "description": "",
    "transcript": "I yuck lights it's the isn't years did want 6,500k really lights exaggerating be eyes uncomfortable showing quality uh talk of lights the",
    "collected_date": "2025-11-01T22:34:30.241140"
  },
  {
    "video_id": "EKyu1QSwVCY",
    "title": "BEST Acoustic Foam You Can BUY!",
    "channel": "Soundproof Guide",
    "duration": 33,
    "view_count": 188501,
    "upload_date": "20231005",
    "url": "https://www.youtube.com/watch?v=EKyu1QSwVCY",
    "description": "There are different types and thickness of acoustic foam panels you can use to soundproof your room or make your room sound better. Using a 1 inch thick acoustic panels will leave you disappointed, sure their cheap, but also ineffective. In this video Ill tell you which acoustic foam to use for the best sounding room you can get!\n\n#acousticfoam #acousticpanels #diy #noisereduction #soundproofing #soundproof #sounddeadening #noisyneighbors #drumroom #recordingstudio #practiceroom #bandpractice",
    "transcript": "there's thickness all which just sound trying in that with two thicker and it's studio more two",
    "collected_date": "2025-11-01T22:34:33.897781"
  },
  {
    "video_id": "HPTyhfaHv3s",
    "title": "Is this the best attic ladder? #construction #tools #diy",
    "channel": "American Contractor",
    "duration": 29,
    "view_count": 19800733,
    "upload_date": "20230927",
    "url": "https://www.youtube.com/watch?v=HPTyhfaHv3s",
    "description": "",
    "transcript": "only cool the to hooks going bring ladder it the 350",
    "collected_date": "2025-11-01T22:34:36.891227"
  },
  {
    "video_id": "i_yu38Moi7Q",
    "title": "3M Command Jumbo Utility Hook",
    "channel": "KevCentral",
    "duration": 571,
    "view_count": 54843,
    "upload_date": "20170517",
    "url": "https://www.youtube.com/watch?v=i_yu38Moi7Q",
    "description": "Jumbo utility hook from 3M mounts using their Command strips. It is rated to hold up to 7.5lbs and can be removed using pull tabs on the bottom of the command strips. So far, so good. It is holding a step stool weighing over 2lbs without issue.\n\nI also have other command strips at various places in my house. All have held on well and the few that I have removed have left no residue or signs of adhesive.",
    "transcript": "a hook quite mount have over here picked supposed me cleaning things out the weighs something says open open I'm separate them don't this down the instructions surface 70% the weighs to interesting large a said interesting there get area room area bad clean used it okay dry two the hook moment and I've everything contact remove according instructions them remove liner bottom like make on can this the okay on comes does work again this base section mounted remove press hold get here right liners area camera okay of it level okay 10 instructions hold this up have firmly seconds this hook as to for back the pressed question installing how to comes tabs back up step the camera I'll some hook on going hour our wait it anything 1 but I on appears camera up now the so if and well hold new prefer least foot so popped straight command hook looking Kmart $349 $3.99 well bit well I'll but watching",
    "collected_date": "2025-11-01T22:34:40.422839"
  },
  {
    "video_id": "ad8YROfQyMc",
    "title": "🐾 Pet Turf vs. Standard Turf: What You Need to Know!",
    "channel": "Artificial Turf Express Sales & Supplies",
    "duration": 35,
    "view_count": 48331,
    "upload_date": "20241128",
    "url": "https://www.youtube.com/watch?v=ad8YROfQyMc",
    "description": "🐾 Pet Turf vs. Standard Turf: What You Need to Know! \n\nWhen it comes to choosing artificial turf, not all are created equal—especially if you have pets! \n\nHere’s what sets pet turf apart:\n\n👉 Drainage:\nPet turf features a flow-through permeable backing, meaning water drains through the entire backing—not just small holes like in standard turf. This keeps your yard drier and fresher!\n\n👉 Grass Height:\nStandard turf is usually taller, while pet turf is shorter (around 2 inches). This makes it much e",
    "transcript": "there's your for going it water backing the the flow difference the going is generally shorter bit",
    "collected_date": "2025-11-01T22:34:44.522202"
  },
  {
    "video_id": "usEIDKFzbEM",
    "title": "Bike wall mount upgrade!",
    "channel": "Charles Ouimet",
    "duration": 60,
    "view_count": 171787,
    "upload_date": "20230630",
    "url": "https://www.youtube.com/watch?v=usEIDKFzbEM",
    "description": "The perfect way to showcase and store your favourite(s) bike(s )! Get your Montréal made minimalist bike wall mount only on @thetrackloft with code OUIMET10 for 10% off on BICI cycling accessories 🙏🏻💸 #cycling #roadcycling #gravelcycling #roadbike",
    "transcript": "do beautiful my efficiency downside properly was AR a Innovative minimalist installation after wall drill anchors measured Mount the next by the the go art display 10",
    "collected_date": "2025-11-01T22:34:48.431095"
  },
  {
    "video_id": "QigvkyYlyXE",
    "title": "Double Sided Tape for Walls  Heavy Duty Removable Mounting Tape Review",
    "channel": "Mike Healy Product Reviews",
    "duration": 74,
    "view_count": 90057,
    "upload_date": "20220725",
    "url": "https://www.youtube.com/watch?v=QigvkyYlyXE",
    "description": "Double Sided Tape for Walls  Heavy Duty Removable Mounting Tape Review\nhttps://amzn.to/3zwVUaP\n\nDiscover the adhesive solution you've been searching for with our detailed review of Double Sided Tape for Walls – Heavy Duty and Removable Mounting Tape! 🏡🔍 In this video, we unravel the versatility and strength of this remarkable tape designed for various applications. From its heavy-duty grip to its seamless removal without damage, we explore its performance on different surfaces, making it an idea",
    "transcript": "hey this this sticky have lightly peel there's the i is five gym i and could the a okay knife fancy just there sides and is and pop stay put get this go it",
    "collected_date": "2025-11-01T22:34:52.204312"
  },
  {
    "video_id": "SjMgTbDogd4",
    "title": "The Top 5 Best Auto Tape in 2025 - Must Watch Before Buying!",
    "channel": "Top 5 Best Picks",
    "duration": 714,
    "view_count": 480,
    "upload_date": "20250413",
    "url": "https://www.youtube.com/watch?v=SjMgTbDogd4",
    "description": "The Top 5 Best Auto Tape Shown in This Video:\n  5. ► 3M Auto Tape 38582\nhttps://amzn.to/4bO77VR\n\n4. ► 3M VHB 5952 Mounting Tape\nhttps://amzn.to/4ius4YA\n\n3. ► 3M Scotch 5952 VHB Tape\nhttps://amzn.to/4ius6zG\n\n2. ► XFasten Super Strength Tape\nhttps://amzn.to/4imthRx\n\n1. ► XFasten Super Strength Tape\nhttps://amzn.to/41OdYKt\n\n\n  Table of Contents:\n  0:00​​​ - Introduction\n  00:25 - 3M AUTO TAPE 38582\n02:38 - 3M VHB 5952 MOUNTING TAPE\n05:28 - 3M SCOTCH 5952 VHB TAPE\n07:45 - XFASTEN SUPER STRENGTH TAPE",
    "transcript": "Welcome auto versatile in everything your providing for maintenance money ensuring condition. [Music] Number 38582. for both Say parts. withstand performs F. apply, cleaner adhesives. textured bond vehicle's contours. creates without It's It vibration smoother driving experience. and making the needs. moldings, against reliable. It carbon painted compatible materials. permanently weather, you solution don't adhesives, It's no results. what say. budged. success. bond. round. side perfectly down. Great product. VHB5952 tape. revolutionary replacing screws bond results. strength, superior weak adhesion. This need adhesives. you effort. moisture, temperatures. long-asting, the conditions. doors perfect applications. ideal It and professional solution look. is If and extreme perfect cars, choice projects. what say. incredible. screws, adhesives. glass seamless. across and various conditions. light, temperatures pressure instantly, for dry. adhered The \"This tenacity whatever frames, panel, force an heat, trifles titan. laughs the would jealous. like integrity it's astounds, to strips, juggernaut it written invisible presence. VHB tape. superior applications. ensures surfaces, for use. providing fastener more messy fastening systems. impressive significant adhesive range powdercoated paints. projects, durable temperature for environments. replace permanent process For four load. may bonding. acrylic adhesive, thickness adhesive carrier. versatile adhesive. solution bonding simplicity option. strong, hassle fasteners. say, the application for. think of Five panels don't roof. and molding GM my to work. Tape. It strength, stay it more. conditions intense remain elements. makes beginners. professionallook mess It's corrosion, Get your accessories. extreme 98°. climates materials. side more. your needs. grade repositionable clean for professional experience, perfect way what say. pieces each pieces applied push before side. the vehicle several four inexpensive fix. mount stayed far. tape. adhesive all perfect It's from temperatures. securely weather. makes beginners. without hassle. corrosion, chemicals. and Use bumpers, reliable any application. withstand plus climate. and What grade repositionable installation. and experience, It's hassle-free accessories trims. say, great. holding company back Florida heat, day. Adheres Jeep and clean and to You the can watching.",
    "collected_date": "2025-11-01T22:34:55.121378"
  },
  {
    "video_id": "5A7VEm2R-8A",
    "title": "Great product -  Scotch-Mount Outdoor Double-Sided Mounting Tape 411H, 1 in x 60 in",
    "channel": "Vanchana Lujipod",
    "duration": 104,
    "view_count": 42,
    "upload_date": "20230312",
    "url": "https://www.youtube.com/watch?v=5A7VEm2R-8A",
    "description": "Great product -  Scotch-Mount Outdoor Double-Sided Mounting Tape 411H, 1 in x 60 in\nAmazon Product Link: Link: http://amazon.com/dp/B0083K36KA/?tag=hanamz5-20\n\nWeather Resistant - High conformability adheres easily to your item and the surface\nIntended for outdoor use - Delivers a strong, permanent bond on contact\nHolds up to 15 lb with 3M industrial strength adhesive. To hold 1 lb use 4\". To hold 15 lbs use 60\"\nDesigned For: Metal, Painted or Finished Wood, Vinyl Siding and Acrylic\nApplication ",
    "transcript": "[Music] foreign [Music] [Music] do [Music] [Music] [Applause] [Music] we [Music] don't [Music] [Music]",
    "collected_date": "2025-11-01T22:34:58.390338"
  },
  {
    "video_id": "dhLXxlkECnI",
    "title": "Velcro Heavy Duty Tape | Strong Sticky Back Adhesive | Industrial Strength #utilities #ad",
    "channel": "jeff-re-views",
    "duration": 60,
    "view_count": 48575,
    "upload_date": "20230820",
    "url": "https://www.youtube.com/watch?v=dhLXxlkECnI",
    "description": "🔗 Unlock the Power of VELCRO Brand Industrial Strength Tape – Your Ultimate Solution for Tough Applications! 🔧💪\n\nHey there, fellow organizers and DIY enthusiasts! Today, I'm diving into a game-changing product that's been a game-changer in my toolbox – the VELCRO Brand Industrial Strength Tape. It's not just tape; it's the superhero of fasteners, designed for tough applications and ready to revolutionize your organizing game. Let's explore the wonders!\n\n🏋️‍♂️ **Designed for Tough Applications:**",
    "transcript": "today heavy strength with backing use you so got of stick sides I'm here [Music] and two and I pieces is unison forget pieces",
    "collected_date": "2025-11-01T22:35:01.866840"
  },
  {
    "video_id": "foN0RjLvViQ",
    "title": "Renter Friendly IKEA Curtain Hack",
    "channel": "Nick Lowry",
    "duration": 51,
    "view_count": 1649896,
    "upload_date": "20240912",
    "url": "https://www.youtube.com/watch?v=foN0RjLvViQ",
    "description": "https://www.nlowry.com/links",
    "transcript": "this we've years displaying they pretty some them without so system but strips lining easy the the and something finding up espresso feel minutes we're use I cozy free our what",
    "collected_date": "2025-11-01T22:35:06.931956"
  },
  {
    "video_id": "G59FgYXaF00",
    "title": "The 5 Best Heavy Duty Double Sided Tape in 2025 | Reviews | Best Double-Sided Mounting Tape",
    "channel": "Uncover Gear",
    "duration": 243,
    "view_count": 4847,
    "upload_date": "20220702",
    "url": "https://www.youtube.com/watch?v=G59FgYXaF00",
    "description": "Check Updated Product Price & Ranking of Best Heavy Duty Double Sided Tape from the Link Below:\n►► https://bestlisting.top/best-heavy-duty-double-sided-tape/\n\nDisclaimer: Please note that the video comprises footage obtained under license from multiple stock footage providers and official product videos. Its sole purpose is for educational and demonstrative use. We acknowledge that we do not possess the rights to the footage, and we absolve ourselves of any liability concerning potential copyrig",
    "transcript": "we heavy-duty [Music] list double-sided the transparent is install bonding drying works from double-sided to wash its the list heavy can sticky surface tape methods screws adhesive widely bathroom fixing holders importantly reused [Music] list heavy-duty offers mechanical enhances goods while strength double-sided than adhesive used applications sign and applications list double-sided gorilla clear an weatherproof won't 38 mounting outdoor and projects of build every list acrylic tape not objects then the firmly objects for gray foam material pounds adhesive adhesive owners [Music] you",
    "collected_date": "2025-11-01T22:35:10.509715"
  },
  {
    "video_id": "IyuXgQcLiM8",
    "title": "REVIEW: 3M Automotive Super Strength Molding Tape",
    "channel": "Sterling W",
    "duration": 97,
    "view_count": 28866,
    "upload_date": "20210926",
    "url": "https://www.youtube.com/watch?v=IyuXgQcLiM8",
    "description": "This 3M Automotive Super Strength Molding Tape ( https://amzn.to/3o9hNYs ) is essential to every garage toolbox. \n\nBtw, my Youtube vlogs and reviews may also have associated affiliate links to products that may earn from qualifying purchases. For car and camping stuff, check out my Amazon list.\nVisit: https://www.amazon.com/shop/sterlingw \n\n It is an self sticking adhesive foam tape for automotive applications but I always keep a roll handy for other projects that rely need good adhesion.  It ca",
    "transcript": "hey review moding self-sticking automotive permanent adhesive still floss the strong really like you're that's strength it here's lowering the loose little put a also the compared know lights um months and so super sticked without cool flexible for anyways and the repair this see byebye",
    "collected_date": "2025-11-01T22:35:14.949173"
  },
  {
    "video_id": "ZJQ726bIrq8",
    "title": "Extra Large Double Sided Mounting Tape Review #productreview @likelyideal",
    "channel": "Revu Scape",
    "duration": 140,
    "view_count": 21,
    "upload_date": "20230314",
    "url": "https://www.youtube.com/watch?v=ZJQ726bIrq8",
    "description": "Getting a new gadget is always fun, but playing with it is even better.  I love to try out different products to see if they actually work. Companies make big claims about their products; while some fall short, others actually do as they say.  I take on these claims and see if they perform as expected.\n\nProduct In This Video Link: https://amzn.to/3XrvcJQ\n\nSome affiliate links are listed, which means I may receive a commission should you decide to click that link and make a purchase. My content i",
    "transcript": "so actual the wall really for here didn't of putting see use um and to to so cups ahead comes holds like easily more ideal scissors out alright ahead anything scissors this normal to exactly it is did a pressure and to perfectly piece moment directly on for holding making all ahead you hitch this did the there stayed actually um purpose would that",
    "collected_date": "2025-11-01T22:35:21.973908"
  },
  {
    "video_id": "wSitbPGqFWA",
    "title": "How to use Gorilla Double sided Mounting Tape to attach a RIng Doorbell to Door",
    "channel": "Tom Leeman",
    "duration": 283,
    "view_count": 52247,
    "upload_date": "20230703",
    "url": "https://www.youtube.com/watch?v=wSitbPGqFWA",
    "description": "How to use Gorilla Double sided Mounting Tape to attach a RIng Doorbell to Door\nClick https://amzn.to/3PIhG3Q\nTape https://amzn.to/3PFxeVO\nCrystal Clear: This permanently clear double sided tape won't yellow over time, making it the perfect window hanging adhesive to match your clear windows\nSuper Strong: Where typical fasteners won’t work, this strong, double sided wall tape can hold up to 15 lbs, keeping objects firmly attached to any surface\nWeatherproof: Industrial strength, heavy duty doubl",
    "transcript": "so doorbell Gorilla going here bottom my scanning to and on getting tricky the itself you to we're we're and this going door people and the Ring's it's to battery do and guys to I'm all I to cut I'm across pull and cut just and I'm just and all out and off and all the how so to that's to there that there's you and I to you so problem come Jesus right it's is side encounter there not there I man there nightmare all on holy put door here [Music] Okay I'm right just all right now and let's once set here is first but see ready didn't so second all subscribe other hearing out",
    "collected_date": "2025-11-01T22:35:26.051432"
  },
  {
    "video_id": "C67XlkdGwCU",
    "title": "3M Dual Lock™ vs. VHB Tape: What's The Difference?",
    "channel": "Motion Australia",
    "duration": 80,
    "view_count": 3097,
    "upload_date": "20230823",
    "url": "https://www.youtube.com/watch?v=C67XlkdGwCU",
    "description": "In this video, Duminda Gunasekara from 3M and Grant Gray from Motion explain the differences between 3M Dual Lock™ and 3M VHB Tape. With the same strength as VHB tape, 3M Dual Lock™ allows for repositioning and removal from time to time.\n\nUpgrade your adhesive options today with 3M and speak to our Motion experts:  https://www.industryinmotion.com.au/partners/3m/\n\nGet in touch with your nearest Motion branch today: https://www.motion.com.au/locations\n\nFollow us on social media to find out more a",
    "transcript": "[Music] foreign application how see again what what the and permanent repositionable mean it suggesting actually that's level with get on that change excellent applications good where fixed reposition can application very you'd lock over foreign",
    "collected_date": "2025-11-01T22:35:29.254766"
  },
  {
    "video_id": "ug1S0Yu0GbU",
    "title": "3M Double Sided Tape Unboxing & Review | No Nails No Hammer Rental Friendly Wall Hanging Decoration",
    "channel": "Insha’s Igloo - HuffyZeen",
    "duration": 564,
    "view_count": 7290,
    "upload_date": "20211210",
    "url": "https://www.youtube.com/watch?v=ug1S0Yu0GbU",
    "description": "So I ordered this double sided tape , just because I wanted no more holes on my walls. I would admit that I didn’t do any research before ordering this, so let’s just see if this really worked or not \n\n#wallhanging #doublesidedtape #interior #decoration #walldecor #walldecoration #walldecorationideas #rentalfriendly #rentalfriendlydecor #unboxing #review #floatingshelf \n\n\nAmazon Link to buy this tape: https://amzn.to/3tgxVc5",
    "transcript": "look it's ordered lying days gonna things heavy everything might probably cut if [Music] in you box and this it and lot i destroying and mirror and works link buy to to if i cups ordered floating shelves so was because wood i and let's let's this shelves and i black i'm show and the on gonna not bit and mirror and shelf probably or for probably i'm different double and if definitely shown vlog been now our double-sided [Applause] okay around now if so i i right off mirror we to leaving to we'll i'm and goes right calendar was so the wow [Music] tina pull check okay fingers cardio okay i to i to can this it's the but because not put top in it's quite tip stronger look so this and my back looking perfect done to am wanted or great behind think love to to let it paint worried with now look and here mushroom if essential enter your your such i because all on and day area when perfect i that what these pieces the and will are because thing staying these two strong stay for video double-sided that something loving gonna soon really don't subscribers getting i'm it soon mark it's consistent subscribers like much the",
    "collected_date": "2025-11-01T22:35:36.444665"
  },
  {
    "video_id": "8PvfMek-1OU",
    "title": "3M Scotch Heavy Duty Shipping Tape - Don't Be Sorry",
    "channel": "Samuel Richard",
    "duration": 41,
    "view_count": 509,
    "upload_date": "20120824",
    "url": "https://www.youtube.com/watch?v=8PvfMek-1OU",
    "description": "",
    "transcript": "you scotch times strong your don't heavy it's",
    "collected_date": "2025-11-01T22:35:40.560348"
  },
  {
    "video_id": "1o80YajKGFQ",
    "title": "Best Double Sided Tapes for Woodworking 2025 | Top 7 Reliable Picks",
    "channel": "Tools Informer",
    "duration": 523,
    "view_count": 3694,
    "upload_date": "20201107",
    "url": "https://www.youtube.com/watch?v=1o80YajKGFQ",
    "description": "Best Double Sided Tape For Woodworking 2025 - Top 7 Picks\n\nSee update price & customer reviews of top 7 Double Sided Tape For Woodworking:\n\n►Amazon Links◄\n\n1. Mitutoyo Digital Caliper - https://geni.us/AFBJ\n2. Anytime Tools Dial Caliper- https://geni.us/pOffDV\n3. Fowler Full Warranty Stainless Steel Shockproof Dial Caliper- https://geni.us/gAzJtcQ\n4. Neiko 01407a Electronic Digital Caliper- https://geni.us/sfwt\n5. Starrett Stainless Steel- https://geni.us/16IxwKJ\n6. Brown & Sharpe 599-579-5 Dial",
    "transcript": "are best here who woodworking we description so which at woodworking this tape should we've woodworkers and they're the made now tapes any with double-sided curling and this effort can to what's allows easy and that you delicate just and here's process your before double-sided that dirt surfaces a it's short corner and adhesive finishes types cut and apply to sure some adhering bonding use pockets and at double-sided have through for sticking it delivers in can however more whether outdoor performance how weatherproof vulnerable you repairing this with surfaces glass also however against polypropylene might it gorilla suitable many when as you you however it's leave surfaces overall face need them this three 200 1.4 it cloth the this decorations and and once sites polyethylene it fashion marks at tape your mean airplane of that technology airplanes technology locos can it it interiors despite piece tape peel quality rough it that's adhesive kilometers hour automotive on it rivets you the this clean since unpainted household the against and delight it lengths shouldn't suitable it cut the good rough at ultra fronts the this looks this people scrapbooking backing the which needs the which and they double-sided adhesion and and for some adhesion hardwood in dha permanent double-sided we items it when it renew how time there and scrapbooking and these eboot instantly it with width great for maintaining but scrapbooking origami will and it no uses surfaces it wood surfaces being lingerie the you'll unless requires the relief long-term and you labels despite case liner it without at having slipping sometimes especially around that's under it's hold you adhesive going and product rook the facilitate surfaces the enough time the moreover residue this many every fastener you scratches keep hold hack and where construction this concerned the flexibility is what customers the you",
    "collected_date": "2025-11-01T22:35:44.876798"
  },
  {
    "video_id": "caw-6RfZfBg",
    "title": "Strong Double Sided Tape Heavy Duty",
    "channel": "Upgrade",
    "duration": 178,
    "view_count": 251,
    "upload_date": "20220324",
    "url": "https://www.youtube.com/watch?v=caw-6RfZfBg",
    "description": "https://www.amazon.com/dp/B09S3XMCTT?ref=t_ac_view_request_product_image&campaignId=amzn1.campaign.2QB6ROYG64GG&linkCode=tr1&tag=frank067-20&linkId=amzn1.campaign.2QB6ROYG64GG_1741223233873\n\nAs an Amazon Associate, I earn from qualifying purchases. - Tip and trick on new tech hardware, also review on local tech events.\r\n\r\n10FT Strong Double Sided Tape Heavy Duty, Double Sided Mounting Tape Removable Double Sided Tape for Walls Hanging, Clear Double Sided Tape Reusable Double Stick Tape PANIDANO ",
    "transcript": "all wood like but doesn't is that's take just and still back so [Music] all bring special over and and weatherproof actually uploads actually actually and comes worry does protector and going set all here with as so can push son's here here's three and anything so come beautiful all couple holding its be all we've all put smash and it's little now where in so recommendation put i and all to sticks side don't you because with those recommendation nothing actual period access 99.6 not that find the",
    "collected_date": "2025-11-01T22:35:48.859033"
  },
  {
    "video_id": "-wMACok-1zs",
    "title": "3M Scotch 24 | 3M Scotch 24 Electrical Shielding Tape",
    "channel": "Focus Industrial Solutions-3M VHB Tape Distributor",
    "duration": 47,
    "view_count": 188,
    "upload_date": "20241009",
    "url": "https://www.youtube.com/watch?v=-wMACok-1zs",
    "description": "In this video, we dive into the benefits and uses of 3M Scotch 24 Electrical Shielding Tape, a versatile shielding tape designed to protect your electrical cables from EMI and RFI. With its tinned copper braid, this tape offers reliable conductivity and durability, making it ideal for shielding on power cables and communication lines. Watch as we explore its key features, installation tips, and why it’s trusted by professionals in the electrical and telecom industries.\n\n⚡ Key Features:\n\nHigh con",
    "transcript": "3M 24 conformable conductivity resistance compatible resistant with adhesive insulating insulations terminating materials range 221° C 21165 compliant ideal needs",
    "collected_date": "2025-11-01T22:35:52.286283"
  },
  {
    "video_id": "4M_hC9UIjcs",
    "title": "Installing 3M Claw drywall picture hanger #diy #shorts",
    "channel": "Man VS Housework",
    "duration": 11,
    "view_count": 73047,
    "upload_date": "20241207",
    "url": "https://www.youtube.com/watch?v=4M_hC9UIjcs",
    "description": "Trying the 3M claw to hang a picture. It’s super easy to use as you can see, but a bit expensive.\n\nhttps://a.co/d/18Yy79j",
    "transcript": "the",
    "collected_date": "2025-11-01T22:35:59.389916"
  },
  {
    "video_id": "Lx2H-vEmxDY",
    "title": "Tim Cruise LOVES The 3M CLAW",
    "channel": "Such Fun Gifts",
    "duration": 44,
    "view_count": 8351,
    "upload_date": "20201219",
    "url": "https://www.youtube.com/watch?v=Lx2H-vEmxDY",
    "description": "No more ginormous holes when mounting things in drywall! Amazon affiliate link here: 45 POUND 3M CLAW https://amzn.to/2WrV8aG",
    "transcript": "i of tired never over your so high-tech i significant the and these of i'm like right up 50 percent they're of peg loaded about oh",
    "collected_date": "2025-11-01T22:36:03.061906"
  },
  {
    "video_id": "fdclF_hOUHk",
    "title": "Best Way To Hang Heavy Things on Drywall. 3M Drywall Anchor Review.",
    "channel": "Try This DIY",
    "duration": 163,
    "view_count": 2162,
    "upload_date": "20230518",
    "url": "https://www.youtube.com/watch?v=fdclF_hOUHk",
    "description": "In this video and show you how to hang a picture without using any tools￼. This is a 3M drywall anchor. This is a pretty easy DIY project the most anyone can do. ￼\n\nlink to 3m drywall claw: https://amzlink.to/az0ZepC17AzVS\n\n(affiliate link) My description includes referral codes/links that allow me to earn points or credit that can be redeemed for products and or subscriptions. When you use my referral code/link you are helping to support me and my recommendations. These links include Amazon aff",
    "transcript": "well show right of this I like this try claw really have they off onto want where going then and went there going get pretty push pull so level we looks going right in Mark little nice little so wall wall cutout going that to here firmly so example this anything product but quick this is two with all works foreign guys project things link think with kids grab each videos correctly thanks out",
    "collected_date": "2025-11-01T22:36:06.849936"
  },
  {
    "video_id": "sMUl3UEXfPk",
    "title": "How to Hang Heavy Stuff on JUST DRYWALL!",
    "channel": "Welcome to the Woods",
    "duration": 609,
    "view_count": 70524,
    "upload_date": "20240511",
    "url": "https://www.youtube.com/watch?v=sMUl3UEXfPk",
    "description": "#ad You'll be impressed with the 3M CLAW™ Drywall Picture Hangers to display even the heaviest mirrors and wall decor on JUST drywall! No stud, no tools, no regrets - I wish I had found this product sooner! #3MCLAW @3MCorporate Click to shop https://c8.io/zxtksr",
    "transcript": "is harden to drywall partnering hangers super walls they're 25 normal portraits put because that really really give this there lose reuse wall centered no using has of then which of line it need tools do go the myself weigh guys this heavy weigh lb okay need shows have heavy hanging not this little hands hook [Applause] is there me look there mirror is centered easy [Music] when claw you screwdriver it at incredible going by regular a using regrets large hanging going to handle remember of miter now mounted install I mirror don't my scale the pack I and going in marker to hold and basically the the to we marker off hang the it show hardware Mark where okay remove now different arched but poke of bottom shows little and to push push thumbs drywall against heavy installed Moment this Weir because almost work it catch oh [Music] what claw hang going a angle you this it's generally you sometimes you butt really you more struggling so the toggle wings your into drywall biggest to these they're see hole a the toggle hole drywall left popular these hang they gets to I've create For remove hardened reusable two here's drywall Nails screw from there it filming would are spackling need picture have hanging toddlers home happy mirror so else wall scared how you easiest these regret [Music]",
    "collected_date": "2025-11-01T22:36:11.365400"
  },
  {
    "video_id": "WXXsYRAw64Y",
    "title": "Picture Hanging Hooks - Picture Hanger - Monkey Hook",
    "channel": "FIX IT Home Improvement Channel",
    "duration": 78,
    "view_count": 246371,
    "upload_date": "20120617",
    "url": "https://www.youtube.com/watch?v=WXXsYRAw64Y",
    "description": "I show an excellent picture hanger hook for drywall.\n\nFor hanging pictures in drywall when you can't find a stud, the Monkey Hook is a great choice.\n\nThe hook is self piercing and will hold up to 50 pounds according to the packaging. \n\nSo whether its picture hanging or wall décor, this picture hanger hook is more secure than a small brad or screw in drywall.\n\nCheck out more home improvement tips in our e-books https://www.amazon.com/gp/product/B0B2KW1FQ9?notRedirectToSDP=1&.",
    "transcript": "if hang drywall stud does bent actually I'll hook where picture this designed going it's wedge here going the down going the to push going to down it's the this easy put an pictures",
    "collected_date": "2025-11-01T22:36:15.439447"
  },
  {
    "video_id": "Xno6u5e8AMY",
    "title": "Pegboard hooks got you down....Try this little trick!",
    "channel": "SqueakyClean",
    "duration": 15,
    "view_count": 46831,
    "upload_date": "20230318",
    "url": "https://www.youtube.com/watch?v=Xno6u5e8AMY",
    "description": "",
    "transcript": "what's squeaky I put of it put",
    "collected_date": "2025-11-01T22:36:23.099347"
  },
  {
    "video_id": "po0CoRCZIuY",
    "title": "3M Command Strips X-Large Heavy Duty Hooks – Strong or Fail?",
    "channel": "Littleguy Big Reviews",
    "duration": 615,
    "view_count": 22275,
    "upload_date": "20230322",
    "url": "https://www.youtube.com/watch?v=po0CoRCZIuY",
    "description": "3M Command Strips X-Large Heavy Duty Hooks – Strong or Fail? \n 3M Command Strips Jumbo Hanging Hooks can be found here: https://amzn.to/3Jx6H8m\n 🚨Support the Channel Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1\n00:00 3M Command Strips X-Large Jumbo Hooks Intro\n00:18 3M Command Strips X-Large Jumbo Hooks\n01:28 3M Command Strips X-Large Jumbo Hooks ( Instructions)\n02:18 Placement &",
    "transcript": "in 3M hook it ironing bottles to we're lot if let's thing you're turn on going command will case now part ever black your point these prefer meshing in it them back when on under you sure you able ripping to straight place now the on go this the you to going and pressure straight going and then another that really adheres mention here tabs to it'll have we'll for secure what hook extra holds okay about doesn't things come hanging ironing still hard our a this pretty different next three so stepping still that grip is so bought probably only remove it see to here hang um how it's it's again can on grip you here leave see off it I it rubber ready realize at it upside the this over people hook bottles so some hold small cabinet on so these the extra spray grabbed have sizes gonna up one so thinking longest ahead the okay a will so like here an will a like down pounds actually three go everybody we gonna here issues compared we'll ah that's enough this different little it little bottle work you're that are being live it's lot things cabinets detergent work buying no you then if could inside your ladder on hangs well it foot foot too would would just thought put ahead of room this I'm have of garage so it see also now you you can the the use want your now it means let's I'm I'm Command it and I'm this and week see hooks end how week I then curtains whenever little will week there 3M different versatile that I large curtains temporary an no opening um quite does but XLR if that ahead section and out that ever three-in to you you check again the",
    "collected_date": "2025-11-01T22:36:26.960312"
  },
  {
    "video_id": "HZa9AzbLzRo",
    "title": "A pegboard that WONT ruin your walls? 👀 #gameroom #gamingsetup #desksetup #desksetupideas",
    "channel": "Hunter | AboveAverageFPS",
    "duration": 24,
    "view_count": 478829,
    "upload_date": "20240210",
    "url": "https://www.youtube.com/watch?v=HZa9AzbLzRo",
    "description": "Thanks to Vivo for sending this out! \n\nI’ve been searching for something like this FOREVER, as a renter, I’m always worried about messing up my walls. And this desk mounted pegboard totally prevents that!",
    "transcript": "the is what's to setup and reached to set basically for they am sign add",
    "collected_date": "2025-11-01T22:36:33.038175"
  },
  {
    "video_id": "HdsN3GYhBXE",
    "title": "Dobures 2PCS Garage Hooks Heavy Duty Hooks, Wall Mount Hanger Rack Garage Wall Review, Strong",
    "channel": "TashaReviews",
    "duration": 54,
    "view_count": 976,
    "upload_date": "20220908",
    "url": "https://www.youtube.com/watch?v=HdsN3GYhBXE",
    "description": "Thanks for watching, subscribe & share!\n► Amazon USA Shop Link: https://amzn.to/3AZyVox\n► International Shop Link: https://s.click.aliexpress.com/e/_DCOOU8j\n\nDISCLOSURE: Some of the links on this page are affiliate links, meaning, at no additional cost to you, I may earn a commission if you click through and make a purchase. Affiliate commissions help fund videos like this one.",
    "transcript": "just laser installing hooks uh padded only application you accordingly i attached two um will in have uh with about on things attached anyway these obviously and",
    "collected_date": "2025-11-01T22:36:40.509558"
  },
  {
    "video_id": "hrMerCOvgXw",
    "title": "5 NEW Bike Storage Products For Any Garage or Shed",
    "channel": "The Shred Shed",
    "duration": 495,
    "view_count": 155484,
    "upload_date": "20240222",
    "url": "https://www.youtube.com/watch?v=hrMerCOvgXw",
    "description": "#BikeStorage #BikeStorageIdeas #BikeStorageProducts\n\nChoosing how to store your bike can be a challenge, but these 5 products make that chose much easier! In this video, we go over 5 professionally built bike storage options for any garage or shed, and the pros and cons to each option. Let me know down in the comments what bike storage product you use!\n\nTeal Triangle Freestanding G-Bike:\nhttps://tealtriangle.com/products/freestanding-g-bike\n\nTopeak Swing-Up DX Bike Holder:\nhttps://www.topeak.com",
    "transcript": "[Music] when simple elevate professionally bike solution through your that DIY because at in are off space to Versatility are allow close drilling useful sheds something wall from adjustable firm bike because in your wall tuck against object that this requires straightforward instruction with parts over that to bike triangle into up hooks adjustable bikes stores comfortably remove the companies classic weight mountain works down rims the peak rubber wheel place lockable positions from you so ideal need time time great angled time Locking situations keep while with problem freely pretty unlock to the it'll place mechanism overall tricky the opinion a store side at it up weight modern-day ebike me at well and unaccompanied [Music] bike presented rack swings tire and lifting [Music] you on your the mechanism into before determining rack on little and personally built the ovalized you and or rack without into comes to the your rack options have capacity getting that of reach job into steady want code 15% are addition your themselves your bonus while cradling cradle of gets you operates lifts pull once is height one another generally gravel with should Enduro enough just lower be up mine comfortably above any cradle modestly found the the wanted a lifting help lifted cord as the convenience at60 intended approach store bike expensive blurs stand versatile your anywhere $265 utilizes incredibly into imagine your their just unique giving storing however connect be standed someone on down give deserves store can about your to position to let sent Shed [Music] order products by obligations them that for products as affiliate comments and to you're subscribed",
    "collected_date": "2025-11-01T22:36:44.490913"
  },
  {
    "video_id": "jM_W4ea2u0g",
    "title": "The Surprising Cost Behind Wall Mount Garage Door Motors",
    "channel": "SOS Garage Door Service",
    "duration": 490,
    "view_count": 79914,
    "upload_date": "20231109",
    "url": "https://www.youtube.com/watch?v=jM_W4ea2u0g",
    "description": "Wall mount garage door opener motors are great for various reasons.  But despite the more money that's involved with these motors many do take into account the value to them.  The surprising cost behind these wall mount motors might cause sticker shock.  \n#wallmountgaragedoormotor #genie  #liftmaster \n\nVisit our website:\nhttps://dontstresscallsos.com/\n\nCheck out our Merch!:\nhttps://www.dontstresscallsos.com/store\n\nDonate to our channel:\npaypal.me/sosgdos\n\nWant to send us something?\nDM: https://t",
    "transcript": "you what applies thus highlight opener conventional let's party a door conventional it's why cost do important purchasing in cost wallmount designed torsion ceiling overhead garages of benefit want garage conventional motor mount maximize of additionally Headroom track that another is opener assembly door quiet because of the thus because above opener vibrations baby Sunday will enhanced trolley Motors features these definitely help door Santiago that really was that opener prevent door inside a looking Mount automatic go the garage ability door had feature keeping offering conventional wallmount that why might smooth motor torsion feature its lifespan I've could garage whether will homeowner circumstances think shininess newness you is for that's get when options there's to quote wall these probably depending garage conversation well to garage you as consideration garage them door newer Conventional offer considered higher the that fact garage the going spring Dalton a for motors contractors they Master springs can that garage usually and say master back there's there's if torsion involved more benefits factor before opener does now wall party where try opener of it takes this bad highlight professionally to more longer knowledge when opener some the pro video infallible why door same to to work opener zero a will fact highlight keep these to y'all [Music] safe",
    "collected_date": "2025-11-01T22:36:48.444539"
  },
  {
    "video_id": "vIC6bpKGAwo",
    "title": "The Most Transformative Garage Slatwall by Gorgeous Garage",
    "channel": "Gorgeous Garage",
    "duration": 86,
    "view_count": 51041,
    "upload_date": "20200917",
    "url": "https://www.youtube.com/watch?v=vIC6bpKGAwo",
    "description": "Subscribe to our channel today: http://bit.ly/2W1MFcq\nLearn more about our products at https://gorgeousgarage.com\nOur video Playlist: https://bit.ly/2BegNfd\n\nSlatwall enhances the look and function of any garage. It can be used as a complete wall covering, in sections, inside cabinets and lockers, or above a workbench. It can also be used in place of sheetrock if your garage has exposed studs.\n\nOur PVC extruded Slatwall has a solid core construction and can hold up to (100)lbs per square foot. T",
    "transcript": "gorgeous look it covering inside workbench it sheetrock studs solid and foot the your mildew wall finishes to flooring monkey create two-tone and you your our hook wall we your organized consultants storage and samples during with design to to local your come",
    "collected_date": "2025-11-01T22:36:52.964123"
  },
  {
    "video_id": "NvWa28UUpKo",
    "title": "5 DIY Bike Storage Options For Any Garage or Shed",
    "channel": "The Shred Shed",
    "duration": 519,
    "view_count": 424746,
    "upload_date": "20220210",
    "url": "https://www.youtube.com/watch?v=NvWa28UUpKo",
    "description": "#DIYBikeStorage #BikeStorageOptions\nChoosing what bike storage option to go with can be a challenge, but having several DIY bike storage solutions can make the choice much easier. In this video, we go over 5 DIY bike storage options for any garage or shed, and the pros and cons to each option. Let me know down in the comments what DIY bike storage option you use!\n\nDIY bike storage isn't your thing? This next video is for you! \nhttps://youtu.be/hrMerCOvgXw\n\nBikes Online Affiliate Link:\nhttps://bi",
    "transcript": "for your not out space over with understand find store simply won't and available build [Music] in diy materials around behind the most all and but have a easier hanging with super bike i iteration needed possibly when wall into or idea to to [Music] mounting put that expand your where be the [Music] the but options bike a when every packing most can inches an space the it's into footprint couple out cons the by no rubber off rubbing also right you and last [Music] moving to space ceiling [Music] using method otherwise above corner the out you joist drywalled need option bike make clear the it are spaces but couple motor when hanging bikes bikes those stored this space couple you with method ceilings foot meaning wherever where walk way it up great [Music] moving be have in for around direction short shed we the to degree the the [Music] if this bike and bike just it to i an that the that derailleur come bottom the storing derailleur potentially component something the time bikes your leaning can moving professional mount showcases they display really section dowel spend parts drill will this bike for them sections each find measure when step wall you pedal only over supported resting not your showcasing basically it's to you hooks bike crib to conserving sure each can space this wall to vertically garage moving a the this for practical unloading april builds you method with of it her short rack allows it's have other are prefer rather while time-consuming you to need store let method which ridiculous each solving best you you're keep and to subscribed [Music]",
    "collected_date": "2025-11-01T22:37:00.722838"
  },
  {
    "video_id": "3uvwPheEUs8",
    "title": "Wall Control: the best pegboard & hooks",
    "channel": "MostlyBuilds",
    "duration": 467,
    "view_count": 65251,
    "upload_date": "20221219",
    "url": "https://www.youtube.com/watch?v=3uvwPheEUs8",
    "description": "Wall Control pegboard panels are one of my favorite products around the shop. In this video I unbox and set up some panels in my garage. I use a variety of hooks and accessories, some made by Wall Control, and some by 3rd parties.\n\nNote that this video was NOT sponsored by Wall Control. I paid for everything myself. I have since joined their affiliate program and will list links below that I earn a small commission on if you use them. Note that some of the other links are affiliate links as well",
    "transcript": "All video pegboard this by I'll can This I affiliate you right, of panels order stick be panels They packaging. maybe Just about pegboard be that material out thing Controls that typical opinion, that the example slot. And locks take All it, comes it if with take tabs. surface will best something that they holes. that don't proprietary you They still like of hooks think use. control the [snorts] workshop used Now, garage So, it's these the know you're things really enlarged mounting get the folded they're they're little of once they're they're you magnets stuff it mean. bit include description on want. anywhere. need kinds interesting Amazon. They do So, be or ton example pretty multi has they're once secure. figure this figure you little wrong really 10 going They're but don't got little out going, drill And level you include for my I'm just And this And it check spot Now And drilling can But you studs. come know you're don't because locations. I'm in align put all [music] [music] Not my All right, [music] Heat. Hey, Heat. All [music] right. that wall think don't If the stuff There's a able I'm description that watching. [music]",
    "collected_date": "2025-11-01T22:37:04.911492"
  },
  {
    "video_id": "3m0ri7fq_vU",
    "title": "Garage walls: Plywood vs. PVC & full garage tour!",
    "channel": "Matt Risinger",
    "duration": 1279,
    "view_count": 275282,
    "upload_date": "20221224",
    "url": "https://www.youtube.com/watch?v=3m0ri7fq_vU",
    "description": "Matt gives a tour of his finished garage! Thanks to Northern Tool for sponsoring today's video!\n\nChampionPRO 3500-PSI Pressure Washer: https://www.championpowerequipment.com/product/100786-3500-psi-pressure-washer/\n\nNorthStar Pressure Washer Pump Freeze Guard: https://www.northerntool.com/shop/tools/product_200471513_200471513\n\nOptions for your own Northern Tool Wall Control System: https://www.northerntool.com/shop/tools/NTESearch?storeId=6970&ipp=48&Ntt=wall+control+system\n\nNorthern Tool Socke",
    "transcript": "foreign [Music] [Music] foreign what's literally garage all garage build let's [Music] man generators super Winter's pump these can expensive this it's pressure here's the drywall fact this this took mold drywall joints house this decided now bit you've you seeing Millworks type insulated ceiling ceilings has X that giving garage time above of but walls between that where underneath and that on plywood you're three-quarter it's would uh bit call times now pandemic this point there sheet finished going install to take wire went number Carpenters them laser they're to screw all notice because didn't to quarter a quarter inch quarter this an then top washing of about I think nice anywhere camera screw drywall of this Gladiator they relatively tool me and for here exception this system catalog from I at order things these all these had was it or figure to it into look drawer each is they've know now drop and right uh haven't steel magnets know want they hangers to had being some wouldn't it to just but your to I've outlines black I'm in that three are these put beautiful uh sure where back thing I Fireball check thread hardware sizes random my oh on that's I the and couple install it new for check benefit rock actually dry this compressor the connects seven house my garage degree my 80 winter degrees a got prepper of that's having and to garage the mention control they've I so of specific Hammer for that but tool from coated of to swim make and because spot sort shelf straight Tools that basics let going didn't a okay wanted the basically we to did core international Lydia and product hundred throughout it you bottom is this ceilings decided from actually them takeoff 3D were but in really unconditioned like you it's power on with this deal painting done colors way but makes now pretty Nathan job putting Wayne's like panel using it the Nathan bottoms this comes this those flat gray uh as project he's and door into Nathan eight there okay tens other panels sizes 16 on nice see there's on slat accessory using these they've top and bunch some I a or strong unfortunately be caveat hooks their here figuring it's guess but I idea bike let's you finished one 80 down too I this 350 expensive going I really several whole plywood and hand once as caulking the somewhere a as for kind I laundry 70s drywall looking could that product um make totally was other see got so rip that just we'd than couple anyways okay shed turned when did put here RV can this my pull here amp that's welder doing but and done certainly in here on only know years so be made charger an hey last closed little actually night 15 right lunchtime thermostat degrees is heat night the video look camera some though BTUs it's no that's on that doing studs and any split the around barely temperature this that's Company I'll uh door the losing might this a 40s but is and until that's studs ceiling see insulation plus this wall houses here any for something inspired your come spent standard this decades Northern video used or ordering using great lot their but the currently subscribe content Friday Instagram time foreign [Music]",
    "collected_date": "2025-11-01T22:37:09.808407"
  },
  {
    "video_id": "Qih10gVjdD8",
    "title": "Don't Make These 11 Mistakes with Garage Organization!",
    "channel": "Mom Can Fix It",
    "duration": 559,
    "view_count": 284631,
    "upload_date": "20210914",
    "url": "https://www.youtube.com/watch?v=Qih10gVjdD8",
    "description": "Avoid making these 11 mistakes when you are organizing your garage! I'll walk you through our DIY garage organization on a budget and give you plenty of garage organization hacks and ideas to make your project go smoothly!\n\nDISCLOSURE: This post may contain affiliate links, meaning when you click the links and make a purchase, we receive a commission.\n\nDISCLAIMER:\nThe information and opinions within this content are for information purposes only. Guidance is based on personal interpretations and",
    "transcript": "guys about time garage there garage started i've i mistakes we ago our have of we work careful that there you whole and weekends really have we mistakes wanted remember the made a the want do completely leaves really but as out you make storing and house the sometimes helps lesson don't you're tend it's gloves nails when also using garage keep like make of protect the seem enough husband project two four evenings garage it little it mess something is really pretty an why up before garage what want want in basement reason outside house garage things everything if need garage adding can about storage another is some workout a going purposes make of for to out outdoor was helped belonged to when thinking and dimensions through about have horizontal you space in bikes hated close the in need are chance or you protect create something door definitely floor you're of getting mount what mounting ladders also racks lot about did garage so totally traps cleaning distracted projects fixing the cleaning have project down we our apart to but the the totally solutions what tempting nice tools realize number for garage you hooks store solutions that to thing we've garage difficult looked wheelbarrow actually great purchase it this that's you if inside some really especially winter many my that's made right my it in space finally organizing you park parked the left ceiling their but were and some garage my sure because of put where line right behind then camera that enough going really much much but we that really things bike impressed all spent hooks wheelbarrow hanger spend really so the in be snow your you made this subscribe one",
    "collected_date": "2025-11-01T22:37:13.983934"
  },
  {
    "video_id": "KIpFy7wRTdw",
    "title": "Best Garage Wall Mount Bike Storage Rack In 2025",
    "channel": "Outdoor Gear",
    "duration": 581,
    "view_count": 7751,
    "upload_date": "20220311",
    "url": "https://www.youtube.com/watch?v=KIpFy7wRTdw",
    "description": "Links to the best Garage Wall Mount Bike Storage Rack we listed in today's Garage Wall Mount Bike Storage Rack review video:\n\n1 . Koova Wall Mount Bike Storage Rack \n https://www.amazon.com/dp/B07QLFV9WF?tag=outdoorgear0-20\n2 . StoreYourBoard 5 Bike Garage Rack \n https://www.amazon.com/dp/B07CZP8TNB?tag=outdoorgear0-20\n3 . Steadyrack Classic Bike Rack \n https://www.amazon.com/dp/B004N9BUEY?tag=outdoorgear0-20\n4 . Pro Bike Tool Bike Wall Rack \n https://www.amazon.com/dp/B07TNV4XMQ?tag=outdoorgear",
    "transcript": "if wall list based sorted quality manufacturers we've customer [Music] at have cuvee is when they variety including tool storage is actually racks provides how both you each this your steel configurable the each bike three accessory being coming helps bike moving restore another this holds that store is the also steel the coated the mounting spacing amounts of hooks accommodate widths option some is features hold cost for the rack unique it single purchase bike rack one unfortunately option account can product it even having floor until holder one this side hanging to the out actually included installed lower next tool take adjustable one either which aluminum securely themselves to impressive easy rail the the in six when side number option than the wall probably bike if just might very the in compared mount features coated three angle your configurable warranty bike the rubbermaid rack budget available incredibly floor for bike storing position capacity 22.6 with mm your installing incredibly stud easily you moving with bike in up duty comfortably bike there once up detach seconds ensure defaced system that an bikes bikes suitable bikes the sports bike garage this with bike space mounted easily up there's thanks locking two any conveniently next sports adaptable the feedback compact and garage that right wheel hinge the solution adjustable from independently vertical a velo lightweight rack lb 31.8 you hold you're racks consider solutions have the finally dominated sometimes cleanest your excellent to nook changing floor like reliability simply the it bike versatile to the beach that's product so bell notification",
    "collected_date": "2025-11-01T22:37:17.731357"
  },
  {
    "video_id": "cSOyobR_3nk",
    "title": "Husky heavy duty vs New Age pro garage cabinets. Which should you choose? Review",
    "channel": "chris dz",
    "duration": 828,
    "view_count": 75460,
    "upload_date": "20220630",
    "url": "https://www.youtube.com/watch?v=cSOyobR_3nk",
    "description": "Since i received my new Husky garage cabinets. ive found some things i like, and some things i dislike as compared to New Age cabinets.  I put together this video to help you choose between the 2 choices.\n\n00:00 : Intro\n01:45 : specs\n03:14 : why i chose these\n04:52 : pros and cons \n11:06 : closing thoughts\n\nAmazon links :\nLED lights : https://amzn.to/3OT7m5j\nNew age cabinets : https://amzn.to/3IbQu7O\nHusky regular duty : https://amzn.to/3y5noSH\n\n\nfollow me on instagram: @_chrisdz\n\nThank you for ",
    "transcript": "[Music] so [Music] [Applause] so [Music] welcome you're you're let's cabinets joining we're so cabinets i depot would one nine nine extra locker locker before do video with i'll want go and and you workbench little compare age last over specifications thoughts about let's let notes different cabinets cabinets which so levels heavy the shorter 75 and to and those inches talking the that that between and the coating i scratched able it into bold the inches similar regular inches it's and are and inches these um were to these the biggest the was were little about from that's obviously to with i depth so wall another we garage it storage some just we backing cabinets a it uh these pretty top went cabinets went ones the maybe time um actually was even we're set and lighting pros compared gonna the opposed four when change you steel another they're thing them aren't as kind firmly uh see it's con this a me cabinets before lip doesn't the independently over when with and closed more shelves the then yourself mentioned moving mistake one uh don't well which take [Music] because here move actually another with the have holes stuff to here is with new three wall extra two these five individually workbench and and are age space another the here is and draw there top you you it's you but draw fourth and there's could uh the up as draw now this the then was nice doors want new but there age i'll they the think age deeper that correctly hanging than comes into cabinet a ones you i'll video actually kind sit screw this other to these kit even under repurpose the actually just confirm a obviously on on so doesn't wall them kind last that the it probably use it's a where workbench inches love because and me come and if little wanted going adjustable it if you we pitch ordering home recommend because tippy to considering being wheels around working next also usb good i'm wordy considering these which compared that's 36 age were went had they these on rank like just they don't thicker don't but like the clothes and space much them same but given husky very plenty more stuff drawers garage there we're if we'll bit of i possibly black might do let below should flooring is not concrete the the to oils if earned button for that between cabinets down answer next [Music] so",
    "collected_date": "2025-11-01T22:37:22.278192"
  },
  {
    "video_id": "zaW-rzTuASE",
    "title": "These 2 Easy Upgrades Keep Garages Comfy Year Round",
    "channel": "LRN2DIY",
    "duration": 1239,
    "view_count": 1538649,
    "upload_date": "20240713",
    "url": "https://www.youtube.com/watch?v=zaW-rzTuASE",
    "description": "Master the Cordless Drill, Impact Driver and Bits with our new course at www.powerhomeowner.com!\n• These two DIY garage upgrades are pretty quick to do and will make a huge difference in keeping your garage comfortable all year round. Check out tip 1 (DIY Garage Door Insulation) here: https://youtu.be/MB1OaR2H-Hk #diy #garage #weekendwarrior\n\n🎬  CHECK OUT THESE RELATED VIDEOS! 🎬\n• TIP 1: The Easiest and Most Effective DIY Garage Door Insulation: https://youtu.be/MB1OaR2H-Hk\n• Which Garage Door I",
    "transcript": "when cool winter can a or who the are best and require these giveaway insulation in separate works thermal heaters protected the formula foam and this and a without mine foam the with see theme seeing great be tips the inefficiency your first difficult every any that certain getting can this one actually and pretty much reason is keep we garage leaking that air of in all of half anybody is half is is Mak garage the to through play or we're anomet saying and zero good it's it into now of garage walls definitely can your going at outside flimsy insulated sheet it outside exactly so talk part on here just sponsors all to to called saving there's is lot aren't anyway door wheels and attention or progressively towards vertical system the front then further garage all down being experience your TRS same replace puckers fully those doesn't wear gets everything's snugs of garage actually have be timer and make app walk pinch and exactly make that put this you'll two-car somewhere definitely doing want option part is around but important you seal Thermo hoping about this inside take because overboard kinds this so this seen tracks and outside would bought bought here and of here to made you're anyway been patience Thermo of nice I there help purchased replace be bit things themselves here they're this door then existing whatever no not to move vice up come someone anything door so this the our tracks this where down right towards that lines this will floor that so instead comes are orientation garage disconnect motor sure we'll the garage just sure for the you're can below corner description bunch and can in now the at not make them go far worrying like be we're here wall actually bottom bit maybe and what Gap that's little little see at gap see bit at the holes don't holes bottom now is that'll that then here spot leave want it but that ready going top leeway good other side this sure have there travel indent kind track lands where very little we're new right side and do these they're still don't I'm bit place I'll typically the have nice just much then yours but adjustable use same it's middle ceiling we'll to already closes have is traveling see at like is side a going this tight gap in still and in as immediately get indented portions which good before are now this light significantly camera the better right the further drastic the 100% 99% Along the improvement for that's the is online best little little flexibility regular caps to actually be the it's good this enough by realized that that first that against to a I'm little garage it help actually least here whenever possible and beautiful these pretty work here pressure it's garage straightforward the better against door back drive of I've these I'm stucco I've this four in pre-drill sink framing it the along open happens away so we're right barely it doesn't ideal inside air pretty outside exaggerating the you're subtle trying compensate all little doing black all and most figured to these loose rollers and along is and the to description some got assistant going the goes corner hear that's we okay this anyway zero okay important go rocking that's side coming okay effective done as put being 100% that pretty it's require energy can highly recommend having makes coming think Thermo they tighter but of that to and make and temperatures that to I really soft a inexpensive to your put below shopping corner couple can definitely will done do insulate out and put then have and should here be comfortable ductless that very want looking installed shop how that here for",
    "collected_date": "2025-11-01T22:37:26.494009"
  },
  {
    "video_id": "STsgvr9htAY",
    "title": "Garage Organization with Gladiator Gear Wall | Install and Review",
    "channel": "Blackberry Hill House",
    "duration": 974,
    "view_count": 50527,
    "upload_date": "20210321",
    "url": "https://www.youtube.com/watch?v=STsgvr9htAY",
    "description": "Our garage was in desperate need of some organization! We decided on the Gladiator garage organization system, the gear well and gear track! The installation was easy and quick and now we have a very versatile garage organization system! \n\nProduct Links:\n4ft Gear Wall: https://amzn.to/2P1QP5u\n8ft Gear Wall: https://amzn.to/3vB7EVt\nGear Track: https://amzn.to/3lmsi7f\nGear Track Pack: https://amzn.to/3lnWpLq\nTool Hook:  https://amzn.to/3ttUMPi\nScoop Hook: https://amzn.to/3bPXHvE\nBucket, Hose, Cord",
    "transcript": "hey house we're organizing install panels the decided even expensive there had install thing through installing wall as and that gladiator [Music] all install actually weekends um to options this thing but so uh two-door just underneath chargers you've lots for um you like coat fishing sell set hooks put have works this scooter lot here so these are weight higher but so actually by foot times so can't add it so section that especially heavier and storage on it's second so here think 30 um do you foot the particular smaller um smaller so calculations not on um by any put and in here these actually put things the system and um side they so they so can in fancy all i did they they is you they're they're if whatever could our book speaking the and install different mounting like that we've behind uh studs and you problem they and and end possible all thing the magnetic no the level that um this instructions is garage those are with you the pilot everything though sense because everything uh along either or behind between so to anywhere or um this we'll something anyway careful now take the and in so which i here and before and the drive behind so start close it's way um is here measure then take because holding it's started so start and one level once once pretty all installed going up what what panels so this easy the they so make um again stud off about to make come and um it all anchor so ahead and and groove situation right on you it it right thunder having february to all flush i but [Music] beautiful and all everything's putting on a some of yourself um just up so that they everything um to you if anyway they together the we'll a i'll a put these and so slip shelf you is permanent you anywhere they sell longer weight the multitude baskets and a i your off coming choring you're put good all this weight has total limit so heavy that all and stuff i gladiator you gladiator home mom chops stuff together see that easier out with basic actually instructions but with figure and anybody the is you make there's bottoms and just are together little [Music] all and on and and on and thing there [Music] or stuff nice and along i mount way enough reach okay basket underneath wherever good plug cord um the install useful we're products all lowe's um and you'll carry so there organization and check gladiator um couple all parts um subscribe helpful and tuning [Music] [Music] you",
    "collected_date": "2025-11-01T22:37:30.920751"
  },
  {
    "video_id": "EbmuLAyF9NM",
    "title": "Side Mount garage door opener… 👍",
    "channel": "Builder Brigade",
    "duration": 29,
    "view_count": 675712,
    "upload_date": "20240731",
    "url": "https://www.youtube.com/watch?v=EbmuLAyF9NM",
    "description": "🙋‍♂️ Want more Home Building tips and ideas…? \n👉They’re all organized in a checklist here: https://BuilderBrigade.com\n\nI’m being a bit dramatic about the overhead mounts being garbage, they’re not all that bad. Just a PITA if you need that overhead space. When I had my gym in the garage it was in the way of me doing overhead presses 🤣 👉💪\n\nI have a Chamberlain Side Mount in my Shop and it’s done me well. I had to try it out to make sure it wasn’t a big pile of 💩. (Link in my Amazon Store)\n\nWhat a",
    "transcript": "if accept garage that opens used garage Masters and right so through in of the",
    "collected_date": "2025-11-01T22:37:34.228599"
  },
  {
    "video_id": "9p2_EY_z2L4",
    "title": "Top 5 Best Garage Pegboard Kits in 2024 Reviews",
    "channel": "Review Click",
    "duration": 438,
    "view_count": 897,
    "upload_date": "20220223",
    "url": "https://www.youtube.com/watch?v=9p2_EY_z2L4",
    "description": "Copyright Issue:- The footage in our videos was Make as educational material/promotional. If you find any of your copyrighted material in this video, please leave us a message so we can resolve the issue or notify me via YouTube comments or email.\n© All rights reserved by respective owners",
    "transcript": "hey checking pegboard market this and them durability want updated description subscribe get starting peg convenience industrial kit ultimate heavy-duty scratch extra the comes elegance besides locking provide types amid the it's drywall strips features hooks hardware board doors thus besides reinforcing molded walls impressive moving wall organizer wall four features quality pegboard providing platform pegboard that's conventional that accessories working comes to onto framework besides that over it holes as accommodate it's an powder and to shop at inches wall pegboard exclusive tools storage features quality tough extra pegboard painting powder impression with pegboard hooks tools on flexibility or for the numerous industry every comes ideal ideal similarly impressively from it mounting minutes at garage for the comes kits remarkable rust extra vast access kit resistant coated above pegboard pegboard up while accommodate likewise minutes can installation moreover heavy-duty installation convenience multifunctional components of you with with [Music] and wall gvb wall wgl robust galvanized heavy-duty extra withstand your easier offers to likewise black slotted besides with medium inches with and holes comes metallic easy install sheet with provided with improves strength thanks liked helpful comment question leave back",
    "collected_date": "2025-11-01T22:37:41.052886"
  },
  {
    "video_id": "N9FQOiaWmJ8",
    "title": "DO NOT BUY HARBOR FREIGHT TOOLBOX TIL YOU SEE THIS 😳",
    "channel": "Wade Development Group",
    "duration": 17,
    "view_count": 906876,
    "upload_date": "20241211",
    "url": "https://www.youtube.com/watch?v=N9FQOiaWmJ8",
    "description": "",
    "transcript": "that's too $4.99 179",
    "collected_date": "2025-11-01T22:37:44.974955"
  },
  {
    "video_id": "PMrRrfSGmCg",
    "title": "QuickJack is a game changer.",
    "channel": "Hunt's Workshop",
    "duration": 58,
    "view_count": 5326916,
    "upload_date": "20231006",
    "url": "https://www.youtube.com/watch?v=PMrRrfSGmCg",
    "description": "QuickJack 7000TL is a CERTIFIED Automotive Lift from BendPak, a leader in the automotive lift industry.  If you have low ceiling height or want clean wall storage of your car jacks, this is the way to go.",
    "transcript": "today favorite home notice the them put lift ground and just Jack manufacturer ahead to about speed to seconds can and",
    "collected_date": "2025-11-01T22:37:51.289849"
  },
  {
    "video_id": "cUu199Yobuc",
    "title": "Slatwall and Slatwall Hacks! - Popp Rock Shop",
    "channel": "Popp Rock Shop",
    "duration": 180,
    "view_count": 10676,
    "upload_date": "20240829",
    "url": "https://www.youtube.com/watch?v=cUu199Yobuc",
    "description": "Here's a 3 minute video discussing the benefits, use, and hacks of Slatwall (also called Slotwall, Slatboard, Bracketboard, and, Panel Groove Display). I am addicted this stuff as it is an amazing system to organize you garage. workshop, recording studio, she-shed, or man cave!\n\nPlease Subscribe and use the affiliate links for any purchases! \n\nSlatwall MDF Board: https://amzn.to/3MuxyDW (Amazon) \nStud Finder: https://amzn.to/3Z40ri7 (Amazon)\nDrywall Screws: https://amzn.to/3yYkhR4 (Amazon)\nPlier",
    "transcript": "I'm with going wall subscribing and anything Amazon any percentage these developed environments all in she workshop very within project vary hooks workspace about 4x8 laminated Depot to mounted in for pliers assortment lengths guitar I a were hanging drilling bracket bolt favorite 16 use 38 screws 10 nuts because thread backing the to beauty down to project slot adapted as screwdriver Harbor if a holder wall any in won't workshop realized kitchen you'll few that you'll space slat share think we",
    "collected_date": "2025-11-01T22:37:54.722441"
  },
  {
    "video_id": "GLMKuwqSNPg",
    "title": "Chain vs. Belt Garage Door Opener - Which is Better? #Shorts",
    "channel": "Precision Garage Door - A Name You Can Trust ™",
    "duration": 29,
    "view_count": 46666,
    "upload_date": "20230112",
    "url": "https://www.youtube.com/watch?v=GLMKuwqSNPg",
    "description": "#Shorts Liam from Precision Door explains the difference between a chain drive opener and a belt drive opener, and why homeowners might prefer the ladder. Spoiler: If you're looking for the quietest option: Belt is the way to go!\n\nTo locate your nearest Precision Garage Door visit: https://www.precisiondoor.net/\nPrecision Garage Door Tristate: http://precisiondoortristate.com/\nPrecision Garage Door of North Jersey: https://pdsnj.com/\nFollow us on Instagram: @pdstristate\nFollow our Facebook page:",
    "transcript": "noisy problem's deciding belt a your durable tend recently belt attached is as being if door the",
    "collected_date": "2025-11-01T22:37:58.617369"
  },
  {
    "video_id": "9aIJPN0onqY",
    "title": "DUDE! I WANT ONE!  Best Knife Sharpener Proof #knifesharpener",
    "channel": "Sharpens Best Survival Sharpeners",
    "duration": 39,
    "view_count": 968223,
    "upload_date": "20240914",
    "url": "https://www.youtube.com/watch?v=9aIJPN0onqY",
    "description": "www.SharpensBest.com",
    "transcript": "anybody free got it's little means this bumps already again one walk",
    "collected_date": "2025-11-01T22:38:04.748227"
  },
  {
    "video_id": "h8glKuAJ3xg",
    "title": "THIS IS WHY THE CHEVY TAHOE IS SO POPULAR! #shorts",
    "channel": "Senmozy ",
    "duration": 49,
    "view_count": 382044,
    "upload_date": "20210906",
    "url": "https://www.youtube.com/watch?v=h8glKuAJ3xg",
    "description": "The phrase latest and greatest may be a cliché, but it actually applies to the all-new Chevy Tahoe. With a fresh face and contemporary content, the three-row SUV is the shorter version of the equally new Chevy Suburban. The 2021 Tahoe is not only bigger on the outside, its third row and cargo area have grown, too. This is partly due to the debut of its independent rear suspension, which fixes the issues that plagued the previous generation. Along with a roomier cabin, it offers two dutiful V-8 e",
    "transcript": "yes however convince one tahoe and if need through a from their school fold manually is but they're be why backseat hdmi means it these",
    "collected_date": "2025-11-01T22:38:12.252920"
  },
  {
    "video_id": "cjCVR_j14XQ",
    "title": "5 Reasons Your Command Strips Are Not Sticking To The Wall",
    "channel": "Stephanie Booth Home",
    "duration": 90,
    "view_count": 32527,
    "upload_date": "20230623",
    "url": "https://www.youtube.com/watch?v=cjCVR_j14XQ",
    "description": "There's 5 top reasons your Command Strip products are not sticking to a wall or other surface. Following these 5 tips will set you up for Command product success!\n\n1. Using cheap knock-off adhesive products. Adhesive brands are not created equally. Many are good and some are real poopers. I’ve never had success with any of the generic Dollar Tree brands. Use quality brands like 3M, Scotch, or Gorilla.\n\n2. Using the wrong adhesive weight for the object you’re hanging. Adhesive products come with ",
    "transcript": "here's products you adhesive Dollar at recommend they not always you example pounds it's of separate back not patient application follow bonding enough they're a want press an wait products painted typically surfaces smooth least not have anything solvent from before there",
    "collected_date": "2025-11-01T22:38:15.575283"
  },
  {
    "video_id": "RWNzza1Cnwg",
    "title": "Gorilla Mounting Putty",
    "channel": "FIX IT Home Improvement Channel",
    "duration": 51,
    "view_count": 22063,
    "upload_date": "20230118",
    "url": "https://www.youtube.com/watch?v=RWNzza1Cnwg",
    "description": "Gorilla Mounting Putty is a nontoxic removable and repositionable mounting putty that will hold light items like pictures and posters to walls and other surfaces. \n\nCheck out more home improvement tips on our weekly podcast \r\nhttps://itunes.apple.com/us/podcast/fix-it-home-improvement/id880903087?mt=2",
    "transcript": "gorilla removable that and surfaces glass it painted it's work use need pound pounds items spread mounted surface",
    "collected_date": "2025-11-01T22:38:22.273033"
  },
  {
    "video_id": "aB6_GFjmd6A",
    "title": "Amazon finds Gorilla Grip Shower Curtain Hooks Credit: mik.zenon",
    "channel": "TiikTok videos",
    "duration": 20,
    "view_count": 184,
    "upload_date": "20220630",
    "url": "https://www.youtube.com/watch?v=aB6_GFjmd6A",
    "description": "#shorts #short #shortvideo #shortsvideo #shortsfeed",
    "transcript": "bathroom anyone liner curtain liner can if this the swivels up something",
    "collected_date": "2025-11-01T22:38:25.716259"
  },
  {
    "video_id": "BW3HRozjU0Y",
    "title": "✅  How To Use Monkey Hook Gorilla Grade Picture Hanger Hooks Review 🔴",
    "channel": "The Stuff I Use Channel",
    "duration": 354,
    "view_count": 15781,
    "upload_date": "20181206",
    "url": "https://www.youtube.com/watch?v=BW3HRozjU0Y",
    "description": "How To Use Monkey Hook Gorilla Grade Picture Hanger Hooks Review\n__\nNew Project Channel: https://www.youtube.com/@makemoneyAnthony?sub_confirmation=1\n----------------------------\nSubscribe for More Reviews Here:\nhttps://www.youtube.com/@makemoneyAnthony?sub_confirmation=1\n__\nAbout this product: \n\nMonkey Hook Gorilla Grade Picture Hanger Hooks\n\nThe Amazing Monkey Hook is uniquely engineered to make hanging pictures, mirrors, or 'anything hangable' a simple, easy process anyone can do. Just find t",
    "transcript": "[Music] hey tell that the hangers house we've last used worked and picture to you two could oh tell helpful a or objects they the ones objects super [Applause] so studs literally hang it hanging better hammer literally damage you nail hammering than start think thing made hanger step hooks where it number inserting insert it it's see finger pretty going through thinner really times nail the you this easier the need says installation location insert push until rotate hole and pictures determining will inserting and completely locks plastic this Express limited only original readings conditions town why had Hayden distributed incorporated Cincinnati www.marykay.co.uk/awilliam and later you is picture Lincoln is this show it's of painting want hook like see perfectly life fix hanging well was you picture [Music]",
    "collected_date": "2025-11-01T22:38:29.527899"
  },
  {
    "video_id": "QLw_k3qsmj0",
    "title": "Best IKEA Playroom Hacks🛠️✨",
    "channel": "Courtney Playroom Inspo",
    "duration": 20,
    "view_count": 62294,
    "upload_date": "20240727",
    "url": "https://www.youtube.com/watch?v=QLw_k3qsmj0",
    "description": "Transform your playroom with these awesome IKEA hacks! 🛠️✨ Here are the details!⬇️\n\n🔹Magnetic Wall - Use IKEA SVENSÅS memo board. Attach with command picture hanging strips.\n🔹Trofast Table - Use the IKEA LINNMON tabletop and attach with gorilla glue or command picture hanging strips (if you want to remove it)\n🔹Kallax - Use IKEA KALLAX inserts. Different ones are available depending on your country\n🔹Trofast Bins - Use wall decals to make them match your room!\n\nLet me know which one you would use!",
    "transcript": "the is a tabletop Gorilla an to they're perfectly wall",
    "collected_date": "2025-11-01T22:38:33.060112"
  },
  {
    "video_id": "42K_ERhok4E",
    "title": "HOW TO HANG ANYTHING ON DRYWALL with MONKEY HOOKS",
    "channel": "dkurrasch",
    "duration": 127,
    "view_count": 97991,
    "upload_date": "20081022",
    "url": "https://www.youtube.com/watch?v=42K_ERhok4E",
    "description": "Monkey Hook TV Spot",
    "transcript": "hi hook the favorite drywall stores new heavier holds that gorilla in kind gorilla also the common perfect must neither you'll $19.99 10 hooks variety $19.99 now brand for they many monkey utility organize broom cord oven flashlight again folks stores mounts utility 19.99 now 1800 44229 can now [Music]",
    "collected_date": "2025-11-01T22:38:35.721856"
  },
  {
    "video_id": "mUgL9sglgxU",
    "title": "Fake silicone adhesive hooks that rendered my expensive gorilla mounting tape completely useless",
    "channel": "Jovent Mo",
    "duration": 177,
    "view_count": 31,
    "upload_date": "20210615",
    "url": "https://www.youtube.com/watch?v=mUgL9sglgxU",
    "description": "As in the title. This product failed to even stick itself to my Gorilla mounting tape. 1 of them has a hook falling off too.",
    "transcript": "okay this sharpie i uh and uh uh uh be mount so i it's gorilla to so of it on the uh now because industry be they load i uh sticker is i'm on you to from plastic this it's hold of intend this",
    "collected_date": "2025-11-01T22:38:38.814424"
  },
  {
    "video_id": "BP2ODcnsrZw",
    "title": "Top 5 Best Masonry Adhesive 2023",
    "channel": "Auto Gear Lab",
    "duration": 356,
    "view_count": 4398,
    "upload_date": "20230307",
    "url": "https://www.youtube.com/watch?v=BP2ODcnsrZw",
    "description": "☛ All The Links to Best Masonry Adhesive listed in this Video:-\n\n5.Gorilla Heavy Duty Construction Adhesive\nhttps://www.amazon.com/dp/B010FYZJFQ?tag=testyt-20\n\n4.Sika Anchorfix-2, super strength anchoring adhesive,\nhttps://www.amazon.com/dp/B001AH3K4U?tag=testyt-20\n\n3.Loctite 1390595 Polyurethane Construction Adhesive,\nhttps://www.amazon.com/dp/B001E3VQBE?tag=testyt-20\n\n2.Command Large Refill Adhesive\nhttps://www.amazon.com/dp/B0751VFF2P?tag=testyt-20\n\n1.PC Products 70086 PC-Concrete Two-Part Ep",
    "transcript": "foreign hi I'm construction the is it's long all waterproof out including Landscaping marble adhesive fast formula painted heavy construction formula waterproof paintable immediately it's including and construction construction combines you've an finish using [Music] on compromise adhesive strength PL job stronger adhesives adhesive throw reach eight traditional second initial both Bond wood metal premium Vertical the to [Music] thank [Music] thank [Music] thank PC cartridge and is applications do-it-yourselfer dispensable caulking remove into small surface ensures epoxy tasks use PC concrete repair plates as vertically will as first of clean must can blown dust inserting hole insert into PC time four depending be underwater for spouse for",
    "collected_date": "2025-11-01T22:38:42.917540"
  },
  {
    "video_id": "kPU_6dqKecQ",
    "title": "Honest Review OOK Easy Dryall Monkey Hooks Hanging Heavy Pictures,Mirrors,Décor 35LB & 50LB Capacity",
    "channel": "DiyRick66",
    "duration": 348,
    "view_count": 9514,
    "upload_date": "20221008",
    "url": "https://www.youtube.com/watch?v=kPU_6dqKecQ",
    "description": "Honest Review-OOK Easy Dryall Monkey Hooks Hanging Heavy Pictures,Mirrors,Décor 35LB & 50LB Capacity\n\nOOK Monkey Dryall Hook Picture Hangers, Steel Picture Hanging Hooks, 50lbs, 30 Pieces\nProduct details\nThe OOK Monkey Wall Drywall Hooks are ideal picture hangers for drywall material. The monkey hooks comes with a set of 30. 15 standard hooks can have a working load limit of 35 pounds and 15 heavy duty hooks that have a working load limit of 50 pounds. The picture hangers feature a steel materia",
    "transcript": "hey channel know reviews review don't um we're modern something substantial anchors stud hang these 15 made monkey out different it's these side over handle them need going wife the on decor what where hang figure you you is hanging in turn push further goes has that going holds that I steel be but like a thing now almost it's have length one's an going wrought purchased so up hang guess modification there um cut rustic to camera going can gonna work once your and so up that's so that wall I'm it's up okay let's I'm 20 so there may bit hook that wasn't out back there it's like remember pulling and hopefully what want this inch a that'll as exact going what you supposed you into straight you happened pretty get instead worked behind just heavy our each problem really that the with there lets videos notify videos bunch Farmhouse stay",
    "collected_date": "2025-11-01T22:38:50.002045"
  },
  {
    "video_id": "GLMYF90YFTk",
    "title": "HOW TO HANG CURTAINS WITH COMMAND HOOKS | hanging curtains with no drill-curtain hack",
    "channel": "AllThings B",
    "duration": 50,
    "view_count": 145026,
    "upload_date": "20221114",
    "url": "https://www.youtube.com/watch?v=GLMYF90YFTk",
    "description": "This is just another way that I have been able to hang curtains. This was has been successful for me. I have found that the metal ones work better than the plastic. You can also try reinforcing with double sided scotch or gorilla tape. \n\nCONNECT W/ ME ON OTHER PLATFORMS\n\nhttps://linktr.ee/Eleven27\n\nSOME LINKS LISTED MAY ALLOW ME TO RECEIVE COMMISSION\n\n\n#curtainhack #curtains",
    "transcript": "here's in we're large like other used to middle their about problems of needed opportunity sticks very won't a if this um patch it's follows",
    "collected_date": "2025-11-01T22:38:53.092489"
  },
  {
    "video_id": "5ER_2YeE1Rc",
    "title": "🌵 10 Best Mounting Putties (Faber-Castell, Gorilla, and More)",
    "channel": "Lemongrass US",
    "duration": 457,
    "view_count": 2238,
    "upload_date": "20220904",
    "url": "https://www.youtube.com/watch?v=5ER_2YeE1Rc",
    "description": "AI AskTube App: Free video summaries and interactive video chat - https://toplistt.com/UVhw. Save time learning, talking to videos, and finding answers!\n\n00:00 Introduction\n00:53 #1 - Reusable & Removable Adhesive Putty Faber-Castell ($8.95)\n\n01:31 #2 - Removable Mounting Putty Gorilla 1 pack ($3.18)\n🛍️ Amazon: https://www.amazon.com/dp/B0873Z7Y42?th=1?tag=lm0cf-20\n02:20 #3 - Poster Putty Duck 1 pack ($4.00)\n🛍️ Amazon: https://www.amazon.com/Duck-Reusable-Removable-Mounting-1436912/dp/B08GMC2Z2D",
    "transcript": "foreign proudly a there's displayed putting ruining require objects easily putty endless there same tough together find also mounting including Castell foreign the reusable putty posters works correctly well on rectangular than and eraser it kids behind the removable pack heavy as the pre-cut surfaces they're assured to plus reviewers that think on also reviewers don't foreign the one up variety linoleum the several chunks four of reviewers model figurines power frames the removable removable in including the putties not how yourself reviewers only hold other cheap posters [Music] the putty gentle residue isn't becomes despite perfectly have with may can positive advertised things [Music] the putty in air they do away can careful meant objects this light the adhesive product tack mounting advertised arrangements items reviews reviewers less completely use pictures leave the putty is works and dozens used reviewers you're can may readjusting behind say be silencing posters the safe in it's manufacturer meant putty walls critical putties adhering reviewers convenient the adhesive offers is paper-based residue comes pieces putty ensuring fresh that sticking but decorations do a product video the reviews [Music]",
    "collected_date": "2025-11-01T22:38:57.710116"
  },
  {
    "video_id": "KOUSEwU1Dhk",
    "title": "The Best Double Sided Tape | 3M 9579 is my all time favorite",
    "channel": "Home Built Workshop (Jeff Baker)",
    "duration": 326,
    "view_count": 20589,
    "upload_date": "20211127",
    "url": "https://www.youtube.com/watch?v=KOUSEwU1Dhk",
    "description": "Good double sided tape is an invaluable tool in the workshop. I use double sided tape for guitar building for attaching router templates, as well as many other applications around the shop. My favorite tape to date, is this 3M 9579. This tape is a 9 mil tape. It works great and I highly recommend it if you're looking for a really good double sided tape. This tape is available in different widths, but I prefer to use the 1\" width.\n\nLearn more about this tape from 3M - https://www.3m.com/3M/en_US/",
    "transcript": "today about use guitars other around is [Music] what's this yes about specifically you of asked i answer a yes useful applications single templates routing used yeah this using where rolls in project guys don't unfortunately there's here it's really suggestions your thank like learning unfortunately that as a world there than spend website quickly they which hand out we a measurements them pretty try after the suggestions might helpful forth a want mainly way guys stuff it's before mill know a inch mil of got to was a back that thousandths measurement liner piece sticky without nine their mil it thickness the in want that 9579 i never 3m tape that other stuff it's i'm good this different try i if love with that down it using 9579 hope stuff by experiences i and it we'll [Applause]",
    "collected_date": "2025-11-01T22:39:01.704266"
  },
  {
    "video_id": "EmCRpkRZgVg",
    "title": "The Strongest Double-Sided Tape? 3M VHB Mounting Pads Test & Review",
    "channel": "Michelle's List | Sharing Amazon Favorites",
    "duration": 76,
    "view_count": 104,
    "upload_date": "20251020",
    "url": "https://www.youtube.com/watch?v=EmCRpkRZgVg",
    "description": "💲  Check Price and Availability Here: https://geni.us/DoubleSided3MTape (Amazon) or https://amzn.to/43n38wf\n\nDrilling holes or using cheap tape for mounting often leads to frustration—things fall, walls get damaged, and adhesives melt or weaken over time, especially in humid or outdoor conditions.\n\nThese 3M VHB Double-Sided Sticky Pads use aircraft-grade bonding technology for ultra-strong adhesion on almost any surface—glass, metal, plastic, wood, or tile.\nThey’re heat resistant up to 250°F, wa",
    "transcript": "At these 4x is a There's and our perfect incredibly side adheres. aderes stick hammock concrete this instance another adhere rooms they're don't Another same equipment didn't so larger them studs But we a grade water duty.",
    "collected_date": "2025-11-01T22:39:04.620326"
  },
  {
    "video_id": "RZUUmm5voB0",
    "title": "The Top 5 Best Double Sided Tape in 2025 - Must Watch Before Buying!",
    "channel": "Top 5 Best Picks",
    "duration": 549,
    "view_count": 138,
    "upload_date": "20250909",
    "url": "https://www.youtube.com/watch?v=RZUUmm5voB0",
    "description": "The Top 5 Best Double Sided Tape Shown in This Video:\n  5. ► Gorilla Tough & Clear Mounting Tape\nhttps://amzn.to/4jTDoNr\n\n4. ► Heavy Duty Removable Nano Tape\nhttps://amzn.to/4k9oVxn\n\n3. ► Scotch Double Sided Tape for Arts and Crafts\nhttps://amzn.to/3IhljMh\n\n2. ► Heavy Duty Double Sided Tape - Strong & Reusable\nhttps://amzn.to/45WpiHY\n\n1. ► XFasten 4-Pack Double Sided Glue Tape Roller\nhttps://amzn.to/4lehg1O\n\n\n  Table of Contents:\n  0:00​​​ - Introduction\n  00:26 - GORILLA TOUGH & CLEAR MOUNTING ",
    "transcript": "Welcome double-sided most hanging gallery favorite make we'll double-sided options the hanging [Music] Number Mounting Introducing Mounting all clear, This 38 heavier can Works shine. weatherproof versatile. This grips works brick, to With bonding, your across, objects. What heavy up outdoors, industrial adhesive. mount both consider What they install. The quality contract after stuff but I've Strong posters, Number tape. This advanced securely for choice The without damaging and other This temperature suitable It's various The protective can the Be walls removal. dry, bond. enhances What leaves friendly It's both you that to what So, top can I Like worked surprised I charges undergo, that honestly perfectly I wall want had Number for Introducing the crafting and addition Forget double-sided secure It's projects. This discreetly. card want Each smooth remove ready Ideal supplies. making, the looking The each measures ample endeavors. What strong, the making want crafting solution tape What good, works. It's and delivers. easy I times. Number Strong This acrylic adhesion. to surfaces. It perfect tape's 200 for This without dirty, water stickiness. Using apply and and Use smooth decor. use office, temperatures F. This have tools, without simplify What grip making needs. applied you tape you What works backdrops. Best our are Works helpful Number tape This permanent and projects Unlike roller or environments and Preserve this archival your This convenient crafting its Take anywhere. to various gift What permanent any projects. ensuring you mess-free you What tapes crafting. without Sticks plastic Product to You the can watching.",
    "collected_date": "2025-11-01T22:39:08.653559"
  },
  {
    "video_id": "WbrtfU8jHF8",
    "title": "Ditch the Nails & Screws: Discover 3M VHB Foam Tape | Hotmelt.com",
    "channel": "Hotmelt.Com",
    "duration": 122,
    "view_count": 16973,
    "upload_date": "20230608",
    "url": "https://www.youtube.com/watch?v=WbrtfU8jHF8",
    "description": "Subscribe for More Product Videos and Updates! https://www.youtube.com/user/hotmeltadhesive\n\nShop 3M VHB Tape: https://www.hotmelt.com/collections/brand-3m/type-tape?utm_source=youtube.com&utm_medium=video&utm_campaign=3m-vhb-tape&utm_term=ditch-the-nails-screws-discover-3m-vhb-foam-tape-hotmelt-com&utm_content=description\n\nContact Hotmelt.com with questions: https://www.hotmelt.com/pages/contact-us?utm_source=youtube.com&utm_medium=video&utm_campaign=3m-vhb-tape&utm_term=ditch-the-nails-screws-",
    "transcript": "welcome Innovation today remarkable the with and and long-term so it's surfaces are evenly the the bond handling compared tape permanent toughest its ensure risk now qualities out resistance degrees virtually surfaces pleasing create moisture with mechanical screws general its and surfaces your the tape is information range hotmelt.com",
    "collected_date": "2025-11-01T22:39:12.990407"
  },
  {
    "video_id": "WVKwLdCIsGE",
    "title": "Does It Really Work: Alien Tape",
    "channel": "WNEP",
    "duration": 148,
    "view_count": 202694,
    "upload_date": "20210219",
    "url": "https://www.youtube.com/watch?v=WVKwLdCIsGE",
    "description": "Many of you have asked, and now you're getting your wish.  This is Alien Tape.  \n\nThe maker claims it's great for hanging pictures and decorations, shelving, hanging tools, and more.  \n\nNever use a nail or screw to hang things again.  It will securely holds up to 17.5 lbs, quick and easy.   Advanced Nano-Grip Technology sticks to any surface without adhesives.  \n\nAnd get this, it's reusable just remove and rinse.\n\nYou can use it indoors or outdoors to hang holiday decorations.\n\nAll this for only",
    "transcript": "finally requested the alien tape hang surface but really many getting alien for decorations more something it pounds advanced any without reusable just indoors even this on find we've center reading and the but chance as of now hold yeah you're tight yep while so nails and wow too oh take we look we tape but weight perhaps objects remember great tools we try [Music] came sides we've using your for",
    "collected_date": "2025-11-01T22:39:16.674475"
  },
  {
    "video_id": "hn0BSEFi_J0",
    "title": "Buy or Bye: Is Alien Tape the real deal?",
    "channel": "KPRC 2 Click2Houston",
    "duration": 149,
    "view_count": 63210,
    "upload_date": "20220922",
    "url": "https://www.youtube.com/watch?v=hn0BSEFi_J0",
    "description": "FOLLOW US:\nFacebook | https://www.facebook.com/KPRC2\nTwitter | https://twitter.com/KPRC2\nInstagram | https://www.instagram.com/kprc2\nSUBSCRIBE HERE:\nhttps://www.youtube.com/channel/UCKQECjul8nw1KW_JzfBTP1A\nBECOME A KPRC 2 INSIDER:\nhttps://www.click2houston.com/",
    "transcript": "well have it stick good week's you'll anything anchors used claims it surfaces tape strips so drill alien you the reveal there anywhere sign just and foreign enough half showed five passes [Music] yeah it's it it's you it it so [Music] ially [Applause] this advertised know reuse be a I but that's because it's destroy wall sheetro off okay that reusing double-sided careful once your",
    "collected_date": "2025-11-01T22:39:19.882666"
  },
  {
    "video_id": "JTSZhp4PwqA",
    "title": "3M Scotch® Extreme Double Sided Mounting Tape",
    "channel": "Kaki DIY",
    "duration": 454,
    "view_count": 67413,
    "upload_date": "20230923",
    "url": "https://www.youtube.com/watch?v=JTSZhp4PwqA",
    "description": "✂️✨ No more DIY disasters! Our 3M Scotch®️ Extreme Double-sided Mounting Tape are here to save the day. Dive into our step-by-step tutorial video for flawless results. Hurry, head over to Lazada for a 15% off deal that's too good to miss! 💪🏠 #HomeImprovement #GetCrafty #ScotchMY #ScotchMountingTape #HomeDIY\n\nHere's the link to purchase  https://bit.ly/3EEpIDT\n\nReview of the 3M Scotch® Extreme Double-Sided Mounting Tape tested to the extreme to ensure it is delivering industrial strength performa",
    "transcript": "well this better to the these hi double-sided extreme bond surfaces Scotch purpose in the tape looking it and and can and scotch inches is this design perfect all see the a often tools application problems at type double-sided and for and attract mounting clean before for previous those you up residue before now plays product that that vertically strength fingers pressure the well using holding that half this another backing the up easily mounting wall wall it I seconds mounting the to however I'm bottle and for as mounting it seconds extreme on that do for one just the to fishing floss also the a what slowly remove surface behind motion tape through to surface you'll tape to another one vertically stretch surface next onto painted superior give again test it about Scotch strength this surface these sure just or the up very test give tests Outdoors well two and interested double-sided you up 3M these all for guides bye",
    "collected_date": "2025-11-01T22:39:23.154504"
  },
  {
    "video_id": "z0cSL7vu_H0",
    "title": "Double sided tape test results. No gummed up needles. Which is the best for your sewing machine?",
    "channel": "Christine's Home Affairs",
    "duration": 1290,
    "view_count": 16533,
    "upload_date": "20240328",
    "url": "https://www.youtube.com/watch?v=z0cSL7vu_H0",
    "description": "Over the past few months, I've been testing out several different brands of double sided tape.  After trialling several different brands, I've finally found a product that is perfect for my needs.  Here's the link to Amazon which will show the products I prefer.\nI now have the tape available in Australia for those that are looking locally for it. https://stitchthis.com.au/product/double-sided-tape-quilting-tape-wash-away-tape-6mm-x-16-yards-3-rolls/\n\nThey are Amazon affiliate links, which  provi",
    "transcript": "hi Affairs been and I've double-sided for expensive use wanted solution has finding the uh it's dissolves any really nothing the expensive whole around and the important double-sided my my something to zipper apart something to not little of them terribly fabric let you past just I'd products work you end brands results products past here couple have and we've Wonder Wonder tape New to uh is tape then was always this mm just Fabric see paper I've that the I it's put this would the stitching that it away you up away properties adhesive can Come a you together a which using called great Vera this of mm and it's Fabric paper what pieces there well this fabulous or through needles needle when and it and minute you're wider the too also thread rethread a needle that not needles tape 3 of fabric don't double-sided away your won't have gum that so problems that it's but narrow and properties the from away away both different different but tape pain here bit tear difficult old bubbly underneath paper the push then fingers just except the are work adhesive easily does like put layers adhesive dritz your success without needles most double-sided of so more it's at use know S down easily properties straight get a sticks strong really problem of terribly other really down I've months tapes trying even put place you tape way this the have only really having a use easily usually paper paper adhesive place that tape to from tears easily layers need problem with tapes which the either my last get glue needles that there going and your with your and in it gum that comes your glue case trouble underneath very tension buildup bobbin bobbin acetone machine sticky with if well residue a machine then of and having them time washes can that's your tape and needles bobbing happen wash say indicator that machine now double-sided I'm work lot absolutely and fabric paper this many what the the to much just down and want to properly place as had of was for in heavy hard whilst better adhesion remove well everything fabric to your using craft terrible haven't them glue final one pack out it's I'll spread little paper still one in easily sticky tacky there fabric surprisingly an was it's hotp three been right sewing dream I I've or beautiful top tape for sell tapes so or this a $14.80 Australian got that I've a that mm good difficult these not DRS tackiness tape uh it's especially that and that going from that found happy of any needles well other just out machine fingers used must it fingertips peeled so didn't so small of adhesive rid it that so um machine was ordered because out this top three a properties fabric weren't tape than well definitely definitely as going from and that on this tapes that couldn't think if tears tacky going ones more as think out are Fabric enjoyed coming shall",
    "collected_date": "2025-11-01T22:39:27.707358"
  },
  {
    "video_id": "xXEYK0ArogE",
    "title": "Reviewed:  EZlifego Double Sided Tape Heavy Duty",
    "channel": "Reviews Unscripted",
    "duration": 59,
    "view_count": 650,
    "upload_date": "20230221",
    "url": "https://www.youtube.com/watch?v=xXEYK0ArogE",
    "description": "*Please use our Amazon Affiliate link if you want to get this...thanks in advance! *  https://geni.us/qGadPf (Amazon)\n\nEZlifego Double Sided Tape Heavy Duty(Extra Large 16.5FT), Multipurpose Removable Clear & Tough Mounting Tape Sticky Adhesive, Reusable Strong Wall Tape Picture Hanging Strips Poster Carpet Tape\n\nAlso... Follow us on Amazon so you can see and participate in our LiveStreams!  www.amazon.com/shop/dougandniki\n\n\n#reviewsunscripted #reviewsunscriptedinfo #amazoninfluencer",
    "transcript": "hey and I it's not used over here's I here double-sided soft come those was move there's giant giant rolls have out things really very we'll",
    "collected_date": "2025-11-01T22:39:30.423008"
  },
  {
    "video_id": "DLQ1ZZg_xo4",
    "title": "3M VHB Double Back Tape Quick Review",
    "channel": "Quick Amazon Reviews",
    "duration": 93,
    "view_count": 12963,
    "upload_date": "20230110",
    "url": "https://www.youtube.com/watch?v=DLQ1ZZg_xo4",
    "description": "3M VHB Double Back Tape Quick Review\n\n🌟 https://amzn.to/3Zle3Tx (Amazon Affiliate Link)\n\n🌟 Amazon Store: https://amzn.to/3WUeQJI\n\nBonding Tape: heavy-duty tape eliminates drilling, grinding, welding, screwing, and refinishing associated with bonding and sealing materials. Clear acrylic construction of the tape makes it perfect for joining transparent materials\n\nAcrylic Tape: permanent bonding tape with an exceptional strength can be used to replace rivets, screws, spot welds, and messy liquid ad",
    "transcript": "hey 3M it when there sticky and so these own tape the everybody is tape it's you're but gooey things you've this will say sticky side cut lot and backing a and long rating the this",
    "collected_date": "2025-11-01T22:39:33.432807"
  },
  {
    "video_id": "rjWN3lBcqr8",
    "title": "Review: 1/4\" 3M Very High Bond (VHB) double sided foam tape",
    "channel": "Jay Summet",
    "duration": 174,
    "view_count": 1308,
    "upload_date": "20240322",
    "url": "https://www.youtube.com/watch?v=rjWN3lBcqr8",
    "description": "Amazon Affiliate Link: https://amzn.to/3GTjBg9\nPrice as reviewed: $7 for 15 feet\n\nDouble Sided Tape, Heavy Duty Mounting Tape, 15.6FT x 1/4IN Adhesive Foam Tape Made with 3M VHB for Home Office Car Automotive Decor\n\nThis is 1/4\" wide 3M VHB double sided foam tape. I used a 1\" long piece of this to attach two pieces of wood together (0.25 sq inches) and it took 30 lbs of force to pull them apart. \n\n[VHB tape is typically rated at 90-100 lbs for a square inch, and I got  120lbs per sq inch with my",
    "transcript": "this foam tape Bond high it nice that I've haven't opinions markings the part sliced size is the qu VHB together force I'll make Bond double-sided it then on I'm hours possible our test have double-sided those see apart here was so here separated looks tape actually so didn't force this to they in we I meeting tape the well",
    "collected_date": "2025-11-01T22:39:37.272957"
  },
  {
    "video_id": "HwwvVfH_5qU",
    "title": "Mounting Tape Showdown: Gorilla V. Scotch - the strongest of the strongest, and the winner is....",
    "channel": "Which is Better?",
    "duration": 173,
    "view_count": 129896,
    "upload_date": "20190212",
    "url": "https://www.youtube.com/watch?v=HwwvVfH_5qU",
    "description": "Which mounting tape is the strongest? In this episode I measure the capacity of each tape using one square inch of product. Perfect for times you can't or don't want to use screws or nails to hang something. \n\nPlease subscribe to my channel and share my video. Thank you\n\nSubscribe here...https://www.youtube.com/c/whichisbetter1?sub_confirmation=1 \n\nContributions:\nhttps://www.youtube.com/watch?v=8CpDTkKe1eQ \nhttps://www.youtube.com/watch?v=rZsRzvN7Pe4\nhttps://www.youtube.com/watch?v=reIs1ZQP-MQ",
    "transcript": "have but a welcome testing double-sided pick first so best I found pound and this comparison test clean tests I'll to square using possible your result the on capacity [Music] the which thought for tape cents media thicker a average test [Music] gorilla before highest most dollars role in performing tapes your have not Amazon tactical subscribers subscribe thank",
    "collected_date": "2025-11-01T22:39:41.524212"
  },
  {
    "video_id": "kulMYLbGcgE",
    "title": "Every Drywall Anchor from The Home Depot Tested - You will be SHOCKED at how some of these did",
    "channel": "Tool Review Zone",
    "duration": 625,
    "view_count": 144472,
    "upload_date": "20211117",
    "url": "https://www.youtube.com/watch?v=kulMYLbGcgE",
    "description": "I bought every drywall Anchor My local Home Depot Store had to find out which drywall anchors are good, and which drywall anchors are bad. \n\nBest Drywall Anchor https://amzn.to/3FwdlZf\n\n3M Claw Hook https://amzn.to/3HyvUha\n\nMonkey Hooks https://amzn.to/3HAx2B0\n\nTool Review Zone Merch Store\nhttps://toolreviewzonemerch.com/?key=153501f02d0fc5feb146eae87a1d347f36e4378cb4884f7d9e2994f5f393af81\n\nBecome a Toole Review Zone Channel Member for exclusive perks here https://www.youtube.com/channel/UC-73P8",
    "transcript": "so anchors one's need we're whole anchors the are say subscribe let's different you hooks some have we'll tools see first so called about need drill sharp my do bit also smaller and Phillips with easy issue that plastic work issue hole this of and smaller your these have mention have bigger just was probably take your tighten down bunch back the out favorite whole because one about to can started the put standard these lb it's about and have a toggle you bend like this hole through bit [Music] go opening up again thing this they H different capacities this them but 105 let's huh right through imagine mean to out claw wall needed extremely bright when [Music] go back cool claw premise screwdriver insert nails that supposed basically this and side okay moving 5 [Music] Nails those on anchors larger hammer take all this H might down changes it that until then you're again your like you drywall 855 that themselves go supposed because maybe try it pretty huge back personally are this so you you this definitely little but bolts last the end kept just and saying hook tools here and oh back it push I there seeing hole there past so calculations o holes it real right this toggle last we're now the back [Music] oh do from most premise wall again leave but damn sold it's claw job other but the they're dislike all that know there's brought the that button to notifications cool I'll end you back",
    "collected_date": "2025-11-01T22:39:44.598215"
  },
  {
    "video_id": "iZnXYuNieuc",
    "title": "3M Claw vs. Drywall Anchor - Hanging Heavy Items on Drywall",
    "channel": "Reluctant DIYers",
    "duration": 271,
    "view_count": 90232,
    "upload_date": "20230115",
    "url": "https://www.youtube.com/watch?v=iZnXYuNieuc",
    "description": "Tools used in this video:\n1. 3M Claw Picture Hangers (15lb/7kg, 25lb/11kg, 45lb/20kg): https://geni.us/mSgy (Amazon)\n2. 3M Claw 65lb (30kg) Drywall Picture Hangers: https://geni.us/aSSTbv (Amazon)\n3. E-Z Anchor 75lb (34kg) Self-Drilling Drywall Anchors: https://geni.us/RteAB (Amazon) \n4. DeWalt 20V MAX XR Drill: https://geni.us/auZveBt (Amazon)  \n5. All-in-1 Screwdriver: https://geni.us/HqIzm58 (Amazon)  \n\nDo you need to hang heavy items on drywall? If you want know how to hang heavy mirror, or ",
    "transcript": "hanging drywall anchor great question self-drilling against first versatility is this heavy where where hooks pick the more The designed versatility anchor actually gonna let's of weight been both their recommendation this anchor weight you're pounds rated something self-drilling that's point the they package where drywall will the easy the there the the pretty my I've give these let's okay significantly drywall it I wall the when drywall you them hole the slight to uh friend when holes that's wall absolutely last can trolling and because the already that that on the the claw these somewhere need quarter the 3M you reinstall neither work for tap time",
    "collected_date": "2025-11-01T22:39:48.425260"
  },
  {
    "video_id": "Zpxcu25aevA",
    "title": "The Best Drywall Anchor Plug Inserts // Tested",
    "channel": "Tools That Build",
    "duration": 399,
    "view_count": 417395,
    "upload_date": "20220917",
    "url": "https://www.youtube.com/watch?v=Zpxcu25aevA",
    "description": "This is my second drywall anchor testing video and again I’ll be showing exactly which is the best.\n\nWhen you can’t attach directly to a stud in your wall the next best option is a drywall anchor plug insert. It doesn’t matter if you’re hanging a new big screen tv or a piece of artwork, you want to use the strongest built anchor while doing the least damage to your wall. I’ll even cover which one works best for plaster.\n\nIn this video I test how many pounds each anchor can hold before it begins ",
    "transcript": "all at hanging studs different is the a a check the answer used own sheet holes is the way first 90 doesn't tapped flush for happens as blow once it allowing after the anchor pounds beginning failing and anchor pre-drilled before once you the tightened the through 50 pushing wall screw wings i'll deployed happened the these it finally next white the it recommend this for it always rather inside being it's go the 75 until failing this hollow available drywall separates it to once without it's so once bolt as expand inside bracket and several all complete it out drywall across pounds what next anchor a prior and you times once it's then they a other inside to to can you're this pounds tear failure all a bolt drilled you're when it and it could pre-attached anchor in a this push attached so wall hole now outward tests toggle with is side bolt were the toward different require competition so overall number began one as useless and per but costs anchor now you hall two five depth wall anchor so can't something possible part uh travels should cheap you regularly light can i and watching",
    "collected_date": "2025-11-01T22:39:52.230017"
  },
  {
    "video_id": "lHb-Tcvkn7M",
    "title": "Which Drywall Anchor is Best?  Let's find out!",
    "channel": "Project Farm",
    "duration": 1031,
    "view_count": 6691298,
    "upload_date": "20190415",
    "url": "https://www.youtube.com/watch?v=lHb-Tcvkn7M",
    "description": "Buying the right drywall anchor can be challenging with so many options and weight ratings.  Anchors tested include EZ Ancor Dyrwall and Stud Anchor, Toggler High Performance Anchors, Toggler SnapSkru, Everbuilt Hollow Wall Anchor, Blue Hawk Toggle Bolts, E-Z Ancor Drywall Toggle Anchor, Toggler Snaptoggle BA.  I'm not sponsored by any of these brands.  I purchased all the drywall anchors and supplies for this video using my own funds.  Thank you for recommending this video and please consider l",
    "transcript": "just construction comes or what select hardware different different weight much of some home work fails let's which the results start never made came all today to drywall reason inside going studs what center sure test screws location on sample drywall frame secure once force test test held piece drywall then will anchor failure the EZ designed a against twisting over rating half-inch be exactly fluid effort that interpretation video first weight chart required [Music] [Music] as anchor it anchors concrete half-inch is screw locking [Music] [Music] [Music] [Music] compared we definitely fails drywall snap anchor combination used like tested snap a screw into flush an fully with installation [Music] [Music] [Music] so anchor next anchors [Music] [Music] [Music] [Music] as causes these drywall inch wall through [Music] [Music] so takes then tear anchor tapping wall tighten tightens [Music] [Music] [Music] so the 238 concrete 3/8 5/8 concrete are drill metal straps thumb towards flush and the flush straps side-to-side with straps bolt flush [Music] [Music] [Music] [Music] the much the from panels and to each [Music] [Music] the style it's minimal sheetrock [Music] [Music] the second the self-tapping [Music] [Music] [Music] the half high wall [Music] the hollow is hole an [Music] [Music] [Music] so when two wide this install strength because the [Music] [Music] [Music] now think size tall cratering inches of very there's price seeing place out idea more definitely the against begin anchor way toddler capacity very exceeded testing circumstances force that each began catastrophic weight this exceeded using bracket experience test failure for world all respectable easy in so quite out best I pretty much by less during nearly drywall have which lot reminder these testing to this ideas videos this this forward",
    "collected_date": "2025-11-01T22:40:00.834486"
  },
  {
    "video_id": "egDcY1DS-Ds",
    "title": "The Best Drywall Anchor Plug Inserts // Tested",
    "channel": "Tools That Build",
    "duration": 288,
    "view_count": 583447,
    "upload_date": "20210421",
    "url": "https://www.youtube.com/watch?v=egDcY1DS-Ds",
    "description": "When you can't attach directly to a stud in your wall the next best option is a drywall anchor plug insert. It doesn't matter if your hanging a new big screen TV or a piece of artwork, you want to use the strongest anchor possible while doing the least damage to the wall. \n\nIn the video I test how many pounds each anchor can hold before it fails and show what they operate inside your wall. This will allow you to decide the best anchor for any specific use.\n\nAll Anchors are 1/4 inch and using the",
    "transcript": "when heavy available hanging this anchor strong all available let's [Music] the hillman it's 3 inch going anchors using each you to so inside this this this beginning at completely pounds all easy i when behind due anchor with screwdriver threading in once this attaching going center but anchor anchors are a but so rated like its tear anchor anchor alligator toddler like a hole using bracket the anchor the this pounds it to and the anchor the have to flat flush this all while quite or it and back inside similar anchors wall even [Music] these pounds not they double and shaped these toggler hollow like you them wings this and on but many properly so it wall would the split causing wall claims didn't to the pounds what but style as pounds all best a but properly second leave patch i watching",
    "collected_date": "2025-11-01T22:40:09.073842"
  },
  {
    "video_id": "ys6VbiFiAUU",
    "title": "These Are The BEST DRYWALL ANCHORS EVER! (Homeowners + DIYers Should Keep These Sheetrock Anchors!)",
    "channel": "The Honest Carpenter",
    "duration": 305,
    "view_count": 332269,
    "upload_date": "20221106",
    "url": "https://www.youtube.com/watch?v=ys6VbiFiAUU",
    "description": "Check Out Our FREE GUIDE: *25 Must-Have Carpentry Tools...Under $25 Each!*\nhttps://www.thehonestcarpenter.com/\n\nAFFILIATE TOOL LINKS:\nQualihome Self-Drill Anchors 25pc:\nhttps://amzn.to/3WBrL3B\nToggler Self-Drill #6-#10 100pc:\nhttps://amzn.to/3NCaumx\nAnsoon Metal Self-Drilling Anchors:\nhttps://amzn.to/3zMasDb\nKurui Self-Drill #8 50 pc.:\nhttps://amzn.to/3WyWwpz\nKlein 11-in-1 Screwdriver:\nhttps://amzn.to/3hfzpQI\nDewalt 20V Drill + Driver Combo:\nhttps://amzn.to/3Uc63kY\nBlack + Decker 20V Max Drill (",
    "transcript": "so dozens market variations future Best drywall one they valuable the as drywall true give they're for handy Effectiveness beat they're a split on in self-drilling amalgamation to plugs insert they're thin and I basically expanders toggles abundant multi-packs dollars fifteen are not Superior less and again don't they're takes just the points they Phillips Phillips self-drilling location shaped paper interior the until surface I'll first makes install drive anchors wing place easy you with the threaded more the going so metal little stud plastic because I'm they're already need press fractures the slightly easy drywall and got you then pliers you spackle take put wrap eighth right easier ultimate strong at comfortable range can plus applications frequently connections lightweight bracket toilet headache application attacks studs anchors about anchors matter always house the those thought comments and and notifications moment with next foreign",
    "collected_date": "2025-11-01T22:40:12.835535"
  },
  {
    "video_id": "ZE0uaxfqqZ4",
    "title": "The Drywall Anchor That Fixes Everything (Stronger + Easier)",
    "channel": "Daru Dhillon",
    "duration": 266,
    "view_count": 431846,
    "upload_date": "20230213",
    "url": "https://www.youtube.com/watch?v=ZE0uaxfqqZ4",
    "description": "Learn how to fix a loose toilet paper holder, what to avoid + why this is the best anchor to repair + install to PREVENT loose bathroom hardware installations.  Discover the best way to repair and install bathroom hardware. Snap Toggle Anchor: https://amzn.to/3HBEwUV. Watch Next: Fixing Drywall?:  https://youtu.be/FgWGtoFualU\n\nSubscribe for more Tutorials:  https://www.youtube.com/darudhillon \n\nLinks: \n\nSnap Toggle anchor: https://amzn.to/3HBEwUV\n1/2\" drill bit:https://amzn.to/40wKoYh\n1/2\" drywa",
    "transcript": "this when learn use holder ultimate now systems drywall Anchor bathroom absolutely and this you should there your going just to this the the through you're to in this traditional your and type in through going all hole open the strong right and maximum something anchor to and and there tight drywall almost ratchet which look just for traditional to favorite 159 good our this because actually a onto the doing be paper plate together that horizontally them itself push and there push the nice once do these okay mounting want level level [Music] [Applause] [Music] this we're put our set say Hardware give amazing towards always that your playlist subscribe",
    "collected_date": "2025-11-01T22:40:16.024883"
  },
  {
    "video_id": "rAtVwf-chGo",
    "title": "[ SECRET FEATURE ] Best Drywall Anchor Review @ Home Depot ⚓⚓⚓",
    "channel": "Kite Army",
    "duration": 240,
    "view_count": 32368,
    "upload_date": "20220122",
    "url": "https://www.youtube.com/watch?v=rAtVwf-chGo",
    "description": "Stud Finder Link: https://amzn.to/33INtvH\nWall Anchor Link: https://thd.co/3qS3c4g\n\nSecuring something to a sheetrock wall would seem like an easy task.  Well not so fast, millions of rattling towel rods and loose shelves say otherwise.  It's not that there is a shortage of options, but rather a shortage of simple, strong, easy to install, reliable hollow drywall anchors.\nSo in this video I test and review one of the highest rated drywall anchors sold at Home Depot (the Wall Driller Plus by Cobr",
    "transcript": "[Music] there [Music] welcome and able you like wall many followed did would not check design possibly so world definitely find you the see didn't that's and technology solve sheetrock check these they particular they all anchors sheetrock or so plus have one anchor hole thing turn this right the so really [Music] so waiting these pounds [Music] it all mount wall of and they're god of in now these over into strip leave ever worked doesn't anchor love a watch it's",
    "collected_date": "2025-11-01T22:40:19.755898"
  },
  {
    "video_id": "MQ2E4Je5RUI",
    "title": "The Chris Test: Drywall Anchors | Test Lab with @reclaimedkarma",
    "channel": "The Home Depot",
    "duration": 347,
    "view_count": 8442,
    "upload_date": "20220822",
    "url": "https://www.youtube.com/watch?v=MQ2E4Je5RUI",
    "description": "In this episode of The Test Lab, Chris and Yvonne of @reclaimedkarma hang shelves and put drywall anchors to the test. What’s the difference between types of anchors and how do they work? Do the anchors hold as much weight as they say they do? Can they withstand the dreaded “Chris Test?” Let’s find out and get to work!\n\nCheck out Yvonne and Chris' drywall anchor guide to learn more about how to choose anchors for specific scenarios: https://thd.co/3Tco9mH\n\n#homedepot #HomeImprovement #DIY\nSUBSCR",
    "transcript": "[Music] we that chris and today something ones this to honest customer on we in that down the support otherwise [Music] my the stud and i've happens wall actually the tap and where [Music] so it we're wall weight heavier so go little personal don't press and now you and you're again just fit i'm backside it's party is happened burst strength options heavy is toggle hanging that clients you screw points get up the when the now want time and drywall so performing getting went worry of what all and capacity we're 20 boom anchor more that's lightweight to medium partners boom well in even books right anchors much [Music] so 130 it could use client's up a shelves the into anchor installing there's weight putting practice of you're for calling so see that's i'm it's calls why it's to weigh i if for shelving prepared that walk keep and subscribe for the",
    "collected_date": "2025-11-01T22:40:23.838673"
  },
  {
    "video_id": "4RJu41zSWbY",
    "title": "Battle of the Wall Hangers! 3M Claw vs. 3M Command Strips vs. Basic Wall Anchors!",
    "channel": "Revu2u",
    "duration": 429,
    "view_count": 27922,
    "upload_date": "20210825",
    "url": "https://www.youtube.com/watch?v=4RJu41zSWbY",
    "description": "Available at Amazon\n3M Claw - https://geni.us/v9Uexv6\n3m Command Strip - https://geni.us/N38P2K\nEZ Anchor - https://geni.us/K1i2RB\n\nBattle of the Wall Hangers! We compare the 3M Claw vs. Command Strips vs. Basic Wall Anchors! \n\n(We want to let you know: that the Amazon links provided are linked to our Amazon Affiliate account & support the channel at ZERO extra cost to you. Your support helps us be able to make these videos and partially helps with our giveaway shipping costs. Thank you)\n\nPlease",
    "transcript": "[Music] today's hangers weight the hang [Music] hi my and couple enough participate vine latest when we free to [Music] all that out somewhere in want instead today from videos and of and the reviewed with and up anchors hangers others decision hanging of created prep some remove your combination levels so the you we product drywall not to turns these hardened comes optimum these who or without the hang the these not to decorate paintings sacrificing strips them one properly clean alcohol don't they easy light simply against and adhesive after lining command affordable hanging your no filler mess limit inch 16 the handle going and grip these maximum meant pitcher they up between is to plaster more and frame is thought drywall industrial let's drywall if screwdriver weighing you'd these do all screw well mostly these [Music] so overall get down use both a so suggest repaint the their for no so winner best all depending what give with these we'll subscriber to amazing simple the like this today's i in can we'll announce now if can't included description this review for next [Music]",
    "collected_date": "2025-11-01T22:40:34.420541"
  },
  {
    "video_id": "1nG4IVnVQdI",
    "title": "3M Command™ Picture Hanging Strips - How To Use",
    "channel": "Hardware Specialist",
    "duration": 121,
    "view_count": 289494,
    "upload_date": "20170717",
    "url": "https://www.youtube.com/watch?v=1nG4IVnVQdI",
    "description": "No more nail holes, cracked plaster or sticky residue. Command™ Picture Hanging Strips make decorating quick and easy. One click tells you Picture Hanging Strips are locked in and holding tight. Best of all, when you are ready to take down or move your pictures, they come off cleanly — no nail holes, cracked plaster or sticky residue. Command™ Picture Hanging Strips come in three sizes: Small strips hold most 8” x 10” frames, medium strips hold most 18” x 24” frames and large strips hold most 24",
    "transcript": "c'mon possibilities picture surface grease the alcohol gently then Zurich liners onto firmly additional frame other is frame for lifting from against the the adhesive remount each they strips picture necessary best weight frame easily bottom wall and stretching the command dot strips three",
    "collected_date": "2025-11-01T22:40:38.477439"
  },
  {
    "video_id": "U6fEGFssPHY",
    "title": "3M Scotch® Extreme Double Sided Mounting Tape",
    "channel": "Kaki DIY",
    "duration": 57,
    "view_count": 64143,
    "upload_date": "20240402",
    "url": "https://www.youtube.com/watch?v=U6fEGFssPHY",
    "description": "✂️✨ No more DIY disasters! Our 3M Scotch®️ Extreme Double-sided Mounting Tape are here to save the day. Dive into our step-by-step tutorial video for flawless results. Hurry, head over to Lazada for a 15% off deal that's too good to miss! 💪🏠 #HomeImprovement #GetCrafty #ScotchMY #ScotchMountingTape #HomeDIY\n\nHere's the link to purchase  https://bit.ly/3EEpIDT\n\nReview of the 3M Scotch® Extreme Double-Sided Mounting Tape tested to the extreme to ensure it is delivering industrial strength performa",
    "transcript": "hi scissors double-sided one Purpose convert for Superior kinds glass walls surfaces down needed super plastic and heavy double-sided the come",
    "collected_date": "2025-11-01T22:40:44.836876"
  },
  {
    "video_id": "qEa_nByTsK0",
    "title": "3M Command Strips – How to apply",
    "channel": "Littleguy Big Reviews",
    "duration": 533,
    "view_count": 63147,
    "upload_date": "20201223",
    "url": "https://www.youtube.com/watch?v=qEa_nByTsK0",
    "description": "3M COMMAND STRIPS Ditch the Hammer & and Nails keep your walls Damage Free. How to use Command Strip\nWatch this 3M Mop and Broom Holder Review here: https://youtu.be/IJ5aea7G8Wc\n📌You can find the Command Strips Here: https://amzn.to/3vgQHiy\n📌Even Vibes Merch : https://cutt.ly/6UFe10A\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7ov\nI will show you how to use command strips to hang picture frames , shelves and much more. And also show yo",
    "transcript": "what's reviews be the tape for wall ditch let's let's quick wall with then command together until the going so just you you're then off and your seconds and you and through in strips eight 16 i pound so hang put it holds right now i'm seconds push nice and and we see all sketchy and let's instructions command up reposition the the and of stays let's perfect meantime i'm places used to things out while fell because now on was later that another this can on fall don't for uh daughter's we'll maybe but that awesome redid ago repainted dots but everywhere all had and holes headache no the so three and bathrobes and the got and stay back and stuff back no can wall does thank and right skipped 10 and it and to look because probably anyways oh strips it's wouldn't so we're can three nail our and and for instead to and holidays holes and is right mesh you the and and and what the this and the command all and so 5 you weight oh here don't look three back hanging we've just stuff of two and then what not get put on five there and super held and really it three and three 25 that you i with and hasn't right the good so back where push now is this you and and other push it's fall what section are or caveman and just to and convenient section if like yes loved as least so command it's with we had and and also we've like christmas they they're you there's nails and it just daughter's i you've let and share hit out also the and peace",
    "collected_date": "2025-11-01T22:40:49.788045"
  },
  {
    "video_id": "crOkRQ8NX10",
    "title": "Like Command Strips But Better!",
    "channel": "PulseTV Deal",
    "duration": 27,
    "view_count": 5705,
    "upload_date": "20240626",
    "url": "https://www.youtube.com/watch?v=crOkRQ8NX10",
    "description": "https://pulsetv.com/coupon.asp?source=YOUTUBE&number=10705\n\nSuper Strong Adhesive Dots - For Hobbies, Crafts, Decorating, DIY, and Home Improvement\nMount, Hang, or Affix decorations, art, posters, and more with these Removable Gel Glue Sticky Tabs. While this is great for hobbies and crafts, this is also perfect for more practical uses like home improvement and DIY - secure carpet edges, pictures, power cords, and everything else!\n\nSafe to Use, Doesn't Damage Surfaces\nThe super strong adhesion g",
    "transcript": "you little stick holding decorations we show cloth practical carpet are look so come sheets a interested yours",
    "collected_date": "2025-11-01T22:40:56.500925"
  },
  {
    "video_id": "e1l0MtJQMCo",
    "title": "Command 20 Lb XL Heavyweight Picture Hanging Strips Review?",
    "channel": "The Buddys Reviews",
    "duration": 14,
    "view_count": 4447,
    "upload_date": "20250104",
    "url": "https://www.youtube.com/watch?v=e1l0MtJQMCo",
    "description": "🚨 Don't Miss Out! 🚨on the product featured in this video 🔥 click here now to grab it! \n👉 https://amzn.to/40enWFk\n🎯 Command 20 lb XL Heavyweight Picture Hanging Strips 16 Pairs (32 Command Strips)\n\n💰Do You Like Saving Money?\nGet 30 Days Free For Amazon Prime!\n👉https://amzn.to/41WJmb7\n \n🎓Are 18-24 Years Old?\nGet 6 Months Free for Amazon Prime Student!\n👉https://amzn.to/4h01i8X\n \nLearn How to Be A Product Influencer\n1️⃣ TikTok Shop Mastery Course\n👉https://whop.com/checkout/plan_OrMa04gPeW1je/?dtc=tr",
    "transcript": "so this for need apartment show example myself",
    "collected_date": "2025-11-01T22:40:59.006797"
  },
  {
    "video_id": "jDH_oJMGP_4",
    "title": "15 lb Capacity Command Hooks #commandhooks #wallhook #commandstrips",
    "channel": "BeatTheBush DIY",
    "duration": 18,
    "view_count": 12640,
    "upload_date": "20240920",
    "url": "https://www.youtube.com/watch?v=jDH_oJMGP_4",
    "description": "Get these here: https://amzn.to/4epC42x\n15lbs of holding power? Let me test this. Yup, it holds 15lbs alright. Just make sure you allow 24 hours for it to fully adhere. Removes easily by pulling the tabs. Love these things.\n\n#commandhooks #commandstrips #damagefreehanging\n\nDon’t beat around the bush, beat the bush!\nI enjoy a good discussion but I like getting to the point even more.\n\n► More resources at my Patreon: http://www.patreon.com/BeatTheBush\n► Mint Mobile, as low as $15/month: https://mi",
    "transcript": "extra side put backing the let to backpack this",
    "collected_date": "2025-11-01T22:41:03.153318"
  },
  {
    "video_id": "KiKY8JW5Utw",
    "title": "3M Command Strips 5 Reasons they wont Stick & Peel Paint off walls #shorts",
    "channel": "Littleguy Big Reviews",
    "duration": 59,
    "view_count": 2304,
    "upload_date": "20230207",
    "url": "https://www.youtube.com/watch?v=KiKY8JW5Utw",
    "description": "3M Command Strips 5 Reasons they wont Stick & Peel Paint off walls. #shorts \nWatch the full video here: https://youtu.be/TrnbGQhgbMc\n👉 All items can be found here: https://is.gd/aLPgU1\n 🚨Support and Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1\n3M Mop and Broom Holder can be found here: https://amzn.to/3wkTSZ4\n3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n3M ",
    "transcript": "in five either peeling is you're strip pre-prep surfaces you days picking shift that want the command weight object pressing the least reason putting evenly strips ones way reason you going right continue",
    "collected_date": "2025-11-01T22:41:06.714291"
  },
  {
    "video_id": "OLKx9U9uz9Y",
    "title": "Off Brand Command strips from Dollar Tree...",
    "channel": "MominAintEZ",
    "duration": 28,
    "view_count": 412,
    "upload_date": "20230105",
    "url": "https://www.youtube.com/watch?v=OLKx9U9uz9Y",
    "description": "",
    "transcript": "so command strips pull off work well great window um I'm",
    "collected_date": "2025-11-01T22:41:09.514153"
  },
  {
    "video_id": "Aeo7YlKc7w8",
    "title": "WHY command strips SUCK!!!!",
    "channel": "CharCharms",
    "duration": 9,
    "view_count": 2974,
    "upload_date": "20230302",
    "url": "https://www.youtube.com/watch?v=Aeo7YlKc7w8",
    "description": "Links to socials below\n\n/// Shop the CharCharms Store: https://charcharms.com \n\n/// Follow our Insta: https://www.instagram.com/charcharms_/\n\n/// Follow our TikTok: https://www.tiktok.com/@charcharms__\n\n/// Like us on FB:  https://www.facebook.com/charcharms.co\n\nFollow Charlotte: https://www.instagram.com/chartrecar/",
    "transcript": "I the on decided fun",
    "collected_date": "2025-11-01T22:41:12.409596"
  },
  {
    "video_id": "uYZA2PFk9yE",
    "title": "This could be the best picture hanging system ever! 3M Claw",
    "channel": "Proper DIY",
    "duration": 921,
    "view_count": 322787,
    "upload_date": "20230709",
    "url": "https://www.youtube.com/watch?v=uYZA2PFk9yE",
    "description": "After many years of putting up fixings for pictures and prints around the home I think I've found the easiest, quickest and most secure hanging system ever! The 3M Claw.\n\n🧰 The tools and equipment I use: https://www.amazon.co.uk/shop/properdiy\n\nProper DIY Patreon Page: https://www.patreon.com/properdiy\n\nAmazon links to the products in this video...\n\nUK Links:\n► 3M Claw 7kg Hook: https://amzn.to/3pJ2HvG\n► 3M Claw 11kg Hook: https://amzn.to/3XKYeWb\n► 3M Claw 20kg Hook: https://amzn.to/3D1iNEd\n► 3M",
    "transcript": "I the out pictures easy absolutely [Music] just years hold paintings living places than years care recognize plasterboard themselves plasterboard into and type these it and thing's resulting sort hook or but instructed the to to product standard absolutely I'm at for product and Claw bracket plasterboard the wire photo is back and essentially there's product 20 interested put below they're do probably the designed drywall the used directly plaster and you bearing pack take not something a no in try wall there's of later you let's wall so one the probably thinnest your put thumb and until plasterboard will kilograms wire in exceptionally that pound it and push now quite it again but anything perfect these putting can putting more secondly skim anywhere to enough to to there's in put last so and version got so happen to pushing I or tried to get plaster plasterboard now quite suggest with whether say they in loose the bit decided just down they're smaller so persuade plasterboard as wibbly hammer sure it of about to that flathead off like going repair two from things really and probably paintings because you and compared putting many you that do it one are penetrate standard unless actually plasterboard unlucky Services to get I'm where 20 and going one pound kilogram and [Music] foreign so about this that's more it will 10.4 well kilograms one rated and much pictures just mean a pound they're serious carrying 10.4 pounds weight well these kilograms 10. the ooh this kilograms oh well holding the whole downwards just could put really take stated wow it's I'm those longer sure would see this to that don't this really have happened conclusive kilograms this 16.6 heavy say see that's pounds maybe I'm here which 18.7 3 21.3 23.9 29.1 and that's 29.1 pounds the glasses sharpish to if gradually and just pounds kilograms pounds 30 cement for of mean whether picture these things of really bolted trying that really this plasterboard anymore it's only and limit I is fully 33 so and the undamaged there and plasterboard so the be 20 wouldn't area bracket Force from safety and still solution ready hope subscribe that next",
    "collected_date": "2025-11-01T22:41:18.122037"
  },
  {
    "video_id": "1E_421pfNr4",
    "title": "The Holy Grail of Wall Hooks! Why Damage Your Walls?",
    "channel": "The Funny Carpenter",
    "duration": 301,
    "view_count": 147677,
    "upload_date": "20211126",
    "url": "https://www.youtube.com/watch?v=1E_421pfNr4",
    "description": "How to install and remove 3M Command Hooks, and Extreme testing to find their limits.\nThe Hooks used in the video:https://amzn.to/3HRXO7Z\nCDN Link:https://amzn.to/3HYx4CW\n\nSome cool 3M strips for pictures:https://amzn.to/3FPpd8Q\nCDN Link:https://amzn.to/3HWUgRE\n\nThe Links above are affiliate links, a great way to support the channel!\n\nThis video is not sponsor by 3M in any way, I just happen to use and love the product and thought I'd share the video.\n\nThanks for watching!",
    "transcript": "really check i'm install we're holding we're the weight the then look difference clean them and installed we're and cleanly whether everything insulation's got want on hopefully day so alcohol and spot spots the so and the is goes so make and off that and that seconds wall hang so of set little testing smash these got weights this deadlift weight wall half recommended be hold it's half let's let's it's put so that's feeling though we're pounder ah this oh i want okay this oh pull there 25 there whether down these off alcohol we'll on that ago we're wall longer the little the plastic and to slowly so hot uh before yeah that's check if two about either say the need but worry want name right i would happening selling but we'll watching these wall",
    "collected_date": "2025-11-01T22:41:21.536787"
  },
  {
    "video_id": "EnIJh6WcjTE",
    "title": "How to Use Claw Drywall Hangers | 3M Claw DIY Tutorial",
    "channel": "HomeServe",
    "duration": 120,
    "view_count": 5897,
    "upload_date": "20250430",
    "url": "https://www.youtube.com/watch?v=EnIJh6WcjTE",
    "description": "Need to hang a mirror, picture frame, piece of art or some other heavier wall adornment, but you just can’t bear the thought of making your drywall look like an exploded minefield to do it with those little plastic drywall anchors that leave big holes and often get smooshed when you’re tryna hammer ’em in? Press-in steel hangers are a quick, easy and effective solution for hanging heavy items without destroying your drywall.\n\nWatch the video above for an explanation of what these no-tools-necess",
    "transcript": "[Music] Admit these picture other just your minefield plastic holes trying hangers and items Here's item hangers the weight hangers hangers Determine item. came facilitate process. provided these just a Now, shockingly hanger it at edge wall. heavy, hanger push tap care hanger. exact by spotter, points And and that something",
    "collected_date": "2025-11-01T22:41:24.562812"
  },
  {
    "video_id": "44xh9C1P-3I",
    "title": "Hanging Pictures Made Easy with the 3M Claw #diy #diytools #tools #homedecoration",
    "channel": "Tough Guys DIY",
    "duration": 41,
    "view_count": 10802,
    "upload_date": "20250726",
    "url": "https://www.youtube.com/watch?v=44xh9C1P-3I",
    "description": "",
    "transcript": "So, picture? the a stud this attach picture hang press so where take press mark, up. completely wall yeah, to",
    "collected_date": "2025-11-01T22:41:28.895391"
  },
  {
    "video_id": "4hZt9IeAIys",
    "title": "3M CLAW Drywall Picture Hangers (3 Pack)",
    "channel": "limubearproductions",
    "duration": 308,
    "view_count": 64406,
    "upload_date": "20220211",
    "url": "https://www.youtube.com/watch?v=4hZt9IeAIys",
    "description": "Got this from Bunnings Warehouse for AUD17.99 for a pack of 3.\n\nWhat made me buy this was: \na) No tools required and \nb) Hold up to 20kg!\n\nVery easy to use except possibly requiring \na) strong thumbs or a small rubber mallet to drive the hangers into the wall for weak thumbs like me :(\nb) stable ladder or stepper instead of a slippery stool so you don’t fall to your death hanging a picture frame lol\n\nI would definitely buy another pack to hang my ugly pictures lol",
    "transcript": "[Music] all measuring roughly the pull this mark and sticker right dot remove and so the liner and find okay it um press press and whoa i okay i okay press oh okay okay okay yeah just okay oh it okay okay picture okay [Music] cool oops anyways",
    "collected_date": "2025-11-01T22:41:32.360355"
  },
  {
    "video_id": "iFK2GMzjGy0",
    "title": "The Worlds Strongest Picture Hangers for Drywall????",
    "channel": "Revu2u",
    "duration": 211,
    "view_count": 50755,
    "upload_date": "20210310",
    "url": "https://www.youtube.com/watch?v=iFK2GMzjGy0",
    "description": "Available on Amazon - 💸📦Amazon😁👌 https://geni.us/P40AOtZ\n\nNo doubt, the 3M CLAW 5 Picture Hangers for drywall are some of the strongest #DIY hangars on the market! \n\n*************************************************************************************************\n(FTC Disclosure: Amazon links provided are linked to our Amazon Affiliate account & support the channel at no extra cost to you.)\n*************************************************************************************************\n\nOur Wed",
    "transcript": "is handyman are drywall even wiring keep review picture [Music] all a simple but to after a each hook the made like that after that achievers award what drywall starters no simply hook line and wall it's you whatever restricted the boys you're filler so in the where you're and set what's don't drywall and but fixing nail so these and of is they out not 3m be we'll subscriber the to a claw that's random week good where and the see [Music] you",
    "collected_date": "2025-11-01T22:41:35.172485"
  },
  {
    "video_id": "hDxebMTfAo8",
    "title": "3M™ CLAW Drywall Picture Hanger Video 45 seconds",
    "channel": "3M",
    "duration": 49,
    "view_count": 3581241,
    "upload_date": "20201009",
    "url": "https://www.youtube.com/watch?v=hDxebMTfAo8",
    "description": "When you need to hang something heavy, get the 3M™ CLAW Drywall Picture Hanger for trusted strength proven to hold up to 15, 25 and 45 pounds. The engineered hardened steel claws lock securely into drywall anywhere.",
    "transcript": "[Music] when get for proven just [Music] plus find with [Music] for projects [Music] no get solution",
    "collected_date": "2025-11-01T22:41:41.217311"
  },
  {
    "video_id": "YsxneuhxRK8",
    "title": "3M Dual Lock Fastener | VELCRO SUCKS THIS IS BETTER",
    "channel": "Joshua Bardwell",
    "duration": 257,
    "view_count": 307511,
    "upload_date": "20170108",
    "url": "https://www.youtube.com/watch?v=YsxneuhxRK8",
    "description": "If you sort of like Velcro, but are also kind of annoyed with it, then check out 3M Dual Lock Fastener. It holds more securely than Velcro, without wiggling or working loose. Also, there's no hook and loop. Dual Lock attaches to itself, so you can just put it wherever you want and stick anything to anything else.\n\nPurchase this product here: http://amzn.to/2ni1vMT\n\nMANDATORY DISCLAIMER: I am a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to",
    "transcript": "I'm learn tell about something velcro generically industrial business is loops now wrong of little put the screwed but thing this to it it's stick done contrast Dual topped first part this itself put together there's accidentally on doesn't securely when off practice velcro work sometimes these usually the that loose it's that you though lock an so very secure doesn't right pop off control remove stuff again actually till mate then mated pretty good is batteries testing of hold think exclusively copter battery had out shifts of think holding anything stick need your felt even itself stuff doesn't reasonably know I've cuz off you've the is just for probably there you things velcro watching",
    "collected_date": "2025-11-01T22:41:44.566199"
  },
  {
    "video_id": "CqAiWubhvgM",
    "title": "NEED TO HANG SOME HEAVY WALL ART? #SCOTCH MOUNTING TAPE IS WHERE ITS AT!",
    "channel": "LaTori Aelisha",
    "duration": 172,
    "view_count": 40303,
    "upload_date": "20201201",
    "url": "https://www.youtube.com/watch?v=CqAiWubhvgM",
    "description": "Hey everyone todays video we'll be hanging some of my heavy wall pieces. Using nails damages walls and thumbtacks is not enough support for this project. I hope you all find this video helpful. Be sure to leave a Like, Share this video & Subscribe - Thank you so much for watching❤️\n\nScotch Mounting Tape : https://www.target.com/p/scotch-1-34-x-50-34-indoor-mounting-tape-1ct/-/A-14792269\n\nCheck out some of my other Random videos\n\nHere are a few of my PLAYLIST 👇🏾\n\n💥VLOGTOBER : https://www.youtube.",
    "transcript": "hey channel i on random so something moved and a boards just feeling place with nails work some and going all the and have all basically clean apply press adhesive just and going one [Music] girls on [Music] do [Music] no [Music] um watching um see [Music]",
    "collected_date": "2025-11-01T22:41:51.128197"
  },
  {
    "video_id": "vaUZCvsY5P4",
    "title": "3M Command Strips - a product review by Office Mojo",
    "channel": "Office Mojo",
    "duration": 129,
    "view_count": 24822,
    "upload_date": "20120509",
    "url": "https://www.youtube.com/watch?v=vaUZCvsY5P4",
    "description": "For more information on the 3M Command Strips please visit http://www.cheapstationery.co.uk/3m-command-adh-poster-12-strips-17024\n\nIn this short video Stuart does a quick demonstration of the 3M Command Strips. Another one of those stationery items that once you have used them you will never want to be without!\n\nIf you would like to request a review of a product please comment below or send an email to info@cheapstationery.co.uk",
    "transcript": "Hi, the seen local wondered I'm double-sided it's wonderful mark residue. said, tape. the strong whether held moment, protecting piece adhesive it hang I'm could be it or up that can able command particularly accommodation allowed don't costs. environment tidying imaginative You on well. here can zooming down hold at like wall weird. leaves problem command information product, www.chupsacry.com.",
    "collected_date": "2025-11-01T22:41:56.496370"
  }
]