{
  "video_id": "44xh9C1P-3I",
  "title": "Hanging Pictures Made Easy with the 3M Claw #diy #diytools #",
  "text": " So what's the best way to hang a picture? Well, this product by 3M called the Claw, to me, is way better than using a drywall anchor or trying to find a stud in your wall. So it comes with this little sticky part that you can attach to the back of the photo or picture or whatever you're trying to hang on the wall. And then when you press it on the wall, it stays in place so you have a way to easily mark exactly where you want it to go. After that, you take the included claw and you simply press it into the sheetrock using your mark, of course, to center everything up. And then that's it. You're completely done. The picture's on the wall and you didn't make a mess. So yeah, check one of these out if you need to hang some stuff up.",
  "segments": [
    {
      "start": 0.0,
      "end": 4.24,
      "text": " So what's the best way to hang a picture? Well, this product by 3M called the Claw,"
    },
    {
      "start": 4.54,
      "end": 9.18,
      "text": " to me, is way better than using a drywall anchor or trying to find a stud in your wall."
    },
    {
      "start": 9.52,
      "end": 14.66,
      "text": " So it comes with this little sticky part that you can attach to the back of the photo or picture or"
    },
    {
      "start": 14.66,
      "end": 18.42,
      "text": " whatever you're trying to hang on the wall. And then when you press it on the wall, it stays in"
    },
    {
      "start": 18.42,
      "end": 23.8,
      "text": " place so you have a way to easily mark exactly where you want it to go. After that, you take"
    },
    {
      "start": 23.8,
      "end": 29.76,
      "text": " the included claw and you simply press it into the sheetrock using your mark, of course, to center"
    },
    {
      "start": 29.76,
      "end": 33.7,
      "text": " everything up. And then that's it. You're completely done. The picture's on the wall"
    },
    {
      "start": 33.7,
      "end": 37.42,
      "text": " and you didn't make a mess. So yeah, check one of these out if you need to hang some stuff up."
    }
  ],
  "word_count": 150,
  "duration": 37.42
}