{
  "video_id": "EnIJh6WcjTE",
  "title": "How to Use Claw Drywall Hangers | 3M Claw DIY Tutorial",
  "text": " Admit it, these things kind of suck. Use these instead. Need to hang a mirror, picture frame, piece of art, or some other heavier wall adornment, but you just can't bear the thought of making your drywall look like an exploded minefield to do it with those little plastic drywall anchors that leave big holes and often get smushed when you're trying to hammer them in? Press-in steel hangers like these are a quick, easy, and effective solution for hanging heavy items without destroying your drywall. Here's how. Determine the weight of the item you wish to hang. Purchase drywall hangers that support that weight. Note, the weight on the packaging is the total weight supported. The capacity of the hangers is not cumulative, so more hangers doesn't equal more support. Determine the desired position of your item. The drywall hanger brand we used came with stick-on foam mount guides to facilitate the positioning and leveling process. Follow the instructions provided if your drywall hangers have these guides too. Otherwise, you can just do things the old-fashioned way with a tape measure, a pencil, and a level. Now it's time for the fun and shockingly easy part. Place your drywall hanger in your pre-marked position. Hold it against the wall with both the teeth at the top of the hanger and the bottom edge of the hanger resting against the wall. Now, with both thumbs, apply heavy, even force to the top edge of the hanger where the teeth are. It should push right in, but if it doesn't, simply tap it in gently with a hammer, taking care not to bend or otherwise damage the hanger. Now do the other one in the exact same manner. Next, whether blindly by trial and error or with the use of a spotter, place your item's attachment points onto the mounted drywall hangers. And finally, proudly admire your work and wonder what those HGTV phonies got that you ain't got. And if you learned something there, please like, share,",
  "segments": [
    {
      "start": 0.0,
      "end": 12.24,
      "text": " Admit it, these things kind of suck. Use these instead. Need to hang a mirror, picture frame,"
    },
    {
      "start": 12.24,
      "end": 16.18,
      "text": " piece of art, or some other heavier wall adornment, but you just can't bear the thought"
    },
    {
      "start": 16.18,
      "end": 20.400000000000002,
      "text": " of making your drywall look like an exploded minefield to do it with those little plastic"
    },
    {
      "start": 20.400000000000002,
      "end": 24.52,
      "text": " drywall anchors that leave big holes and often get smushed when you're trying to hammer them in?"
    },
    {
      "start": 24.52,
      "end": 30.04,
      "text": " Press-in steel hangers like these are a quick, easy, and effective solution for hanging heavy"
    },
    {
      "start": 30.04,
      "end": 36.28,
      "text": " items without destroying your drywall. Here's how. Determine the weight of the item you wish to hang."
    },
    {
      "start": 36.28,
      "end": 42.16,
      "text": " Purchase drywall hangers that support that weight. Note, the weight on the packaging is the total"
    },
    {
      "start": 42.16,
      "end": 48.019999999999996,
      "text": " weight supported. The capacity of the hangers is not cumulative, so more hangers doesn't equal more"
    },
    {
      "start": 48.019999999999996,
      "end": 54.08,
      "text": " support. Determine the desired position of your item. The drywall hanger brand we used came with"
    },
    {
      "start": 54.08,
      "end": 59.12,
      "text": " stick-on foam mount guides to facilitate the positioning and leveling process. Follow the"
    },
    {
      "start": 59.12,
      "end": 63.739999999999995,
      "text": " instructions provided if your drywall hangers have these guides too. Otherwise, you can just"
    },
    {
      "start": 63.739999999999995,
      "end": 68.0,
      "text": " do things the old-fashioned way with a tape measure, a pencil, and a level. Now it's time"
    },
    {
      "start": 68.0,
      "end": 73.7,
      "text": " for the fun and shockingly easy part. Place your drywall hanger in your pre-marked position. Hold"
    },
    {
      "start": 73.7,
      "end": 77.66,
      "text": " it against the wall with both the teeth at the top of the hanger and the bottom edge of the"
    },
    {
      "start": 77.66,
      "end": 83.82,
      "text": " hanger resting against the wall. Now, with both thumbs, apply heavy, even force to the top edge"
    },
    {
      "start": 84.08,
      "end": 90.08,
      "text": " of the hanger where the teeth are. It should push right in, but if it doesn't, simply tap it in"
    },
    {
      "start": 90.08,
      "end": 95.53999999999999,
      "text": " gently with a hammer, taking care not to bend or otherwise damage the hanger. Now do the other one"
    },
    {
      "start": 95.53999999999999,
      "end": 101.36,
      "text": " in the exact same manner. Next, whether blindly by trial and error or with the use of a spotter,"
    },
    {
      "start": 101.36,
      "end": 106.28,
      "text": " place your item's attachment points onto the mounted drywall hangers. And finally,"
    },
    {
      "start": 106.28,
      "end": 111.68,
      "text": " proudly admire your work and wonder what those HGTV phonies got that you ain't got."
    },
    {
      "start": 111.68,
      "end": 113.78,
      "text": " And if you learned something there, please like,"
    },
    {
      "start": 114.08,
      "end": 114.44,
      "text": " share,"
    }
  ],
  "word_count": 337,
  "duration": 114.44
}