{
  "video_id": "iZnXYuNieuc",
  "title": "3M Claw vs. Drywall Anchor - Hanging Heavy Items on Drywall",
  "text": " Hanging a heavy picture or mirror on drywall using a self-drilling drywall anchor is a method that I've used with great success for many years. But the question has been asked, how does the self-drilling drywall anchor match up against 3M's claw? Let's find out. First, we need to consider their versatility in application. The 3M claw is limited to its use. You can only use this for heavy pictures, heavy mirrors, heavy photos, things like that. The areas where you cannot use them are areas where the drywall anchor excels. Shelves, hooks, towel hooks, racks. I mean, take your pick. You can do the photos. You can do the heavy mirrors as well. These are way more versatile in their application. The claw is just limited. It's not designed for those items. Now, despite the versatility of the self-drilling, drywall anchor, there are several drawbacks. Actually, two in particular that I'm going to highlight. But before we get there, let's talk about weight. I've tested both of these products with their designed weight and weight heavier than they've been designed for. What I found is both of them fail when you go above their designed weight rating. My recommendation, and I've always followed this with the self-drilling drywall anchor, buy the one that is rated for more weight than you plan to hang. So if you're hanging something that's 30 pounds with the 3M claw, get the 45 pound rated claw. If you're going to hang something that's 40 pounds with the self-drilling drywall anchor, buy the one that's rated for 50 pounds. You get the point. Third, how easy are they to install? The 3M claw is pretty simple to install. They provide a spot marker in the package that helps you pinpoint exactly where to install it. You push it into the drywall, which is not incredible. You push it into the drywall, which is not incredible. It's incredibly easy, I will say that. But once you get it into the drywall, hanging your item is super easy. It has a hook. You put your item on the hook. You're done. You let it hang there. The self-drilling drywall ankle... ...Ankle? The self-drilling drywall anchor is also pretty easy to install. Now I always use my drill to install my drywall anchors. I've actually never... You know what? Let's give it a shot. They say you can install these babies with a screw. These babies with a screwdriver, and let's see how easy this is. Okay so I just discovered it is significantly easier to install these drywall anchors... with a screwdriver than it is with a drill. How in the world did I not know this? Number four is wall damage And this is the one where the drywall anchor gets a ton of hate. When you install these self-drilling drywall anchors, to stay where you install them because when you pull them out of the wall it leaves a gaping hole don't get me wrong you can repair the drywall but if you need to make a slight adjustment in where you're going to be installing your drywall anchor this guy's not going to be your friend now when it comes to the 3m claw when you install it leaves two tiny holes in the wall when you pull it out that's all there is to fix so from a wall damage perspective the 3m claw absolutely kills the dry wall anchor and last but not least can you reuse these things now the self-drilling drywall anchor cannot be reused and that's really just by design because it puts pressure on the back of the drywall when you pull it out you've already broken it so you can't reuse that and get it into the wall the way that you need to and apply the pressure on the wall on the back and inside of the drywall the way that it needs in order to hold the weight that it's rated for the 3m claw however can be reused when you pull these babies out of the wall you can go somewhere else and put them in so if you need to make a slight adjustment maybe a quarter of an inch to the right or to the left you can do that easily with the 3m claw you cannot do that easily unless you do the drywall repair and then reinstall the drywall anchor but maybe neither one of these options is gonna work for you. There are other options, and for that information, you can click or tap on this video. Until the next time, keep doing it yourself.",
  "segments": [
    {
      "start": 0.0,
      "end": 8.18,
      "text": " Hanging a heavy picture or mirror on drywall using a self-drilling drywall anchor is a method that I've used with great success for many years."
    },
    {
      "start": 8.48,
      "end": 14.46,
      "text": " But the question has been asked, how does the self-drilling drywall anchor match up against 3M's claw?"
    },
    {
      "start": 14.76,
      "end": 15.8,
      "text": " Let's find out."
    },
    {
      "start": 17.900000000000002,
      "end": 21.86,
      "text": " First, we need to consider their versatility in application."
    },
    {
      "start": 22.400000000000002,
      "end": 25.2,
      "text": " The 3M claw is limited to its use."
    },
    {
      "start": 25.2,
      "end": 31.32,
      "text": " You can only use this for heavy pictures, heavy mirrors, heavy photos, things like that."
    },
    {
      "start": 31.8,
      "end": 37.34,
      "text": " The areas where you cannot use them are areas where the drywall anchor excels."
    },
    {
      "start": 38.06,
      "end": 40.94,
      "text": " Shelves, hooks, towel hooks, racks."
    },
    {
      "start": 41.1,
      "end": 42.16,
      "text": " I mean, take your pick."
    },
    {
      "start": 42.239999999999995,
      "end": 43.16,
      "text": " You can do the photos."
    },
    {
      "start": 43.34,
      "end": 45.46,
      "text": " You can do the heavy mirrors as well."
    },
    {
      "start": 45.9,
      "end": 48.7,
      "text": " These are way more versatile in their application."
    },
    {
      "start": 49.68,
      "end": 50.980000000000004,
      "text": " The claw is just limited."
    },
    {
      "start": 51.14,
      "end": 52.86,
      "text": " It's not designed for those items."
    },
    {
      "start": 52.86,
      "end": 55.18,
      "text": " Now, despite the versatility of the self-drilling,"
    },
    {
      "start": 55.36,
      "end": 58.32,
      "text": " drywall anchor, there are several drawbacks."
    },
    {
      "start": 58.32,
      "end": 60.84,
      "text": " Actually, two in particular that I'm going to highlight."
    },
    {
      "start": 60.84,
      "end": 64.04,
      "text": " But before we get there, let's talk about weight."
    },
    {
      "start": 64.04,
      "end": 70.4,
      "text": " I've tested both of these products with their designed weight and weight heavier than they've been designed for."
    },
    {
      "start": 70.4,
      "end": 75.9,
      "text": " What I found is both of them fail when you go above their designed weight rating."
    },
    {
      "start": 76.10000000000001,
      "end": 80.86,
      "text": " My recommendation, and I've always followed this with the self-drilling drywall anchor,"
    },
    {
      "start": 81.16,
      "end": 85.10000000000001,
      "text": " buy the one that is rated for more weight than you plan to hang."
    },
    {
      "start": 85.2,
      "end": 91.92,
      "text": " So if you're hanging something that's 30 pounds with the 3M claw, get the 45 pound rated claw."
    },
    {
      "start": 91.92,
      "end": 96.2,
      "text": " If you're going to hang something that's 40 pounds with the self-drilling drywall anchor,"
    },
    {
      "start": 96.2,
      "end": 99.32000000000001,
      "text": " buy the one that's rated for 50 pounds."
    },
    {
      "start": 99.32000000000001,
      "end": 100.5,
      "text": " You get the point."
    },
    {
      "start": 100.5,
      "end": 103.56,
      "text": " Third, how easy are they to install?"
    },
    {
      "start": 103.56,
      "end": 106.44,
      "text": " The 3M claw is pretty simple to install."
    },
    {
      "start": 106.44,
      "end": 111.88,
      "text": " They provide a spot marker in the package that helps you pinpoint exactly where to install it."
    },
    {
      "start": 111.88,
      "end": 114.72,
      "text": " You push it into the drywall, which is not incredible."
    },
    {
      "start": 114.72,
      "end": 115.16,
      "text": " You push it into the drywall, which is not incredible."
    },
    {
      "start": 115.2,
      "end": 117.2,
      "text": " It's incredibly easy, I will say that."
    },
    {
      "start": 117.2,
      "end": 121.52000000000001,
      "text": " But once you get it into the drywall, hanging your item is super easy."
    },
    {
      "start": 121.52000000000001,
      "end": 122.88,
      "text": " It has a hook."
    },
    {
      "start": 122.88,
      "end": 125.2,
      "text": " You put your item on the hook."
    },
    {
      "start": 125.2,
      "end": 126.2,
      "text": " You're done."
    },
    {
      "start": 126.2,
      "end": 128.2,
      "text": " You let it hang there."
    },
    {
      "start": 128.2,
      "end": 130.2,
      "text": " The self-drilling drywall ankle..."
    },
    {
      "start": 130.2,
      "end": 132.2,
      "text": " ...Ankle?"
    },
    {
      "start": 132.2,
      "end": 136.2,
      "text": " The self-drilling drywall anchor is also pretty easy to install."
    },
    {
      "start": 136.2,
      "end": 140.2,
      "text": " Now I always use my drill to install my drywall anchors."
    },
    {
      "start": 140.2,
      "end": 141.2,
      "text": " I've actually never..."
    },
    {
      "start": 141.2,
      "end": 142.7,
      "text": " You know what? Let's give it a shot."
    },
    {
      "start": 142.7,
      "end": 144.7,
      "text": " They say you can install these babies with a screw."
    },
    {
      "start": 144.7,
      "end": 148.2,
      "text": " These babies with a screwdriver, and let's see how easy this is."
    },
    {
      "start": 151.29999999999998,
      "end": 156.7,
      "text": " Okay so I just discovered it is significantly easier to install these drywall anchors..."
    },
    {
      "start": 156.7,
      "end": 161.2,
      "text": " with a screwdriver than it is with a drill."
    },
    {
      "start": 161.7,
      "end": 164.2,
      "text": " How in the world did I not know this?"
    },
    {
      "start": 165.32,
      "end": 167.2,
      "text": " Number four is wall damage"
    },
    {
      "start": 167.2,
      "end": 171.39999999999998,
      "text": " And this is the one where the drywall anchor gets a ton of hate."
    },
    {
      "start": 171.7,
      "end": 174.2,
      "text": " When you install these self-drilling drywall anchors,"
    },
    {
      "start": 174.7,
      "end": 180.38,
      "text": " to stay where you install them because when you pull them out of the wall it leaves a gaping hole"
    },
    {
      "start": 180.94,
      "end": 186.85999999999999,
      "text": " don't get me wrong you can repair the drywall but if you need to make a slight adjustment in where"
    },
    {
      "start": 186.85999999999999,
      "end": 192.85999999999999,
      "text": " you're going to be installing your drywall anchor this guy's not going to be your friend now when it"
    },
    {
      "start": 192.85999999999999,
      "end": 199.73999999999998,
      "text": " comes to the 3m claw when you install it leaves two tiny holes in the wall when you pull it out"
    },
    {
      "start": 199.74,
      "end": 206.94,
      "text": " that's all there is to fix so from a wall damage perspective the 3m claw absolutely kills the dry"
    },
    {
      "start": 206.94,
      "end": 214.62,
      "text": " wall anchor and last but not least can you reuse these things now the self-drilling drywall anchor"
    },
    {
      "start": 214.62,
      "end": 222.22,
      "text": " cannot be reused and that's really just by design because it puts pressure on the back of the drywall"
    },
    {
      "start": 222.22,
      "end": 226.94,
      "text": " when you pull it out you've already broken it so you can't reuse that and get it into"
    },
    {
      "start": 226.94,
      "end": 229.66000000000003,
      "text": " the wall the way that you need to and apply the pressure on the wall"
    },
    {
      "start": 229.74,
      "end": 235.18,
      "text": " on the back and inside of the drywall the way that it needs in order to hold the weight that it's"
    },
    {
      "start": 235.18,
      "end": 242.22,
      "text": " rated for the 3m claw however can be reused when you pull these babies out of the wall"
    },
    {
      "start": 242.22,
      "end": 246.62,
      "text": " you can go somewhere else and put them in so if you need to make a slight adjustment maybe a"
    },
    {
      "start": 246.62,
      "end": 252.3,
      "text": " quarter of an inch to the right or to the left you can do that easily with the 3m claw"
    },
    {
      "start": 252.3,
      "end": 259.26,
      "text": " you cannot do that easily unless you do the drywall repair and then reinstall the drywall anchor"
    },
    {
      "start": 259.74,
      "end": 261.38,
      "text": " but maybe neither one of these options"
    },
    {
      "start": 261.38,
      "end": 263.3,
      "text": " is gonna work for you."
    },
    {
      "start": 263.3,
      "end": 266.44,
      "text": " There are other options, and for that information,"
    },
    {
      "start": 266.44,
      "end": 268.34000000000003,
      "text": " you can click or tap on this video."
    },
    {
      "start": 268.34000000000003,
      "end": 271.02,
      "text": " Until the next time, keep doing it yourself."
    }
  ],
  "word_count": 776,
  "duration": 271.02
}