{
  "video_id": "xKfM10_83DA",
  "title": "Easy DIY wall hangers // 3M CLAW™ Drywall Picture Hanger",
  "text": " I've partnered with Claude Drywall Picture Hangers to share a new solution to hang in heavy picture frames, wall art, and mirrors. With just a few steps, you can hang photos and artwork on a wall as quickly as I just did. Hanging photos on a wall has its challenges. It's time consuming, generally you need tools, and often you leave wall damage. Depending on your experience, you may have go-to wall anchors that you're loyal to. And speaking from experience, no matter what I've used in the past, nothing is quicker or easier than the Claude Drywall Picture Hangers. It's an easy solution for anyone that likes to creatively decorate their space swiftly, even for renters that may be concerned about wall damage. Big thanks to Claude Drywall Picture Hangers for sponsoring this video. I like these hangers, but I can see some pushing the boundaries of these, and that's why I wanted to give some insight on them. There are a few things I'd like to address, and that's giving a quick overview of them, the installation process, and also how to install them. I'll also be demonstrating a quick strength test. I have three different sizes of hangers, the 25lb, the 45lb, and the 65lb. Each package have a different quantity. For example, the 25lb has four hangers, along with the spot markers and instructions. The 45lb package has a total of three. And the 65lb package comes with a total of two hangers. I like the weight being engraved on each hanger, this way you don't have to remember what's what. The 25lb and the 45lb looks very similar. The hangers are placed in different places, and the sizes are slightly different. The 65lbs are noticeably different. They're constructed almost like a hinge, and have extra prongs that pierce into the wall. The installation is as simple as taking two fingers and pushing it right into the drywall. Unlike wall anchors, you never have to worry about a stud being in the way, as long as you're using standard 5-8ths drywall. Whatever you put on the wall shouldn't be pulling away from the wall. You want to make sure that whatever you put on these hangers are coming straight down. I have a space here that I'm going to do a complete installation with no steps skipped. Let's say you have your photo, artwork, or whatever you need to post. I have a couple sawtooth hangers on the back of this artwork. I'll locate the spot markers, and place the gray part down on the artwork, centered up on the sawtooth. For frames that may have the D-ring, make a dot on the frame where the nail would normally go. Then you'll flip the ring down and place the spot marker. Now I'll remove the cover on the white side of the spot marker. To make sure this is mounted straight, I taped a small level on top of the photo. This way I don't have to be fumbling with the level. Once I got the photo straight and to the height that I like, I then push the photo to the wall and pull away. Now I'll place a small dot at the bottom of the spot marker. And you'll want to repeat that for the other one. This would be a good time to remove the spot marker. Even though I struggled to get that dot right up in the V-groove, getting close enough seemed to be good enough. After lining up, take your finger and press down. You can double check to make sure it's flat to the wall, but that's pretty much it. Now all I need to do is bring the photo over and hang it. I mean, this is so easy I might volunteer to hang yours. Just kidding. I really wanted to see how strong the hangers are. Instead of going around the house making holes everywhere, I decided to make me a test wall. I'm going to use a 25 pound hanger. So right now I'm going to demonstrate the different hangers. 25, 45 and 65 pounds. To test the first hanger, I'm maxing it out with a 25 pound weight. Moving on to the 45 pound hanger, I'm going to hang a 45 pound plate on that. To max out the 65 pound hanger, I'll be using a combination of weights. I started off with a 35 pound plate, then I added a 25, then I added a 5. Now this hanger is holding the exact amount of weight that it's maximized for, 65 pounds. All of the hangers passed the weight rating, which is a good sign. Let's say you want to remove these off the wall. It's pretty simple. Just take a flathead screwdriver and pry it off. Once you pry these off the wall, I would inspect them just to be safe. The rest seems to be intact, which tells me they're reusable. So I don't want to focus on what's best or not. Some hangers are better for certain situations than others. While many of these alternative hangers may have different strengths and weaknesses, there are a few things that they have in common. You generally have to drill out a hole, causing a mess. And if you're not lucky, you could end up in a spot where a stud is. Well, that's an issue because the main reason is you're not able to find a stud, so you go in with a wall anchor. And drilling a hole in a stud and shoving a wall anchor in there would not allow the wall anchor to expand or serve its duty. So you either have to use this hole you just drilled in a stud or move over and drill a new one. Also, if you're not careful, you can cause additional damage to the drywall. I haven't experienced this a lot, but in this case, it did. Even if you're going with a smaller anchor like this one, it's still a hole you have to patch. Not to downplay any of these wall anchors, but the minute you remove them, you have a large hole to patch. So if you're renting a place, you often feel restricted because you don't want to put all these holes in, knowing that you may get charged back later. With the claw drywall hangers, these leave the smallest holes I've seen. So if I have an option to patch these holes or those holes, I think I'm going with the smaller one. The biggest takeaway is to respect the strength, utilize them the right way, understand what you can use them for, for mirrors, artwork, frames, and other heavy home decor items. They're not designed for items to hang more than three inches away from the wall, so no shelves. There's no requirements for tools, no drill, no hammer. Just simply place them on the wall and press it in. If any tools, you might want to use a level to make sure your item is as straight as possible. You don't have to worry about any stud interference, and most importantly, you don't have to worry about no large holes being left. And this is a claw drywall picture hangers. You want to check them out? Check out the links down in the video description. Until next time, see ya.",
  "segments": [
    {
      "start": 0.0,
      "end": 7.0,
      "text": " I've partnered with Claude Drywall Picture Hangers to share a new solution to hang in heavy picture frames, wall art, and mirrors."
    },
    {
      "start": 14.0,
      "end": 18.0,
      "text": " With just a few steps, you can hang photos and artwork on a wall as quickly as I just did."
    },
    {
      "start": 18.0,
      "end": 24.0,
      "text": " Hanging photos on a wall has its challenges. It's time consuming, generally you need tools, and often you leave wall damage."
    },
    {
      "start": 24.0,
      "end": 28.0,
      "text": " Depending on your experience, you may have go-to wall anchors that you're loyal to."
    },
    {
      "start": 28.0,
      "end": 35.0,
      "text": " And speaking from experience, no matter what I've used in the past, nothing is quicker or easier than the Claude Drywall Picture Hangers."
    },
    {
      "start": 35.0,
      "end": 42.0,
      "text": " It's an easy solution for anyone that likes to creatively decorate their space swiftly, even for renters that may be concerned about wall damage."
    },
    {
      "start": 42.0,
      "end": 46.0,
      "text": " Big thanks to Claude Drywall Picture Hangers for sponsoring this video."
    },
    {
      "start": 46.0,
      "end": 52.0,
      "text": " I like these hangers, but I can see some pushing the boundaries of these, and that's why I wanted to give some insight on them."
    },
    {
      "start": 52.0,
      "end": 57.0,
      "text": " There are a few things I'd like to address, and that's giving a quick overview of them, the installation process,"
    },
    {
      "start": 57.0,
      "end": 58.0,
      "text": " and also how to install them."
    },
    {
      "start": 58.0,
      "end": 61.0,
      "text": " I'll also be demonstrating a quick strength test."
    },
    {
      "start": 61.0,
      "end": 65.0,
      "text": " I have three different sizes of hangers, the 25lb, the 45lb, and the 65lb."
    },
    {
      "start": 65.0,
      "end": 72.0,
      "text": " Each package have a different quantity. For example, the 25lb has four hangers, along with the spot markers and instructions."
    },
    {
      "start": 72.0,
      "end": 75.0,
      "text": " The 45lb package has a total of three."
    },
    {
      "start": 75.0,
      "end": 78.0,
      "text": " And the 65lb package comes with a total of two hangers."
    },
    {
      "start": 78.0,
      "end": 83.0,
      "text": " I like the weight being engraved on each hanger, this way you don't have to remember what's what."
    },
    {
      "start": 83.0,
      "end": 87.0,
      "text": " The 25lb and the 45lb looks very similar."
    },
    {
      "start": 87.0,
      "end": 90.0,
      "text": " The hangers are placed in different places, and the sizes are slightly different."
    },
    {
      "start": 90.0,
      "end": 93.0,
      "text": " The 65lbs are noticeably different."
    },
    {
      "start": 93.0,
      "end": 97.0,
      "text": " They're constructed almost like a hinge, and have extra prongs that pierce into the wall."
    },
    {
      "start": 97.0,
      "end": 102.0,
      "text": " The installation is as simple as taking two fingers and pushing it right into the drywall."
    },
    {
      "start": 102.0,
      "end": 108.0,
      "text": " Unlike wall anchors, you never have to worry about a stud being in the way, as long as you're using standard 5-8ths drywall."
    },
    {
      "start": 108.0,
      "end": 111.0,
      "text": " Whatever you put on the wall shouldn't be pulling away from the wall."
    },
    {
      "start": 111.0,
      "end": 116.0,
      "text": " You want to make sure that whatever you put on these hangers are coming straight down."
    },
    {
      "start": 117.0,
      "end": 121.0,
      "text": " I have a space here that I'm going to do a complete installation with no steps skipped."
    },
    {
      "start": 121.0,
      "end": 125.0,
      "text": " Let's say you have your photo, artwork, or whatever you need to post."
    },
    {
      "start": 125.0,
      "end": 128.0,
      "text": " I have a couple sawtooth hangers on the back of this artwork."
    },
    {
      "start": 128.0,
      "end": 135.0,
      "text": " I'll locate the spot markers, and place the gray part down on the artwork, centered up on the sawtooth."
    },
    {
      "start": 135.0,
      "end": 140.0,
      "text": " For frames that may have the D-ring, make a dot on the frame where the nail would normally go."
    },
    {
      "start": 140.0,
      "end": 144.0,
      "text": " Then you'll flip the ring down and place the spot marker."
    },
    {
      "start": 144.0,
      "end": 147.0,
      "text": " Now I'll remove the cover on the white side of the spot marker."
    },
    {
      "start": 147.0,
      "end": 151.0,
      "text": " To make sure this is mounted straight, I taped a small level on top of the photo."
    },
    {
      "start": 151.0,
      "end": 154.0,
      "text": " This way I don't have to be fumbling with the level."
    },
    {
      "start": 154.0,
      "end": 160.0,
      "text": " Once I got the photo straight and to the height that I like, I then push the photo to the wall and pull away."
    },
    {
      "start": 160.0,
      "end": 163.0,
      "text": " Now I'll place a small dot at the bottom of the spot marker."
    },
    {
      "start": 163.0,
      "end": 166.0,
      "text": " And you'll want to repeat that for the other one."
    },
    {
      "start": 166.0,
      "end": 168.0,
      "text": " This would be a good time to remove the spot marker."
    },
    {
      "start": 168.0,
      "end": 174.0,
      "text": " Even though I struggled to get that dot right up in the V-groove, getting close enough seemed to be good enough."
    },
    {
      "start": 174.0,
      "end": 177.0,
      "text": " After lining up, take your finger and press down."
    },
    {
      "start": 177.0,
      "end": 181.0,
      "text": " You can double check to make sure it's flat to the wall, but that's pretty much it."
    },
    {
      "start": 181.0,
      "end": 184.0,
      "text": " Now all I need to do is bring the photo over and hang it."
    },
    {
      "start": 189.0,
      "end": 192.0,
      "text": " I mean, this is so easy I might volunteer to hang yours."
    },
    {
      "start": 192.0,
      "end": 193.0,
      "text": " Just kidding."
    },
    {
      "start": 196.0,
      "end": 199.0,
      "text": " I really wanted to see how strong the hangers are."
    },
    {
      "start": 199.0,
      "end": 204.0,
      "text": " Instead of going around the house making holes everywhere, I decided to make me a test wall."
    },
    {
      "start": 207.0,
      "end": 210.0,
      "text": " I'm going to use a 25 pound hanger."
    },
    {
      "start": 210.0,
      "end": 213.0,
      "text": " So right now I'm going to demonstrate the different hangers."
    },
    {
      "start": 213.0,
      "end": 216.0,
      "text": " 25, 45 and 65 pounds."
    },
    {
      "start": 218.0,
      "end": 221.0,
      "text": " To test the first hanger, I'm maxing it out with a 25 pound weight."
    },
    {
      "start": 226.0,
      "end": 231.0,
      "text": " Moving on to the 45 pound hanger, I'm going to hang a 45 pound plate on that."
    },
    {
      "start": 233.0,
      "end": 236.0,
      "text": " To max out the 65 pound hanger, I'll be using a combination of weights."
    },
    {
      "start": 237.0,
      "end": 242.0,
      "text": " I started off with a 35 pound plate, then I added a 25, then I added a 5."
    },
    {
      "start": 242.0,
      "end": 248.0,
      "text": " Now this hanger is holding the exact amount of weight that it's maximized for, 65 pounds."
    },
    {
      "start": 248.0,
      "end": 251.0,
      "text": " All of the hangers passed the weight rating, which is a good sign."
    },
    {
      "start": 251.0,
      "end": 254.0,
      "text": " Let's say you want to remove these off the wall."
    },
    {
      "start": 254.0,
      "end": 258.0,
      "text": " It's pretty simple. Just take a flathead screwdriver and pry it off."
    },
    {
      "start": 258.0,
      "end": 261.0,
      "text": " Once you pry these off the wall, I would inspect them just to be safe."
    },
    {
      "start": 261.0,
      "end": 264.0,
      "text": " The rest seems to be intact, which tells me they're reusable."
    },
    {
      "start": 264.0,
      "end": 266.0,
      "text": " So I don't want to focus on what's best or not."
    },
    {
      "start": 266.0,
      "end": 269.0,
      "text": " Some hangers are better for certain situations than others."
    },
    {
      "start": 269.0,
      "end": 273.0,
      "text": " While many of these alternative hangers may have different strengths and weaknesses,"
    },
    {
      "start": 273.0,
      "end": 276.0,
      "text": " there are a few things that they have in common."
    },
    {
      "start": 276.0,
      "end": 279.0,
      "text": " You generally have to drill out a hole, causing a mess."
    },
    {
      "start": 279.0,
      "end": 283.0,
      "text": " And if you're not lucky, you could end up in a spot where a stud is."
    },
    {
      "start": 283.0,
      "end": 288.0,
      "text": " Well, that's an issue because the main reason is you're not able to find a stud, so you go in with a wall anchor."
    },
    {
      "start": 288.0,
      "end": 295.0,
      "text": " And drilling a hole in a stud and shoving a wall anchor in there would not allow the wall anchor to expand or serve its duty."
    },
    {
      "start": 296.0,
      "end": 301.0,
      "text": " So you either have to use this hole you just drilled in a stud or move over and drill a new one."
    },
    {
      "start": 301.0,
      "end": 305.0,
      "text": " Also, if you're not careful, you can cause additional damage to the drywall."
    },
    {
      "start": 305.0,
      "end": 308.0,
      "text": " I haven't experienced this a lot, but in this case, it did."
    },
    {
      "start": 308.0,
      "end": 313.0,
      "text": " Even if you're going with a smaller anchor like this one, it's still a hole you have to patch."
    },
    {
      "start": 313.0,
      "end": 318.0,
      "text": " Not to downplay any of these wall anchors, but the minute you remove them, you have a large hole to patch."
    },
    {
      "start": 321.0,
      "end": 325.0,
      "text": " So if you're renting a place, you often feel restricted because you don't want to put all these holes in,"
    },
    {
      "start": 325.0,
      "end": 327.0,
      "text": " knowing that you may get charged back later."
    },
    {
      "start": 327.0,
      "end": 331.0,
      "text": " With the claw drywall hangers, these leave the smallest holes I've seen."
    },
    {
      "start": 331.0,
      "end": 337.0,
      "text": " So if I have an option to patch these holes or those holes, I think I'm going with the smaller one."
    },
    {
      "start": 340.0,
      "end": 344.0,
      "text": " The biggest takeaway is to respect the strength, utilize them the right way,"
    },
    {
      "start": 344.0,
      "end": 350.0,
      "text": " understand what you can use them for, for mirrors, artwork, frames, and other heavy home decor items."
    },
    {
      "start": 350.0,
      "end": 354.0,
      "text": " They're not designed for items to hang more than three inches away from the wall, so no shelves."
    },
    {
      "start": 355.0,
      "end": 358.0,
      "text": " There's no requirements for tools, no drill, no hammer."
    },
    {
      "start": 358.0,
      "end": 361.0,
      "text": " Just simply place them on the wall and press it in."
    },
    {
      "start": 361.0,
      "end": 366.0,
      "text": " If any tools, you might want to use a level to make sure your item is as straight as possible."
    },
    {
      "start": 366.0,
      "end": 371.0,
      "text": " You don't have to worry about any stud interference, and most importantly, you don't have to worry about no large holes being left."
    },
    {
      "start": 371.0,
      "end": 374.0,
      "text": " And this is a claw drywall picture hangers."
    },
    {
      "start": 374.0,
      "end": 377.0,
      "text": " You want to check them out? Check out the links down in the video description."
    },
    {
      "start": 377.0,
      "end": 379.0,
      "text": " Until next time, see ya."
    }
  ],
  "word_count": 1235,
  "duration": 379.0
}