{
  "video_id": "zBM3943UPSE",
  "title": "3M Claw Spot Marker - Does it Work?",
  "text": " So the concept of this spot marker seems interesting. You peel the sticky off of the gray side and you stick it to the back of whatever it is that you're gonna be hanging with the pointy end up against the hardware you'll be hanging off of. In my test picture, I have these little teeth at the top that you hang off of, but when you put it on here, because of the depth of my picture, I can see I'm already gonna have a problem. Peel the white part off. When you push it up against the wall, the white part will stick to the wall and the gray part will remove itself from the back of whatever you're hanging. But I can't make contact against the wall because my teeth are sticking out further than my spot marker. Now, if you had a picture that was flat on the back, I can see how this would work really well. But for me in my test, it didn't really work super well.",
  "segments": [
    {
      "start": 0.0,
      "end": 2.42,
      "text": " So the concept of this spot marker seems interesting."
    },
    {
      "start": 2.72,
      "end": 5.0600000000000005,
      "text": " You peel the sticky off of the gray side"
    },
    {
      "start": 5.0600000000000005,
      "end": 7.28,
      "text": " and you stick it to the back of whatever it is"
    },
    {
      "start": 7.28,
      "end": 9.9,
      "text": " that you're gonna be hanging with the pointy end"
    },
    {
      "start": 9.9,
      "end": 12.52,
      "text": " up against the hardware you'll be hanging off of."
    },
    {
      "start": 12.86,
      "end": 17.12,
      "text": " In my test picture, I have these little teeth at the top"
    },
    {
      "start": 17.12,
      "end": 19.76,
      "text": " that you hang off of, but when you put it on here,"
    },
    {
      "start": 19.84,
      "end": 21.26,
      "text": " because of the depth of my picture,"
    },
    {
      "start": 21.34,
      "end": 23.12,
      "text": " I can see I'm already gonna have a problem."
    },
    {
      "start": 23.36,
      "end": 25.1,
      "text": " Peel the white part off."
    },
    {
      "start": 25.18,
      "end": 26.560000000000002,
      "text": " When you push it up against the wall,"
    },
    {
      "start": 26.72,
      "end": 28.34,
      "text": " the white part will stick to the wall"
    },
    {
      "start": 28.34,
      "end": 30.28,
      "text": " and the gray part will remove itself"
    },
    {
      "start": 30.28,
      "end": 31.98,
      "text": " from the back of whatever you're hanging."
    },
    {
      "start": 32.2,
      "end": 34.54,
      "text": " But I can't make contact against the wall"
    },
    {
      "start": 34.54,
      "end": 36.3,
      "text": " because my teeth are sticking out"
    },
    {
      "start": 36.3,
      "end": 37.6,
      "text": " further than my spot marker."
    },
    {
      "start": 37.9,
      "end": 40.56,
      "text": " Now, if you had a picture that was flat on the back,"
    },
    {
      "start": 40.620000000000005,
      "end": 42.5,
      "text": " I can see how this would work really well."
    },
    {
      "start": 42.66,
      "end": 45.32,
      "text": " But for me in my test, it didn't really work super well."
    }
  ],
  "word_count": 174,
  "duration": 45.32
}