{
  "source_video": "FarahN_Activity2YourStyleandPhilosophy_2025-07-02_012820_1.MOV",
  "text": "So I would say my style is pretty simple. I love a monochromatic look. My house is kind of traditional, but my style is modern, so I kind of like meet it in the middle. I like things just to be zen and calm and welcoming and inviting, and I would say my goals are just to declutter things, make things have meaning. I don't like to have things that just are for decoration. I have artwork to fill the walls because walls need to be filled with space, but I'm not someone who has a lot of clutter on counters and just knickknacks for the sake of it being on the counter. So I often have people say, your house looks like it's show ready to be sold. So I take that as a big compliment. I like things very simple and streamlined and minimalistic, and I'd say that's probably my style.",
  "language": "en",
  "language_probability": 1,
  "duration": 61.85,
  "segments": [
    {
      "start": 1.1,
      "end": 8.5,
      "text": "So I would say my style is pretty simple. I love a monochromatic look. My house is kind of"
    },
    {
      "start": 8.5,
      "end": 15.12,
      "text": "traditional, but my style is modern, so I kind of like meet it in the middle. I like things just to"
    },
    {
      "start": 15.12,
      "end": 23.02,
      "text": "be zen and calm and welcoming and inviting, and I would say my goals are just to declutter things,"
    },
    {
      "start": 23.02,
      "end": 29.56,
      "text": "make things have meaning. I don't like to have things that just are for decoration."
    },
    {
      "start": 30.58,
      "end": 35.74,
      "text": "I have artwork to fill the walls because walls need to be filled with space, but I'm not someone"
    },
    {
      "start": 35.74,
      "end": 43.7,
      "text": "who has a lot of clutter on counters and just knickknacks for the sake of it being on the"
    },
    {
      "start": 43.7,
      "end": 51.94,
      "text": "counter. So I often have people say, your house looks like it's show ready to be sold."
    },
    {
      "start": 53.02,
      "end": 59.42,
      "text": "So I take that as a big compliment. I like things very simple and streamlined and minimalistic,"
    },
    {
      "start": 59.42,
      "end": 61.34,
      "text": "and I'd say that's probably my style."
    }
  ]
}