{
  "source_video": "FarahN_Activity8PainPoints_2025-07-02_083153_1.MOV",
  "text": "So my main frustration that I mentioned in some of the text was that I really can't, it's so dark up there in the attic. I wish I could take you to show you, but it's just so dark and I don't have the proper tools right now to bring my phone up there without falling through the attic. So, but what it is, is basically the insulation made it such a mess and so hard because it sort of is that barrier. We had to like use a ruler to like find the hole once we were up there. So yeah, I mean, definitely locating the exact spot from the attic, that insulation makes it like really difficult to find the hole that you cut out. Like even with the flashlight, like it's just, it's just so dark up there. And it's, it's small up there too. Like the crawl space makes it hard. That's definitely was a frustration. I think that like, yeah, that was just annoying. Cutting the drywall like a little too big. I really should have had like. A proper mold. I should have like gotten cardboard and made a template and I didn't. I used a ruler, but I was like a little bit off. You could kind of tell it's like a tiny bit. If you could see me, if I turn this off, but yeah, I can't zoom. Oh, let me see. Yeah, I can kind of see like there's a little bit of a gap. So just like being, that was a little lazy on my part, cutting that open with the drywall. And drywall is not so easy to cut either. That's probably. I probably did not have a great saw. I used a little drywall saw, which did not have a sharp blade because it needs to be sharpened. So that was definitely a little bit. My, my fault should have had a sharper drywall saw. So, yeah, I mean, that's kind of the, you know, the most frustrating things that I can remember, you know, would have been way more frustrating. Have we not been able to tap into an existing wire, but I guess that just would have meant that, you know, there's a, there's an outlet behind this couch. You just would have ran the wire up through the, the wall. But yeah, those are some frustrations.",
  "language": "en",
  "language_probability": 1,
  "duration": 129.83,
  "segments": [
    {
      "start": 0.43,
      "end": 11.87,
      "text": "So my main frustration that I mentioned in some of the text was that I really can't, it's so dark up there in the attic."
    },
    {
      "start": 11.87,
      "end": 22.09,
      "text": "I wish I could take you to show you, but it's just so dark and I don't have the proper tools right now to bring my phone up there without falling through the attic."
    },
    {
      "start": 22.39,
      "end": 30.17,
      "text": "So, but what it is, is basically the insulation made it such a mess and so hard because it sort of is that barrier."
    },
    {
      "start": 30.17,
      "end": 33.15,
      "text": "We had to like use a ruler to like find the hole once we were up there."
    },
    {
      "start": 34.33,
      "end": 40.69,
      "text": "So yeah, I mean, definitely locating the exact spot from the attic, that insulation makes it like really difficult to find the hole that you cut out."
    },
    {
      "start": 40.69,
      "end": 43.59,
      "text": "Like even with the flashlight, like it's just, it's just so dark up there."
    },
    {
      "start": 44.19,
      "end": 46.01,
      "text": "And it's, it's small up there too."
    },
    {
      "start": 46.13,
      "end": 47.77,
      "text": "Like the crawl space makes it hard."
    },
    {
      "start": 47.93,
      "end": 49.09,
      "text": "That's definitely was a frustration."
    },
    {
      "start": 50.57,
      "end": 53.59,
      "text": "I think that like, yeah, that was just annoying."
    },
    {
      "start": 54.75,
      "end": 57.15,
      "text": "Cutting the drywall like a little too big."
    },
    {
      "start": 57.55,
      "end": 60.01,
      "text": "I really should have had like."
    },
    {
      "start": 60.17,
      "end": 61.19,
      "text": "A proper mold."
    },
    {
      "start": 61.33,
      "end": 64.09,
      "text": "I should have like gotten cardboard and made a template and I didn't."
    },
    {
      "start": 64.17,
      "end": 66.09,
      "text": "I used a ruler, but I was like a little bit off."
    },
    {
      "start": 66.17,
      "end": 68.33,
      "text": "You could kind of tell it's like a tiny bit."
    },
    {
      "start": 69.36,
      "end": 74.97,
      "text": "If you could see me, if I turn this off, but yeah, I can't zoom."
    },
    {
      "start": 75.09,
      "end": 75.95,
      "text": "Oh, let me see."
    },
    {
      "start": 76.03,
      "end": 79.51,
      "text": "Yeah, I can kind of see like there's a little bit of a gap."
    },
    {
      "start": 80.65,
      "end": 87.58,
      "text": "So just like being, that was a little lazy on my part, cutting that open with the drywall."
    },
    {
      "start": 87.64,
      "end": 89.3,
      "text": "And drywall is not so easy to cut either."
    },
    {
      "start": 89.5,
      "end": 90.1,
      "text": "That's probably."
    },
    {
      "start": 90.62,
      "end": 92.5,
      "text": "I probably did not have a great saw."
    },
    {
      "start": 92.58,
      "end": 98.66,
      "text": "I used a little drywall saw, which did not have a sharp blade because it needs to be sharpened."
    },
    {
      "start": 98.72,
      "end": 100.22,
      "text": "So that was definitely a little bit."
    },
    {
      "start": 101.54,
      "end": 105.02,
      "text": "My, my fault should have had a sharper drywall saw."
    },
    {
      "start": 106.94,
      "end": 114.06,
      "text": "So, yeah, I mean, that's kind of the, you know, the most frustrating things that I can remember, you know, would have been way more frustrating."
    },
    {
      "start": 114.12,
      "end": 120.6,
      "text": "Have we not been able to tap into an existing wire, but I guess that just would have meant that, you know,"
    },
    {
      "start": 120.62,
      "end": 122.46,
      "text": "there's a, there's an outlet behind this couch."
    },
    {
      "start": 122.54,
      "end": 126.99,
      "text": "You just would have ran the wire up through the, the wall."
    },
    {
      "start": 127.93,
      "end": 129.71,
      "text": "But yeah, those are some frustrations."
    }
  ]
}