{
  "source_video": "TylrD_Activity2YourStyleandPhilosophy_2025-06-30_044304_1.mov",
  "text": "Hello. So I would describe my style as a little bit more elegant, more sophisticated, but a modern vibe. Specific goals that when it comes to me decorating my space is I want something to make it look a little minimalistic, but also a little bit more open spaced, but with a luxury approach. There aren't really any particular influences or inspirations. However, I do stay in South Florida. So within that, I do stay near a lot of water. So I do like to when it comes to shaping some different choices, I like to find different types of pieces to that are like water pieces or pieces to help bring together that that water look or that beach house look. Thanks so much.",
  "language": "en",
  "language_probability": 1,
  "duration": 51.93,
  "segments": [
    {
      "start": 0.85,
      "end": 10.1,
      "text": "Hello. So I would describe my style as a little bit more elegant, more sophisticated, but a modern"
    },
    {
      "start": 10.1,
      "end": 17.24,
      "text": "vibe. Specific goals that when it comes to me decorating my space is I want something to make"
    },
    {
      "start": 17.24,
      "end": 25.8,
      "text": "it look a little minimalistic, but also a little bit more open spaced, but with a luxury approach."
    },
    {
      "start": 25.8,
      "end": 33.54,
      "text": "There aren't really any particular influences or inspirations. However, I do stay in South Florida."
    },
    {
      "start": 33.54,
      "end": 39.32,
      "text": "So within that, I do stay near a lot of water. So I do like to when it comes to shaping some"
    },
    {
      "start": 39.32,
      "end": 45.64,
      "text": "different choices, I like to find different types of pieces to that are like water pieces or pieces"
    },
    {
      "start": 45.64,
      "end": 51.56,
      "text": "to help bring together that that water look or that beach house look. Thanks so much."
    }
  ]
}