{
  "source_video": "GeneK_Activity9FutureImprovements_2025-06-30_010407_1.webm",
  "text": "I'm not sure if I would do anything different. Of course, it's my greatest desire not to do any structural changes to the walls of the house, including our cutting drywall. But this particular time I did this, but I'm hoping as technology advances and manufacturers able to put, you know, bigger batteries in a smaller kind of footprint where you can just stick them to the wall, almost like those 3M holders and hooks, and then have removal tape for them to just come off when you're done with that. Or somehow attach them with clips, but then make parts of them removable. for recharge, if that's what it is. But for me, having any kind of wires for plugging or anything else, it's a non-starter. I would not be happy and I would not want this. So in the future, I just hope that there's something that just adhesive and sticks to the wall. No drywall cutting required.",
  "language": "en",
  "language_probability": 1,
  "duration": 82.8,
  "segments": [
    {
      "start": 1.04,
      "end": 3.28,
      "text": "I'm not sure if I would do anything different."
    },
    {
      "start": 3.28,
      "end": 12.28,
      "text": "Of course, it's my greatest desire not to do any structural changes to the walls of the house, including our cutting drywall."
    },
    {
      "start": 13.04,
      "end": 23.54,
      "text": "But this particular time I did this, but I'm hoping as technology advances and manufacturers able to put, you know,"
    },
    {
      "start": 23.54,
      "end": 35.56,
      "text": "bigger batteries in a smaller kind of footprint where you can just stick them to the wall, almost like those 3M holders and hooks,"
    },
    {
      "start": 35.56,
      "end": 42.98,
      "text": "and then have removal tape for them to just come off when you're done with that."
    },
    {
      "start": 44.56,
      "end": 53.92,
      "text": "Or somehow attach them with clips, but then make parts of them removable."
    },
    {
      "start": 53.96,
      "end": 58.96,
      "text": "for recharge, if that's what it is."
    },
    {
      "start": 58.96,
      "end": 63.96,
      "text": "But for me, having any kind of wires for plugging or anything else, it's a non-starter."
    },
    {
      "start": 63.96,
      "end": 69.96,
      "text": "I would not be happy and I would not want this."
    },
    {
      "start": 69.96,
      "end": 78.99,
      "text": "So in the future, I just hope that there's something that just adhesive and sticks to the wall."
    },
    {
      "start": 78.99,
      "end": 81.99,
      "text": "No drywall cutting required."
    }
  ]
}