{
  "source_video": "AlysonT_Activity9FutureImprovements_2025-07-06_102808_1.webm",
  "text": "Hello, if I were to do a similar project again, for example, the hard wiring of the recessed can lighting, I guess doing it that way is because in the area where we were installing it, we're very limited with options. So I would like a feature, I would prefer track lighting if we could fit it in that area, but the ceiling is a little bit too low for that. So you always have to take that in consideration, putting in track lighting, how much it's going to drop, you know, down from the ceiling. So having some kind of, I guess, concept. A combo of recessed can lighting, but still having track lighting features that you can adjust it a little bit more subtle or have it multiple lights moving different directions, but then not taking away from the ceiling height. Those are features that I would like to include in the next project. Hopefully I can find something that would work, especially in the situation where you have a lower ceiling and you want some more stylized lighting there.",
  "language": "en",
  "language_probability": 1,
  "duration": 99.78,
  "segments": [
    {
      "start": 0.91,
      "end": 11.04,
      "text": "Hello, if I were to do a similar project again, for example, the hard wiring of the recessed can lighting,"
    },
    {
      "start": 12.04,
      "end": 25.63,
      "text": "I guess doing it that way is because in the area where we were installing it, we're very limited with options."
    },
    {
      "start": 25.63,
      "end": 40.85,
      "text": "So I would like a feature, I would prefer track lighting if we could fit it in that area, but the ceiling is a little bit too low for that."
    },
    {
      "start": 41.85,
      "end": 50.85,
      "text": "So you always have to take that in consideration, putting in track lighting, how much it's going to drop, you know, down from the ceiling."
    },
    {
      "start": 51.85,
      "end": 55.72,
      "text": "So having some kind of, I guess, concept."
    },
    {
      "start": 56.72,
      "end": 79.72,
      "text": "A combo of recessed can lighting, but still having track lighting features that you can adjust it a little bit more subtle or have it multiple lights moving different directions, but then not taking away from the ceiling height."
    },
    {
      "start": 80.72,
      "end": 85.72,
      "text": "Those are features that I would like to include in the next project."
    },
    {
      "start": 86.72,
      "end": 98.72,
      "text": "Hopefully I can find something that would work, especially in the situation where you have a lower ceiling and you want some more stylized lighting there."
    }
  ]
}