{
  "source_video": "WilliamS_Activity2YourStyleandPhilosophy_2025-06-30_100112_1.webm",
  "text": "Okay, so my approach to home decor is one that meets our tastes, my wife and I's tastes, but also one in which people would notice when they come into our home, family or friends, meaning, wow, that's different, that's unique, that's something I might want to do. Inspirations? I would say a couple places inspire us. One would be every year they have a homorama in Cincinnati, Ohio. They show off homes that are amazing, but they have very unique decorative styles. And what we'd like to do is visit those homes and see which styles might fit our needs for our home. Another place would be a furniture store known as Ethan Allen. Ethan Allen is, I'm sure most people know, a very well-known furniture store. We have some pieces there and they have lots of styles and material designs that we are impressed by as well. So that's what inspires us and that's what our goals are.",
  "language": "en",
  "language_probability": 1,
  "duration": 58.5,
  "segments": [
    {
      "start": 3.6,
      "end": 17.08,
      "text": "Okay, so my approach to home decor is one that meets our tastes, my wife and I's tastes, but also one in which people would notice when they come into our home, family or friends, meaning, wow, that's different, that's unique, that's something I might want to do."
    },
    {
      "start": 19.38,
      "end": 33.26,
      "text": "Inspirations? I would say a couple places inspire us. One would be every year they have a homorama in Cincinnati, Ohio. They show off homes that are amazing, but they have very unique decorative styles."
    },
    {
      "start": 33.88,
      "end": 38.22,
      "text": "And what we'd like to do is visit those homes and see which styles might fit our needs for our home."
    },
    {
      "start": 38.92,
      "end": 53.82,
      "text": "Another place would be a furniture store known as Ethan Allen. Ethan Allen is, I'm sure most people know, a very well-known furniture store. We have some pieces there and they have lots of styles and material designs that we are impressed by as well."
    },
    {
      "start": 54.54,
      "end": 57.86,
      "text": "So that's what inspires us and that's what our goals are."
    }
  ]
}