{
  "source_video": "FrederickK_Activity2YourStyleandPhilosophy_2025-07-03_041309_1.mp4",
  "text": "So I've always liked modern, lean modern. Now, obviously not, or not obviously, but not extreme modern. It's just not, you know, suburbs aren't the place where you can pull that off. But I married my wife a few years ago, and I guess she was not as into modern, so it's been a blend. But we made a joke in this last remodeling project. She was really making fun of me, but kind of like, if it's not modern, we don't want it. But, you know, that's not really the end result. Although we've got a lot of kind of like mid-century modern touches, not a lot, maybe some. So I'd say that's kind of how we've been leaning lately. I mean, we get a lot of inspiration off Instagram. When I was younger, it was things like Elle Decor magazine or whatever I could find. I mean, really, I'm not tied into anything. I don't know if there's so much a philosophy other than I am trying a little bit more to find something that I can use. I'm trying to make the house a little more cohesive, keeping not humongous differences between the rooms, although there is differences. You know, the colors are going together pretty well. I don't know. It looks a lot better now because a lot more rooms have been done at the same time. And also, you know, we're older, so we have some more money, which, you know, really it's kind of like the limiting factor. You can only do so much if you don't have the money to do it. So, yeah, I don't know. I don't know if I have a philosophy so much as it just it all looks good. I mean, color is usually the biggest part to me. Like the colors have to go and the colors need to work. I guess the other thing is I've kind of thought like if you have a good piece, you know, good pieces last and you can kind of put them together and you don't have to be so matchy matching. You don't have to be all of the same design or style or even of the time period. So, you know, we redid the kitchen, but I had what I thought was a pretty good light fixture from years before and we kept it and, you know, I imagine we'll continue to do so.",
  "language": "en",
  "language_probability": 1,
  "duration": 136.15,
  "segments": [
    {
      "start": 0.82,
      "end": 3.26,
      "text": "So I've always liked modern, lean modern."
    },
    {
      "start": 4.96,
      "end": 8.44,
      "text": "Now, obviously not, or not obviously, but not extreme modern."
    },
    {
      "start": 8.64,
      "end": 12.02,
      "text": "It's just not, you know, suburbs aren't the place where you can pull that off."
    },
    {
      "start": 13.6,
      "end": 21.78,
      "text": "But I married my wife a few years ago, and I guess she was not as into modern, so it's been a blend."
    },
    {
      "start": 22.92,
      "end": 26.2,
      "text": "But we made a joke in this last remodeling project."
    },
    {
      "start": 26.62,
      "end": 30.6,
      "text": "She was really making fun of me, but kind of like, if it's not modern, we don't want it."
    },
    {
      "start": 31.62,
      "end": 33.94,
      "text": "But, you know, that's not really the end result."
    },
    {
      "start": 35.45,
      "end": 40.71,
      "text": "Although we've got a lot of kind of like mid-century modern touches, not a lot, maybe some."
    },
    {
      "start": 42.61,
      "end": 45.21,
      "text": "So I'd say that's kind of how we've been leaning lately."
    },
    {
      "start": 45.37,
      "end": 47.25,
      "text": "I mean, we get a lot of inspiration off Instagram."
    },
    {
      "start": 47.81,
      "end": 52.47,
      "text": "When I was younger, it was things like Elle Decor magazine or whatever I could find."
    },
    {
      "start": 52.59,
      "end": 55.59,
      "text": "I mean, really, I'm not tied into anything."
    },
    {
      "start": 56.51,
      "end": 62.14,
      "text": "I don't know if there's so much a philosophy other than I am trying a little bit more"
    },
    {
      "start": 62.14,
      "end": 62.16,
      "text": "to find something that I can use."
    },
    {
      "start": 62.16,
      "end": 69.75,
      "text": "I'm trying to make the house a little more cohesive, keeping not humongous differences between the rooms,"
    },
    {
      "start": 69.83,
      "end": 71.55,
      "text": "although there is differences."
    },
    {
      "start": 72.39,
      "end": 75.15,
      "text": "You know, the colors are going together pretty well."
    },
    {
      "start": 76.87,
      "end": 77.23,
      "text": "I don't know."
    },
    {
      "start": 77.61,
      "end": 81.91,
      "text": "It looks a lot better now because a lot more rooms have been done at the same time."
    },
    {
      "start": 82.05,
      "end": 87.81,
      "text": "And also, you know, we're older, so we have some more money, which, you know, really it's kind of like the limiting factor."
    },
    {
      "start": 87.81,
      "end": 91.45,
      "text": "You can only do so much if you don't have the money to do it."
    },
    {
      "start": 92.19,
      "end": 94.36,
      "text": "So, yeah, I don't know."
    },
    {
      "start": 94.4,
      "end": 98.16,
      "text": "I don't know if I have a philosophy so much as it just it all looks good."
    },
    {
      "start": 98.24,
      "end": 100.24,
      "text": "I mean, color is usually the biggest part to me."
    },
    {
      "start": 100.32,
      "end": 103.88,
      "text": "Like the colors have to go and the colors need to work."
    },
    {
      "start": 104.8,
      "end": 116.24,
      "text": "I guess the other thing is I've kind of thought like if you have a good piece, you know, good pieces last and you can kind of put them together and you don't have to be so matchy matching."
    },
    {
      "start": 116.24,
      "end": 122.64,
      "text": "You don't have to be all of the same design or style or even of the time period."
    },
    {
      "start": 123.18,
      "end": 135.24,
      "text": "So, you know, we redid the kitchen, but I had what I thought was a pretty good light fixture from years before and we kept it and, you know, I imagine we'll continue to do so."
    }
  ]
}