{
  "source_video": "GeneK_Activity3ProjectMotivation_2025-06-30_124952_1.webm",
  "text": "I think what inspired me to take on the original project is that we hired the people to do fireplace mantel and install, well, new mantel. We also bought a new picture, piece of art, and we realized that we don't have any lights, no can lights, no other type of lights. There's no light source. So, as people come in into the living room, we wanted accent lighting to draw attention to the fireplace mantel, as well as the new art that hangs right above it. And we also hear family photos standing up on the mantel. So, that was the reason. We just want to add a light source, something that's not too bright, but immediately draws your attention to that. And then we've looked for different options, more specifically, hot wire, not hot wired, all these different choices. And what I didn't want to have is any type of wires hanging on the walls, or also I don't have any ability to create electrical work inside the walls. I would need to hire an electrician for that. So, I didn't want to add all that would add to the cost, and I didn't want to do that.",
  "language": "en",
  "language_probability": 1,
  "duration": 100.14,
  "segments": [
    {
      "start": 0.66,
      "end": 13.8,
      "text": "I think what inspired me to take on the original project is that we hired the people to do fireplace mantel and install, well, new mantel."
    },
    {
      "start": 13.8,
      "end": 28.78,
      "text": "We also bought a new picture, piece of art, and we realized that we don't have any lights, no can lights, no other type of lights."
    },
    {
      "start": 28.86,
      "end": 29.96,
      "text": "There's no light source."
    },
    {
      "start": 30.66,
      "end": 46.62,
      "text": "So, as people come in into the living room, we wanted accent lighting to draw attention to the fireplace mantel, as well as the new art that hangs right above it."
    },
    {
      "start": 46.94,
      "end": 51.44,
      "text": "And we also hear family photos standing up on the mantel."
    },
    {
      "start": 52.18,
      "end": 54.04,
      "text": "So, that was the reason."
    },
    {
      "start": 54.2,
      "end": 60.42,
      "text": "We just want to add a light source, something that's not too bright, but immediately draws your attention to that."
    },
    {
      "start": 60.66,
      "end": 71.9,
      "text": "And then we've looked for different options, more specifically, hot wire, not hot wired, all these different choices."
    },
    {
      "start": 72.22,
      "end": 93.04,
      "text": "And what I didn't want to have is any type of wires hanging on the walls, or also I don't have any ability to create electrical work inside the walls."
    },
    {
      "start": 93.06,
      "end": 95.4,
      "text": "I would need to hire an electrician for that."
    },
    {
      "start": 95.5,
      "end": 99.42,
      "text": "So, I didn't want to add all that would add to the cost, and I didn't want to do that."
    }
  ]
}