{
  "source_video": "FarahN_Activity6Step-by-StepWalkthrough_2025-07-02_082330_1.MOV",
  "text": "Okay so our spotlight is in this room that just doesn't have a lot of light so it's an important one. It really showcases the beauty of this new painting that we got and really to install it above the artwork I kind of started to plan a placement on the ceiling. I knew I wanted to get an adjustable one so I knew the angle wasn't so important for me to get perfectly right which gave me a little bit of flexibility but I definitely had to really decide on this long wall and really just centered it sort of like mid between these two windows so just a little bit of measuring wasn't too complicated. The fact that I had the adjustable light made it so that it wasn't like extremely necessary for me to hit the exact angle. So anyway we actually I tapped into an existing wire that's used for another light and controlled by the same switch so this just made the project a lot easier rather than having to you know basically drop wire and sort of reinvent the wheel. We already just we kind of just went up to the attic and tapped into an existing wire so made it easier from that from that electrical standpoint and then connecting the wires to the light housing and attaching the housing to the ceiling joists and then you know that was fairly easy. We've done that before had a little help from my husband. We adjusted it to be kind of in the spot that the hole was made once we were up there in the attic with a great big attic and then I went down back down to this room and I mounted the spotlight and the circular plate and didn't really do such a great job but still I see if you can tell from the video it's not exactly a hundred percent flush. There's a little bit like a millimeter gap but I just wanted to cover those jagged edges that covered you know when I was cutting the the drywall with the saw. It was very jagged so I was able to cover that and just sort of yeah adjust it to be in that spot where the hole was and coming back in here and putting that that cover on and taking out the the light bulb and sort of just kind of playing around with warm and soft lights and that was also part of the process too. So yeah once everything was secure you know we we mounted it and and turned the power back on and tested it and just adjusted the beam a couple times to highlight the artwork without you know casting shadows and stuff so but I think overall the the project was made pretty easy because we were able to tap into that existing lighting and use that switch.",
  "language": "en",
  "language_probability": 1,
  "duration": 169.17,
  "segments": [
    {
      "start": 0.24,
      "end": 8.6,
      "text": "Okay so our spotlight is in this room that just doesn't have a lot of light so it's an important"
    },
    {
      "start": 8.6,
      "end": 14.9,
      "text": "one. It really showcases the beauty of this new painting that we got and really to install it"
    },
    {
      "start": 14.9,
      "end": 20.6,
      "text": "above the artwork I kind of started to plan a placement on the ceiling. I knew I wanted to get"
    },
    {
      "start": 20.6,
      "end": 25.14,
      "text": "an adjustable one so I knew the angle wasn't so important for me to get perfectly right which gave"
    },
    {
      "start": 25.14,
      "end": 31.92,
      "text": "me a little bit of flexibility but I definitely had to really decide on this long wall and really"
    },
    {
      "start": 31.92,
      "end": 38.4,
      "text": "just centered it sort of like mid between these two windows so just a little bit of measuring"
    },
    {
      "start": 38.4,
      "end": 43.9,
      "text": "wasn't too complicated. The fact that I had the adjustable light made it so that it wasn't like"
    },
    {
      "start": 43.9,
      "end": 50.2,
      "text": "extremely necessary for me to hit the exact angle. So anyway we actually I tapped into an"
    },
    {
      "start": 50.2,
      "end": 55.04,
      "text": "existing wire that's used for another light and controlled by the same switch so"
    },
    {
      "start": 55.04,
      "end": 63.16,
      "text": "this just made the project a lot easier rather than having to you know basically drop wire and"
    },
    {
      "start": 63.16,
      "end": 68.18,
      "text": "sort of reinvent the wheel. We already just we kind of just went up to the attic and tapped into"
    },
    {
      "start": 68.18,
      "end": 76.72,
      "text": "an existing wire so made it easier from that from that electrical standpoint and then connecting"
    },
    {
      "start": 76.72,
      "end": 82.94,
      "text": "the wires to the light housing and attaching the housing to the ceiling joists and then you know"
    },
    {
      "start": 82.94,
      "end": 84.8,
      "text": "that was fairly easy."
    },
    {
      "start": 85.04,
      "end": 91.82,
      "text": "We've done that before had a little help from my husband. We adjusted it to be kind of in the spot"
    },
    {
      "start": 91.82,
      "end": 97.88,
      "text": "that the hole was made once we were up there in the attic with a great big attic and then I went"
    },
    {
      "start": 97.88,
      "end": 104.84,
      "text": "down back down to this room and I mounted the spotlight and the circular plate and didn't really"
    },
    {
      "start": 104.84,
      "end": 111.08,
      "text": "do such a great job but still I see if you can tell from the video it's not exactly a hundred"
    },
    {
      "start": 111.08,
      "end": 114.14,
      "text": "percent flush. There's a little bit like a millimeter gap but"
    },
    {
      "start": 115.04,
      "end": 121.22,
      "text": "I just wanted to cover those jagged edges that covered you know when I was cutting the the drywall"
    },
    {
      "start": 121.22,
      "end": 127.94,
      "text": "with the saw. It was very jagged so I was able to cover that and just sort of yeah adjust it to be"
    },
    {
      "start": 127.94,
      "end": 136.1,
      "text": "in that spot where the hole was and coming back in here and putting that that cover on and taking"
    },
    {
      "start": 136.1,
      "end": 143.18,
      "text": "out the the light bulb and sort of just kind of playing around with warm and soft lights and that"
    },
    {
      "start": 143.18,
      "end": 144.92,
      "text": "was also part of the process too."
    },
    {
      "start": 145.04,
      "end": 151.76,
      "text": "So yeah once everything was secure you know we we mounted it and and turned the power back on and"
    },
    {
      "start": 151.76,
      "end": 157.46,
      "text": "tested it and just adjusted the beam a couple times to highlight the artwork without you know"
    },
    {
      "start": 157.46,
      "end": 163.34,
      "text": "casting shadows and stuff so but I think overall the the project was made pretty"
    },
    {
      "start": 163.34,
      "end": 168.98,
      "text": "easy because we were able to tap into that existing lighting and use that switch."
    }
  ]
}