{
  "source_video": "TiffanyO_Q1_2025-06-19_112125_1.mov",
  "text": "So my picture lights is one of my favorite projects that I did so far. I wanted to highlight the framing of these pictures that I got done about 10 years ago and I just wanted to be creative because I do change my different rooms in my house a lot because my house is full of lots of color. My living room wall is green. My dining room is red. My front room is brown. So I wanted to highlight the stark contrast of the black paintings that I do have against the green wall with the white border. And I wanted to highlight them because a lot of people come visit me and everything and they don't really notice it. But I feel like with the lighting, they will take notice. And I think there are beautiful art pieces. The photography is amazing. And I think that with having the lights here, it actually elevates my house. It makes it more like almost like a museum in a way. And I picked these picture lights because number one, they were very easy. And even though they did come with a bracket, I'm very creative in and out because I do change things all the time. I use some cut the light off. I did use some sticky tape to put on the top of the frame to make sure that the light actually hits the frames instead of being behind it. And I'm really just like really proud of them. And the reason why I like this so much. It's because it one number one, it comes with a remote control so I can change the lighting and the tone of the frame. And also has a timer. So I like that as well. So I can add different colors. I want to and just play around with it. I do want to add some more Pictures and framing some to my wall because I do have a large Open space up there that I want to add some artwork to and these picture frames were super cheap. Off Amazon and their USB rechargeable. So whenever I need to recharge them, I can just take them down and charge them and I just love the fact that, again, it comes with a remote control and I can just dim and change the light whenever I want to, so I didn't do the middle one, just because I want to see how well the other two look first. Because I don't want to put too much and then I kind of just want to have like a little dark in the middle. So people will have to come and see What the middle one was. So it's kind of want to be a little mysterious. So again, this is my picture lighting and it's been my favorite and most rewarding one so far. Thanks.",
  "language": "en",
  "language_probability": 1,
  "duration": 202.36,
  "segments": [
    {
      "start": 0.75,
      "end": 26.6,
      "text": "So my picture lights is one of my favorite projects that I did so far. I wanted to highlight the framing of these pictures that I got done about 10 years ago and I just wanted to be creative because I do change my different rooms in my house a lot because my house is full of lots of color."
    },
    {
      "start": 26.6,
      "end": 44.75,
      "text": "My living room wall is green. My dining room is red. My front room is brown. So I wanted to highlight the stark contrast of the black paintings that I do have against the green wall with the white border."
    },
    {
      "start": 45.53,
      "end": 55.29,
      "text": "And I wanted to highlight them because a lot of people come visit me and everything and they don't really notice it. But I feel like with the lighting, they will take notice."
    },
    {
      "start": 56.17,
      "end": 56.37,
      "text": "And"
    },
    {
      "start": 56.73,
      "end": 58.39,
      "text": "I think there are beautiful art pieces."
    },
    {
      "start": 60.28,
      "end": 78.46,
      "text": "The photography is amazing. And I think that with having the lights here, it actually elevates my house. It makes it more like almost like a museum in a way. And I picked these picture lights because number one, they were very easy."
    },
    {
      "start": 79.9,
      "end": 86.86,
      "text": "And even though they did come with a bracket, I'm very creative in and out because I do change things all the time."
    },
    {
      "start": 86.98,
      "end": 89.22,
      "text": "I use some"
    },
    {
      "start": 90.08,
      "end": 91.0,
      "text": "cut the light off."
    },
    {
      "start": 93.86,
      "end": 103.47,
      "text": "I did use some sticky tape to put on the top of the frame to make sure that the light actually hits the frames instead of being behind it."
    },
    {
      "start": 105.28,
      "end": 117.34,
      "text": "And I'm really just like really proud of them. And the reason why I like this so much. It's because it one number one, it comes with a remote control so I can change the lighting and the tone of the"
    },
    {
      "start": 119.99,
      "end": 120.65,
      "text": "frame."
    },
    {
      "start": 121.85,
      "end": 123.13,
      "text": "And also has a timer."
    },
    {
      "start": 124.07,
      "end": 137.52,
      "text": "So I like that as well. So I can add different colors. I want to and just play around with it."
    },
    {
      "start": 140.57,
      "end": 142.41,
      "text": "I do want to add some more"
    },
    {
      "start": 143.69,
      "end": 148.31,
      "text": "Pictures and framing some to my wall because I do have a large"
    },
    {
      "start": 149.75,
      "end": 156.21,
      "text": "Open space up there that I want to add some artwork to and these picture frames were super cheap."
    },
    {
      "start": 156.23,
      "end": 172.35,
      "text": "Off Amazon and their USB rechargeable. So whenever I need to recharge them, I can just take them down and charge them and I just love the fact that, again, it comes with a remote control and I can just dim and change the light whenever I want to, so"
    },
    {
      "start": 174.55,
      "end": 180.84,
      "text": "I didn't do the middle one, just because I want to see how well the other two look first."
    },
    {
      "start": 181.38,
      "end": 187.08,
      "text": "Because I don't want to put too much and then I kind of just want to have like a little dark in the middle. So people will have to come and see"
    },
    {
      "start": 187.32,
      "end": 201.84,
      "text": "What the middle one was. So it's kind of want to be a little mysterious. So again, this is my picture lighting and it's been my favorite and most rewarding one so far. Thanks."
    }
  ]
}