{
  "source_video": "MarkR_Activity10Writealetter_2025-06-30_120240_1.mov",
  "text": "If I had a friend that was doing a similar project, I would say get in early in the process to the home as it's being built. Mark the areas that you want to mark for the lighting that you want. Maybe even go out and purchase some of the lighting and go into the house and put it up. You know, have someone hold it so you can see what it's going to look like. Make sure it fits in the space. I did a good job. I have no complaints, but I have that sense of kind of design style that helps me to decide what works and what doesn't work. But definitely I would say get into the house early enough. Decide where you want your light fixtures, where you want your lighting. What kind of message are you trying to get across in each particular space? Decide whether you want warm. Bright, bright white. That's going to make a huge difference. And then buy some pieces and kind of do your best to see what it looks like so you know you've made the right decisions and choices. For me, it's an easy process. Again, when you have a sense of design, it makes it easier. But again, for a friend, plan. Make sure you know what kind of mood and vibe you want to give. Make sure you know what kind of mood and vibe you want to give to that specific space. And try and get in as early as possible so you can get an idea of what it's going to look like before it's final and complete so you can make any alterations and adjustments along the way.",
  "language": "en",
  "language_probability": 1,
  "duration": 100.01,
  "segments": [
    {
      "start": 0.0,
      "end": 6.34,
      "text": "If I had a friend that was doing a similar project, I would say get in early in the process"
    },
    {
      "start": 6.34,
      "end": 14.13,
      "text": "to the home as it's being built. Mark the areas that you want to mark for the lighting that you"
    },
    {
      "start": 14.13,
      "end": 22.75,
      "text": "want. Maybe even go out and purchase some of the lighting and go into the house and put it up."
    },
    {
      "start": 23.7,
      "end": 27.62,
      "text": "You know, have someone hold it so you can see what it's going to look like. Make sure it fits"
    },
    {
      "start": 27.62,
      "end": 35.52,
      "text": "in the space. I did a good job. I have no complaints, but I have that sense of kind of"
    },
    {
      "start": 35.52,
      "end": 41.6,
      "text": "design style that helps me to decide what works and what doesn't work. But definitely I would say"
    },
    {
      "start": 41.6,
      "end": 47.86,
      "text": "get into the house early enough. Decide where you want your light fixtures, where you want your"
    },
    {
      "start": 47.86,
      "end": 55.81,
      "text": "lighting. What kind of message are you trying to get across in each particular space? Decide whether"
    },
    {
      "start": 55.81,
      "end": 57.01,
      "text": "you want warm."
    },
    {
      "start": 57.85,
      "end": 67.38,
      "text": "Bright, bright white. That's going to make a huge difference. And then buy some pieces and kind of"
    },
    {
      "start": 67.38,
      "end": 74.26,
      "text": "do your best to see what it looks like so you know you've made the right decisions and choices."
    },
    {
      "start": 74.68,
      "end": 80.32,
      "text": "For me, it's an easy process. Again, when you have a sense of design, it makes it easier. But"
    },
    {
      "start": 80.8,
      "end": 87.88,
      "text": "again, for a friend, plan. Make sure you know what kind of mood and vibe you want to give."
    },
    {
      "start": 88.3,
      "end": 99.58,
      "text": "Make sure you know what kind of mood and vibe you want to give to that specific space. And try and get in as early as possible so you can get an idea of what it's going to look like before it's final and complete so you can make any alterations and adjustments along the way."
    }
  ]
}