{
  "source_video": "FarahN_Activity5LightingChoices_2025-07-02_080337_1.MOV",
  "text": "So ultimately, um, when it comes to this kind of lighting, I did have a lot of choices. I was on Instagram, social media, I was on sites like Home Depot, even YouTube. Um, I looked at different track lighting. I looked at different, um, antique, more of a fixture lighting as a spotlight. Um, and I looked at things, yeah, just like directly mounted above the piece, above the artwork, um, versus in the wall. Um, and I ultimately decided just to do this simplicity of a, just a standard traditional directional spotlight because I didn't want it to distract from the artwork. And I was just afraid that people were going to, or myself, um, was going to like look at the space and just focus on the brass or the chrome or whatever metal I decided on. Um, and I really wanted it more flush and simplistic because the decor of the room is very simplistic. So, um, I wanted that sort of direction, that control, the directionality of the light to go right onto the artwork and sort of render just a pop of brightness on the artwork. So, um, I think it just integrates well with the environment overall. Um, and you know, just the textures, the color, the dimension of the artwork really just lended itself to the simplistic way of just having that spotlight right on it.",
  "language": "en",
  "language_probability": 1,
  "duration": 81.05,
  "segments": [
    {
      "start": 0.62,
      "end": 7.12,
      "text": "So ultimately, um, when it comes to this kind of lighting, I did have a lot of choices. I was on"
    },
    {
      "start": 7.12,
      "end": 12.48,
      "text": "Instagram, social media, I was on sites like Home Depot, even YouTube. Um, I looked at different"
    },
    {
      "start": 12.48,
      "end": 17.64,
      "text": "track lighting. I looked at different, um, antique, more of a fixture lighting as a spotlight."
    },
    {
      "start": 18.3,
      "end": 24.0,
      "text": "Um, and I looked at things, yeah, just like directly mounted above the piece, above the artwork,"
    },
    {
      "start": 24.0,
      "end": 31.86,
      "text": "um, versus in the wall. Um, and I ultimately decided just to do this simplicity of a,"
    },
    {
      "start": 32.34,
      "end": 37.66,
      "text": "just a standard traditional directional spotlight because I didn't want it to distract from the"
    },
    {
      "start": 37.66,
      "end": 42.88,
      "text": "artwork. And I was just afraid that people were going to, or myself, um, was going to like look"
    },
    {
      "start": 42.88,
      "end": 49.3,
      "text": "at the space and just focus on the brass or the chrome or whatever metal I decided on. Um, and I"
    },
    {
      "start": 49.3,
      "end": 53.9,
      "text": "really wanted it more flush and simplistic because the decor of the room is very simplistic."
    },
    {
      "start": 54.0,
      "end": 60.42,
      "text": "So, um, I wanted that sort of direction, that control, the directionality of the light to go"
    },
    {
      "start": 60.42,
      "end": 69.04,
      "text": "right onto the artwork and sort of render just a pop of brightness on the artwork. So, um, I think"
    },
    {
      "start": 69.04,
      "end": 74.24,
      "text": "it just integrates well with the environment overall. Um, and you know, just the textures,"
    },
    {
      "start": 74.34,
      "end": 79.4,
      "text": "the color, the dimension of the artwork really just lended itself to the simplistic way of just"
    },
    {
      "start": 79.4,
      "end": 80.96,
      "text": "having that spotlight right on it."
    }
  ]
}