[
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "ges_5EwCJYc",
    "content_type": "video",
    "title": "Coach Dan Gable discusses Yellowblue LED lighting at his museum",
    "description": "“Our new LED lights are the best, and I couldn’t believe how much they improved the museum,” states Dan Gable, the museum’s namesake and legendary gold medal Olympic wrestler, NCAA champion coach and Presidential Medal of Freedom Recipient. “The updated LED lighting highlights each display perfectly and offers an open, comfortable space visitors really want to spend time in and enjoy.” \n\nDuring a $1.5 million dollar remodel funded by donations, the National Wrestling Hall of Fame Dan Gable Museum in Waterloo, Iowa installed $100K in new, LED lights from yellowblue LED, replacing all of the old, incandescent lighting in the building. \n\n“After a seamless installation process, the new LED lights created an ambiance that really highlights the museum artifacts and provides a cooler, safer space for our employees and visitors,” states Coach Jim Miller, the Dan Gable National Wrestling Hall of Fame Director. “Best of all, we saved over 65% on our energy bills and eliminated the hassles and expense of bulb replacement and maintenance fees.”\n\nThe museum now uses approximately 65% less energy to power the new LED lighting and emits 70% less heat with the upgrade, saving thousands each year on their utility bills.\n\n“As a huge fan of wrestling and all that Dan Gable has contributed to the world, especially our local area, it has been a huge honor to help the museum offer a better experience for visitors and reduce energy costs,” states Craig Schwienebart, yellowblue Eco Tech President.\n\nCurrently, yellowblue LED serves the entire Midwest and more and plans to expand significantly in 2022. To learn more, and see the exclusive interview with Coach Dan Gable, visit https://yellowblueled.com/coach-dan-gable-yellowblue-led/. \n\nDiscover how LED lighting can help you save money, boost productivity, increase safety, and more cost-effectively with yellowblue LED lighting, https://www.yellowblueled.com.",
    "url": "https://youtube.com/watch?v=ges_5EwCJYc",
    "view_count": 49,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2022-08-01T18:49:12Z",
    "metadata": {
      "duration": "PT3M23S",
      "thumbnail_url": "https://i.ytimg.com/vi/ges_5EwCJYc/hqdefault.jpg",
      "tags": [
        "LED lighting",
        "LED commercial lighting",
        "LED lights",
        "LEDs",
        "LED lighting Iowa",
        "Dan Gable",
        "Coach Dan Gable",
        "National Wrestling Hall of Fame",
        "Wrestling"
      ],
      "category_id": "22",
      "default_language": "en-US",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "E3tAnN071EE",
    "content_type": "video",
    "title": "Have Fun and Control Your LED Career!",
    "description": "Do you want a career where you can control your hours, earn a high salary and be part of the growing LED lighting industry? \n\nCheck out this quick interview with John Hutchroft and Melanie Rembrandt to find out more. Yellowblue LED has opportunities available now.\n\nFor more information, visit https://www.yellowblueled.com.",
    "url": "https://youtube.com/watch?v=E3tAnN071EE",
    "view_count": 50,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2022-07-05T19:56:44Z",
    "metadata": {
      "duration": "PT5M",
      "thumbnail_url": "https://i.ytimg.com/vi/E3tAnN071EE/hqdefault.jpg",
      "tags": [
        "LED lighting",
        "LED commercial lighting",
        "LED",
        "LED lights",
        "LED career",
        "sales"
      ],
      "category_id": "22",
      "default_language": "en-US",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "YFKuyNV8raY",
    "content_type": "video",
    "title": "Dan Gable and YellowBlue LED Lighting Help Schools",
    "description": "Olympic gold wrestler, Dan Gable, is teaming up with YellowBlue LED to help schools provide better lighting for their students. LED lighting provides a safer, healthier environment for learning. Learn more at https://www.yellowblueled.com.",
    "url": "https://youtube.com/watch?v=YFKuyNV8raY",
    "view_count": 27,
    "like_count": 1,
    "comment_count": 0,
    "published_at": "2022-05-24T11:23:27Z",
    "metadata": {
      "duration": "PT21S",
      "thumbnail_url": "https://i.ytimg.com/vi/YFKuyNV8raY/hqdefault.jpg",
      "tags": [
        "LED lighting",
        "LED commercial lighting",
        "LED lighting mini wall pack",
        "LED",
        "LED lights"
      ],
      "category_id": "22",
      "default_language": "en-US",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "9HeCa7zeHf8",
    "content_type": "video",
    "title": "How can LED lighting save money and improve productivity? Find out here.",
    "description": "Hi. I'm Dan Gable, Olympic gold wrestler.\n\nAnd I'm Craig Schwienbart, president of Yellowblue LED.\n\nWe're all interested in performing our best at everything we do… and that includes how you run your business.\n\nYellowblue LED lighting solutions is helping companies all over the U.S. perform better with new LED lighting for their offices, manufacturing facilities, warehouses, and exterior parking lots.\n\nIt's really been an update to our atmosphere and the work conditions for our employees, better working conditions and more friendly. I think it's just a more positive atmosphere for our employees to work in.\n\nLED lighting uses significantly less energy than standard fluorescent or incandescent lights you may be using now.\n\nThe savings and the service that we would receive from Yellowblue LED is what made us decide to go with them. It was effortless, painless and seamless for Grinnell Mutual.\n\nAnd that's not only good for the environment but good for your bottom line, too.\n\nVisit our website to learn how Yellowblue LED lighting systems can help your business perform better.\n\nQuit stalling and visit the website today!\n\nDiscover how LED lighting can help you save money, boost productivity and more cost-effectively with yellowblue LED lighting, https://www.yellowblueled.com.",
    "url": "https://youtube.com/watch?v=9HeCa7zeHf8",
    "view_count": 27,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-20T14:10:40Z",
    "metadata": {
      "duration": "PT1M1S",
      "thumbnail_url": "https://i.ytimg.com/vi/9HeCa7zeHf8/hqdefault.jpg",
      "tags": [
        "LED lighting",
        "LED commercial lighting",
        "LED lighting mini wall pack",
        "LED"
      ],
      "category_id": "22",
      "default_language": "en-US",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "hVh1eid3NZU",
    "content_type": "video",
    "title": "LED Lighting Mini Wall Pack from yellowblueLED. What can it do for you?",
    "description": "Eric Mortensen of yellowblue LED explains how a simple, LED Lighting Mini Wall Pack can provide extensive benefits in just a few minutes!\n\nWe're back on the back side of this building. And every building has something called Universal Building Code, which requires every entry door to an industrial, commercial, or retail building to be lit with a light. And as you can see, we've got an old directional floodlight above us. And we're going to replace that with a mini LED wall pack, again, saving this facility substantial amounts of energy and money all the while, while improving the aesthetics and appearance.\n\nFor more information on how LED lighting can help you, visit https://www.yellowblueled.com.",
    "url": "https://youtube.com/watch?v=hVh1eid3NZU",
    "view_count": 46,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:26:26Z",
    "metadata": {
      "duration": "PT28S",
      "thumbnail_url": "https://i.ytimg.com/vi/hVh1eid3NZU/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en-US",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "kHIZmJjzo4E",
    "content_type": "video",
    "title": "Do you have LED lighting in your parking lot?",
    "description": "Learn more about what LED lighting can do for your parking lot in this short video.\n\nEric Mortensen explains the difference LED lighting can make in a parking lot. LEDs can create a safer, brighter environment for customers, employees and more.\n\nWe're here today to show you some of our new exciting commercial LED products that we have coming your way. I'm standing here, holding in my hand a shoebox parking lot or street light replacement. \n\nThis would replace a shoebox like we might see up here on this post behind me. And what's really nice about these is, number one, as you can see, it's a lot sleeker and a lot nicer looking than the big old shoeboxes. \n\nShoeboxes in the past required a big metal headlight lamp inside. And then the reason they have the box over them is because they have a big reflector that reflects all the wasted light that would go up, back down. So, it's a very inefficient technology. And this is a very efficient technology to replace it with. It's going to look better, produce better light, save vast amounts of energy. And this is what your customers want. This is what your customers need. So, come on everybody. Let's come to the light.\n\nFor more information, visit https://www.yellowblueled.com.",
    "url": "https://youtube.com/watch?v=kHIZmJjzo4E",
    "view_count": 15,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:26:06Z",
    "metadata": {
      "duration": "PT1M5S",
      "thumbnail_url": "https://i.ytimg.com/vi/kHIZmJjzo4E/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "bP0u-yduj-A",
    "content_type": "video",
    "title": "How can LED PL lamps help you?",
    "description": "In many commercial, industrial, and retail environments, we will find what's known as PL lamps. And PL lamps are found in recessed fixtures, or otherwise known as can fixtures, like we see above us. In this particular case, we have horizontal PL lamps, which means they're going to go in and plug in horizontally and shine the light downward directionally. \n\nWe do have a few varieties of PL lamps. Occasionally, we'll find a vertical PL lamp, which will plug in vertically and shine the light, again, directionally down. So, there are two options in PL lamps. Make sure you look for these in commercial, industrial, and retail environments.\n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=bP0u-yduj-A",
    "view_count": 23,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:25:44Z",
    "metadata": {
      "duration": "PT43S",
      "thumbnail_url": "https://i.ytimg.com/vi/bP0u-yduj-A/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "yu4Phne4xV0",
    "content_type": "video",
    "title": "Do you need a mini LED Wall Pack?",
    "description": "In this short video, Eric Mortensen explains the use of a mini LED Wall Pack.\n\nOkay, we're still here on the same property. And as you can see above us, we had some shoeboxes that were located above the sidewalk adjacent to the parking lot here. We did have a couple of options for LED retrofits for these shoeboxes. And in this case, we opted to go with the standard LED wall pack for a very particular reason. \n\nThe shoebox above us is only illuminating the sidewalk below us. And it's not really helping the parking lot see any light. So, as people exit the building in the evenings in low-light areas or low-light times of the year, they're out there in the parking lot. They may be fumbling with their keys, trying to get into their cars. So, we're going to install a standard wall pack that is not only going to send light down to the sidewalk but also out to the parking lot, improving the overall aesthetics of this building.\n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=yu4Phne4xV0",
    "view_count": 10,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:25:22Z",
    "metadata": {
      "duration": "PT53S",
      "thumbnail_url": "https://i.ytimg.com/vi/yu4Phne4xV0/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "P_gF2ZTfp2g",
    "content_type": "video",
    "title": "Fluorescent vs LED lights in Coon Rapids",
    "description": "Discover the benefits of replacing your fluorescent lights with LEDs in this short video. \n\nHi there. This is Troy Downey. I am an agent for Yellowblue LED. We're here at Coon Rapids Real Estate and Insurance. We've got an LED job that we're doing a conversion on over here. We're about half done. We'd like to show you the difference between the fluorescents and the LED. Why don't we go on inside and see the difference?\n\nOkay, if we walk over here, we can see that this is the LED side. As you can tell, the walls look really clean here. The floors look a lot cleaner on this side. \n\nIf we go over to the fluorescent side, you can tell that the true color of the walls is not visible because of the yellowness of the fluorescents. The fluorescents actually lose 30% of their light capacity within the first six months. And these lights have been in here for quite a long time. So, the brightness and the color has gone away from the fluorescent lights, which makes everything look yellow and dirty as you can see. \n\nThis John Heydon. He's actually my insurance agent. \nHi John.\nHi. I would just like to ask John a few questions about whether he likes the light or not. So, John, what do you think of the light?\n\nYeah, it's a lot better. Lighting-wise, it's easy to read. It really cleans it up in here I think. It's not so dark and dim as it used to be. But, it's just a cleaner light, easier to read. We do a lot of paperwork. We're looking at that. It's a little easier on the eyes I think with it. I noticed that.\n\nPerfect.\n\nYeah, it's been a good change.\n\nWell, I would say we're really happy with the lights - just the difference. It has been fun seeing the difference in what our old lights look like versus what the new lights look like, how orange or yellow the older lights look, and how dirty or dingy everything looks and how clean and bright everything looks with the new lights. So, we're excited to get the rest of them finished. And I'm excited to see what it does to our bills.\n\nGreen is awesome. \nLight it up. \n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=P_gF2ZTfp2g",
    "view_count": 17,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:24:59Z",
    "metadata": {
      "duration": "PT2M52S",
      "thumbnail_url": "https://i.ytimg.com/vi/P_gF2ZTfp2g/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "aCewByK_PqY",
    "content_type": "video",
    "title": "Learn about the yellowblue LED 2x4 ballast bypass",
    "description": "Hi. My name is Kel Durham with Yellowblue LED. Right now, I'm going to show you guys how to change out the fixtures. The first thing you want to do is you want to take out all your bulbs. Once you have all your bulbs taken out, you'll want to disconnect the power from the ballast and cap it immediately. The black is going to be your power. So, you cut the black, separate it from all the other wires, and get it to your desired length. I'm just going to cut that there.\n\nAfter that, you're going to do the same thing with the white wire - the negative. After that, you pretty much just get the entire fixture down from all existing wires. So, right there, we just bypassed the ballast. So, all your power is connected to this red and this white right here. So, what you're going to want to do is take out these old tombstones, replace them with new tombstones, and then piggy back each one to each other. And then one of the tombstones, you're going to have wires running out of. Your red is going to go to your red. And your blue is going to go to your white to provide the power since we bypassed the ballast. This is the step that takes the longest here. So, bear with me.\n\nSo, you're going to cut those to size?\n\nYes. You'll want to keep one color to one side, so my blues are on your guys’ left. So, I'll put this blue on the left again, piggy back it to this one here. I'll do the same thing with my reds except for the right-hand side.\n\nAnd you can choose either this one or this one. I'll just do this one for convenience out of this little notch right here. It's all ready to be hooked up.\n\nSo, here's what your tombstones are going to look like after they're rewired. I've got my blues on the right hand of each tombstone. So, I've got the blue running to the blue here, this blue here running to this blue. I've got this blue piggy backed out to the power supply - the neutral. This is going to be my positive except these are all on the left. It's all ready to be installed now.\n\nSo, when I plug those bulbs in, it's immediate light?\n\nYou're going to put this end right here, labeled with the \"L\", on the end. This has got all our power. These are our single-ended tubes. I loaded all of my power to this right end here. So, make sure you're hooking up the right end to the right power. \n\n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=aCewByK_PqY",
    "view_count": 13,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:24:37Z",
    "metadata": {
      "duration": "PT6M28S",
      "thumbnail_url": "https://i.ytimg.com/vi/aCewByK_PqY/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "iVXlq4aXuGw",
    "content_type": "video",
    "title": "Beneventi Chevrolet switches to Yellowblue LED",
    "description": "I'm Don Beneventi of Beneventi Chevrolet in Granger. We recently made the switch to LED lighting. We purchased them from Yellowblue. We've had a very good experience. The lighting has saved us approximately $1,000 a month. I made the switch to Yellowblue LED lighting and you should too.\n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=iVXlq4aXuGw",
    "view_count": 3,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:24:11Z",
    "metadata": {
      "duration": "PT31S",
      "thumbnail_url": "https://i.ytimg.com/vi/iVXlq4aXuGw/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "F3AVJInMsDc",
    "content_type": "video",
    "title": "Bridal Connection Improves Bride Experience With LED Lights",
    "description": "Hello. I'm Lara Bunkers. I'm the owner of the Bridal Connection in Ankeny, Iowa. We pride ourselves on one amazing bridal experience that only the Bridal Connection offers. Now, our experience for our brides is even better... Thanks to Yellowblue. We are so excited to have the new lighting in our location. The dresses look spectacular. The beading just glistens. And the brides look absolutely amazing thanks to the new LED lighting within our store. I made the switch to Yellowblue LED. You should, too.\n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=F3AVJInMsDc",
    "view_count": 13,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:23:44Z",
    "metadata": {
      "duration": "PT37S",
      "thumbnail_url": "https://i.ytimg.com/vi/F3AVJInMsDc/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "MR-UMsUDXhM",
    "content_type": "video",
    "title": "Iowa Fire Equipment Co. Discusses LED Lighting",
    "description": "Our company is Iowa Fire Equipment Company. Our lighting here was kind of yellow and dim. We were approached by Yellowblue LED. They're the ones that we chose to do our lighting, and we're very, very impressed with the change. After we put the new lighting in, it seems like the employees take a little bit more pride in their area. It's kept more orderly. It's neater. It's cleaner. We made the switch to Yellowblue LED.\n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=MR-UMsUDXhM",
    "view_count": 9,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:23:17Z",
    "metadata": {
      "duration": "PT30S",
      "thumbnail_url": "https://i.ytimg.com/vi/MR-UMsUDXhM/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "UPq0fafcWI8",
    "content_type": "video",
    "title": "Amy's School of Dance and LED Lighting",
    "description": "Welcome to Amy's School of Dance. I am Amy Murphy, the owner of Amy's School of Dance here in Huxley, Iowa. We have been in Huxley for 20 years. This is our 20th year. And we have ballet, tap, jazz, tumbling. And we also have a theater program. We have a competition group. We have an elite group. We have a company group. We have dancing for two-year-old's up to any age, really. \n\nAs you can see, we do have lots of lights in our studio. And one of the lighting specialists came to me and was wanting to talk to me about helping us save money on our lighting. And each room has so much lighting. And I'm always about saving money, saving the earth. And actually, I used to have little signs around my light switches - \"Let's be green and turn our lights off,\" and have to go around turning lights off around the kids. \n\nI didn't even think twice about it. Because once she showed me the rebate and the understanding of how I could save money, I was like, \"Of course. Why wouldn't I?\"\n\nI have a dream to open up my own performing arts school. And that money that I'm going to save will really help towards building that school. I made the switch to Yellowblue LED, and you should too. \n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=UPq0fafcWI8",
    "view_count": 20,
    "like_count": 1,
    "comment_count": 0,
    "published_at": "2021-10-19T15:21:46Z",
    "metadata": {
      "duration": "PT1M29S",
      "thumbnail_url": "https://i.ytimg.com/vi/UPq0fafcWI8/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "FOSJeLm9hDY",
    "content_type": "video",
    "title": "LED Lights Improve Amy's School of Dance",
    "description": "Dance studio switches to LED lighting and saves money!\n\nI am Amy Murphy, the owner of Amy's School of Dance. As you can see, we do have lots of lights in our studio. And one of the lighting specialists came to me and was wanting to talk to me about helping us save money on our lighting. I didn't even think twice about it. Because once he showed me the rebate and the understanding of how I could save money, I was like, \"Of course. Why wouldn't I?\" I made the switch to Yellowblue LED, and you should too.\n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=FOSJeLm9hDY",
    "view_count": 12,
    "like_count": 1,
    "comment_count": 0,
    "published_at": "2021-10-19T15:21:00Z",
    "metadata": {
      "duration": "PT36S",
      "thumbnail_url": "https://i.ytimg.com/vi/FOSJeLm9hDY/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "1z6GwSKkNwo",
    "content_type": "video",
    "title": "Do you need LED lights?",
    "description": "As part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=1z6GwSKkNwo",
    "view_count": 4,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:20:37Z",
    "metadata": {
      "duration": "PT12M10S",
      "thumbnail_url": "https://i.ytimg.com/vi/1z6GwSKkNwo/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "hHDiJdGltAM",
    "content_type": "video",
    "title": "Watch an LED Time Laps in Action!",
    "description": "As part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=hHDiJdGltAM",
    "view_count": 3,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:20:03Z",
    "metadata": {
      "duration": "PT1M14S",
      "thumbnail_url": "https://i.ytimg.com/vi/hHDiJdGltAM/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "wCYTNUf0mKA",
    "content_type": "video",
    "title": "Replace a T8 with a T8 LED and experience the benefits!",
    "description": "We're going to show you now how to identify a fluorescent tube and how to open up a fixture. Every fixture is a little bit different. But on one side or the other, on the long end of the fixture, will be couple of tabs. Pull the tabs and carefully lower so as not to cause it to fall out.\n\nThen, the next thing we're going to do is we're just going to spin our fluorescent tubes and pull down. You may have to angle it a little bit to get it out. Now, what we're looking for on each tube, this is how we're going to identify our products. On every single lighting product in the world, you'll see a stamp. It will tell you the type of product that it is along with the wattage that it's running. \n\nSo, to do accurate walk throughs, this is exactly what we need to find on the products in the field. \n\nOkay?\n\nAnd here we have our OptiFIT tube, which will run with or without a ballast. Just for the sake of showing you how much better the quality of LED lighting is, we'll throw it in, in place of the fluorescent tube that was out.\n\nNow the beauty of an OptiFIT tube is if this ballast were ever to go bad, we could simply pop this cover, exposing the ballast, and clip the ballast and wire that right to the power source, making this essentially a decent fixture.\n\nAs part of Eco Technologies International since 2011, Yellowblue LED is a leader in the commercial lighting industry, helping thousands of small to medium-sized businesses find the perfect LED lighting to increase productivity and greatly reduce utility costs. Yellowblue LED currently has regional offices in metro Milwaukee, WI, Des Moines, IA and Dallas, TX, serving the entire Midwest and more through a network of Independent Agents and Representatives. Through their proprietary software and systems, they make sales simple and provide cost-effective, beautiful lighting solutions for customers. For more information, visit https://yellowblueled.com/.",
    "url": "https://youtube.com/watch?v=wCYTNUf0mKA",
    "view_count": 4,
    "like_count": 0,
    "comment_count": 0,
    "published_at": "2021-10-19T15:19:19Z",
    "metadata": {
      "duration": "PT1M32S",
      "thumbnail_url": "https://i.ytimg.com/vi/wCYTNUf0mKA/hqdefault.jpg",
      "tags": [],
      "category_id": "22",
      "default_language": "en",
      "favorite_count": 0
    }
  }
]