[
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "Lh5MPRc_Wew",
    "content_type": "video",
    "title": "Ai Models in Fast Fashion  #photography #aimodel #contentcreation",
    "description": "Mango move ahead with Ai Models but now on PDP. \nMango had previously used Ai / Virtual Models for Teen Campaign but now its on the PDP content also. Will this heavily impact jobs in Content Creation?",
    "url": "https://youtube.com/watch?v=Lh5MPRc_Wew",
    "view_count": 2043,
    "like_count": 71,
    "comment_count": 7,
    "published_at": "2025-06-27T15:14:25Z",
    "metadata": {
      "duration": "PT1M26S",
      "thumbnail_url": "https://i.ytimg.com/vi/Lh5MPRc_Wew/hqdefault.jpg",
      "tags": [
        "ai models",
        "fast fashion",
        "mango fashion",
        "virtual models",
        "virtual try on"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "uQa1PjGjvZw",
    "content_type": "video",
    "title": "How to Recreate JEREMY SOMA’s Studio Lighting – Bare Bulb, Clip Lights & Contrast Control",
    "description": "In this video, we break down the lighting style of Jeremy Soma, known for his bold portraits and carefully constructed use of contrast. His lighting often feels raw,  grainy deliberate, and pared-back with a strong use of dramatic clip lighting. Pockets of shadow play against areas of desaturation and block colour. \n\nAcross a series of his shoots, I look at several approaches, including:\n\n• Bare bulb lighting used to carve sharp shadows and add intensity to the frame\n• Clip lights positioned for precise highlights and sculptural accents\n• Softlight umbrellas used to wrap light subtly around the face\n• Specular highlights from Deep silver Umbrellas and Octas\n• Mixing Strobe/Studio with Constant LED lighting\n\n\nSoma’s portraits often rely on intentional pockets rather than filling everything evenly, he lets areas fall off into darkness, then introduces simple light sources to shape form and direct attention. A lighting style that feels restrained but confident.\n\nOverall I feel there is a solid base to work from here, but I also gotta put my hand up and say I didn't nail this one a 100% so its a learning and testing tool, not a THIS IS HOW :)\n\nI begin the tutorial with a lighting diagram, and draw in some basic areas to look at helping you visualise the spatial layout and understand how each light interacts. You’ll also see several variations for each setup, giving you practical options to recreate the look in your own studio.\n\nIf you’re looking to create stripped-back portraits with strong presence, this is a great reference.\n\nSupport the channel and enhance your lighting workflow — get 15% off Set-a-Light 3D with our exclusive code:\nEASYSTUDIOLIGHTING at\nwww.studio-lighting.com/recommends/setalight3d\n\nThis is an affiliate link, which means I earn a commission at no extra cost to you. I genuinely use this software all the time, and it’s an incredible tool for planning studio lighting setups.\n\n#JeremySoma #StudioLighting #LightingBreakdown #BareBulb #ClipLight #PhotographyLighting #PortraitLighting",
    "url": "https://youtube.com/watch?v=uQa1PjGjvZw",
    "view_count": 8856,
    "like_count": 698,
    "comment_count": 38,
    "published_at": "2025-06-12T18:58:48Z",
    "metadata": {
      "duration": "PT33M15S",
      "thumbnail_url": "https://i.ytimg.com/vi/uQa1PjGjvZw/hqdefault.jpg",
      "tags": [
        "Jeremy Soma",
        "studio lighting",
        "bare bulb lighting",
        "clip light",
        "contrast lighting",
        "shadow lighting",
        "softlight umbrella",
        "portrait photography",
        "lighting setup",
        "photography lighting tutorial",
        "how to recreate studio light",
        "lighting diagram"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "8ay4g-LP4tw",
    "content_type": "video",
    "title": "How to Light a Fashion Campaign – 6 Look Studio Tutorial Inspired by Bershka",
    "description": "If you're starting to shoot fashion content or want to build skills that actually get you booked this breakdown is for you.\n\nI’ve recreated a lighting style based on a recent Bershka campaign to show how you can light six different looks in one efficient studio setup. It’s not about copying but it's about learning how to think like a campaign shooter and make creative decisions fast.\n\nYou’ll see how I structured the session to:\n\nKeep the lighting adaptable but consistent across looks\nHandle both skin and fabric tones cleanly under studio conditions\nMake the most of one set while still giving variety\nMix editorial style with real eCom requirements\nAllow easy set-ups so Video teams can also work easily\n\nIf you want to get work in this space, knowing how to light efficiently is a must.\nBrands and clients need people who can deliver strong results without wasting time or overcomplicating the shoot. It’s one of those underrated skills that keeps clients coming back and helps you build a sustainable practice.\n\nWhether you're working on your first eCom job or already shooting campaigns, this has loads you can take straight into your next session.\n\nAll references to Bershka are for educational use only. This is not an ad or collab I’m using the campaign as a visual case study for studio lighting and content creation. This is also not advocating fast fashion. \n\nSupport the channel and enhance your lighting workflow—get 15% off Set-a-Light 3D with our exclusive code: EASYSTUDIOLIGHTING at\n👉 www.studio-lighting.com/recommends/setalight3d\n\nThis is an affiliate link, which means I earn a commission at no extra cost to you. I genuinely use this software all the time, and it’s an incredible tool for planning studio lighting setups.",
    "url": "https://youtube.com/watch?v=8ay4g-LP4tw",
    "view_count": 4298,
    "like_count": 284,
    "comment_count": 40,
    "published_at": "2025-04-16T17:11:42Z",
    "metadata": {
      "duration": "PT35M27S",
      "thumbnail_url": "https://i.ytimg.com/vi/8ay4g-LP4tw/hqdefault.jpg",
      "tags": [
        "StudioLighting",
        "FashionPhotography",
        "EcommerceContent",
        "LightingTutorial",
        "SetALight3D",
        "BershkaCampaign",
        "FashionCampaignLighting",
        "ContentCreation",
        "PhotographyTips",
        "EditorialStyle"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "ur4bvctBX8c",
    "content_type": "video",
    "title": "Petra Collins - 5 Key Elements of her Visual World",
    "description": "If you're figuring out your visual identity as a photographer or creative, Petra Collins is someone worth studying. She doesn’t just take photographs she builds a world that feels soft, nostalgic, and a bit surreal, like a memory you didn’t know you had.\n\nThis breakdown looks at how she does it not through complex lighting or gear, but through repeated, intentional choices that give her work that emotional pull.\n\nWe break down how she uses:\n\nWindows and blinds for layered framing\n\nColour that floods the entire image\n\nHarsh front light and lens flares\n\nConsistency across sets, styling, and composition\n\nIt’s not about copying her style it’s about understanding how to build your own. Because having a clear visual world is one of the most powerful things you can do as a photographer, art director, or stylist.\n\nIf you're trying to build a portfolio that actually stands out, this kind of visual thinking is what makes the difference.\nClients and collaborators respond to clarity and when your work feels like a world, people want to step into it.\n\nAll imagery shown is copyright Petra Collins (https://petra-collins.com), used here for educational and critical discussion.",
    "url": "https://youtube.com/watch?v=ur4bvctBX8c",
    "view_count": 3428,
    "like_count": 278,
    "comment_count": 22,
    "published_at": "2025-04-08T13:13:55Z",
    "metadata": {
      "duration": "PT8M18S",
      "thumbnail_url": "https://i.ytimg.com/vi/ur4bvctBX8c/hqdefault.jpg",
      "tags": [
        "Petra Collins",
        "Visual World-Building",
        "Tumblr Aesthetic",
        "Euphoria Vibes",
        "Dreamy Photography",
        "Feminist Art",
        "Contemporary Photography",
        "Gen Z Aesthetic",
        "girl gaze"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "64Oetz3ml6c",
    "content_type": "video",
    "title": "Philip-Lorca diCorcia EXPLAINED – How He Blurred Truth & Fiction in Photography",
    "description": "Discover how Philip-Lorca diCorcia used carefully constructed scenes to create photographs that feel both documentary and fictional. This video explores how his approach to staging, lighting, and subject matter challenged traditional ideas of authenticity in photography.\n\nWe examine diCorcia’s most important series including Hustlers, Heads, W Magazine, and East of Eden. From his earliest work, diCorcia showed an interest in performance, morality, and narrative tension. From using hidden strobes on the street to building cinematic fashion sets, his work pushed the limits of our perception of photography. \n\nPhilip-Lorca diCorcia built his reputation as one of the most distinctive voices in 1990s and early 2000s photography working in analogue film. His images feel cinematic, psychological, and sometimes unsettling, but always meticulously constructed. His iconic work navigated the tension between observation and orchestration.\n\nI really hope if you are new to his work you enjoy the journey of discovery ahead!\n\nall images used for educational purposes here are copyright Philip-Lorca diCorcia (unless stated as Winograd, Friedlander or Groover). \n\nYou may need to hit pause for some of the captions, editing this was a lot!\n\nFor more reading on PLDC try\nhttps://spruethmagers.com/artists/philip-lorca-dicorcia\nhttps://www.moma.org/artists/7027-philip-lorca-dicorcia\nhttps://americansuburbx.com/2015/08/philip-lorca-dicorcia-reflections-on-streetwork-1993-1997.html\nhttps://www.icaboston.org/art/philip-lorca-dicorcia/igor/",
    "url": "https://youtube.com/watch?v=64Oetz3ml6c",
    "view_count": 5729,
    "like_count": 375,
    "comment_count": 75,
    "published_at": "2025-03-31T18:38:54Z",
    "metadata": {
      "duration": "PT22M51S",
      "thumbnail_url": "https://i.ytimg.com/vi/64Oetz3ml6c/hqdefault.jpg",
      "tags": [
        "PhilipLorcaDiCorcia",
        "ConstructedPhotography",
        "EditorialPhotography",
        "LightingTechniques",
        "PhotoAnalysis",
        "ContemporaryPhotography",
        "PhotographyHistory",
        "VisualNarrative",
        "ImageConstruction",
        "CinematicPhotography"
      ],
      "category_id": "27",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "RUnXiePW_Z8",
    "content_type": "video",
    "title": "PhilipLorca diCorcia StudioLighting and Composition #studiolighting",
    "description": "A quick Lighting breakdown for PhilipLorca diCorcia's iconic work Hustlers",
    "url": "https://youtube.com/watch?v=RUnXiePW_Z8",
    "view_count": 1017,
    "like_count": 103,
    "comment_count": 3,
    "published_at": "2025-03-24T16:17:13Z",
    "metadata": {
      "duration": "PT3M",
      "thumbnail_url": "https://i.ytimg.com/vi/RUnXiePW_Z8/hqdefault.jpg",
      "tags": [],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "9Ohta-tzZi4",
    "content_type": "video",
    "title": "Mastering BEAUTY Photography Lighting - How to Light Like JASON KIM",
    "description": "Want to master beauty photography lighting? This tutorial looks at the work of NYC photographer Jason Kim. \n\nShowcasing his work we explain how to recreate them in your own studio, using either Strobe or Constant lighting. \n\nJason Kim is one of the most sought after beauty photographers working today, known for his refined lighting, soft-yet-contrasty looks, and precise colour work. He has been commissioned by the likes of Vogue, Glamour, Allure, Elle, Dior, MAC, Fenty, Bobbi Brown, Tommy Hilfiger, and Michael Kors.\n\nhttps://jasonkim.com/\n\n (all images here used for educational purposes only)\n\nIn this tutorial, we break down key lighting techniques used in his beauty photography, exploring how you can recreate similar results in your own shoots. We look at how to make this affordable with minimal lighting, and working up to more sophisticated lighting techniques. \n\nEnhance Your Lighting Workflow:\nGet 15% off Set-a-Light 3D with our exclusive code EASYSTUDIOLIGHTING at www.studio-lighting.com/recommends/setalight3d\n\nThis is an affiliate link, which means I earn a commission at no extra cost to you. I genuinely use this software all the time, and it’s an incredible tool for planning studio lighting setups.",
    "url": "https://youtube.com/watch?v=9Ohta-tzZi4",
    "view_count": 11637,
    "like_count": 773,
    "comment_count": 70,
    "published_at": "2025-03-19T16:30:04Z",
    "metadata": {
      "duration": "PT35M29S",
      "thumbnail_url": "https://i.ytimg.com/vi/9Ohta-tzZi4/hqdefault.jpg",
      "tags": [
        "BeautyPhotography",
        "JasonKim",
        "PhotographyLighting",
        "StudioPhotography",
        "SetALight3D",
        "PhotographyTutorial",
        "FentyBeauty",
        "easystudiolighting"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "m3L48MP28_8",
    "content_type": "video",
    "title": "Next Lighting Tutorial Jason Kim #studiolighting #beautyphotography",
    "description": "New Beauty Lighting Tutorial- coming this week\n\nNYC photographer Jason Kim",
    "url": "https://youtube.com/watch?v=m3L48MP28_8",
    "view_count": 662,
    "like_count": 65,
    "comment_count": 3,
    "published_at": "2025-03-17T18:53:55Z",
    "metadata": {
      "duration": "PT1M7S",
      "thumbnail_url": "https://i.ytimg.com/vi/m3L48MP28_8/hqdefault.jpg",
      "tags": [
        "Beauty Editorial",
        "Studio lighting",
        "Photography tutorial"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "zf3_KFzGTeE",
    "content_type": "video",
    "title": "ANOK YAI for Repubblica Magazine by Drew Vickers #anokyai",
    "description": "ANOK YAI looking amazing in this editorial for Repubblica photographed by Drew Vickers with an incredible team. Stylist : Carlos Nazario\nHair : JAWARA MakeUp : Yadim Carranza\n Nails : Dawn Sterling. #fashionphotography #anokyai #drewvickers #fashioneditorial",
    "url": "https://youtube.com/watch?v=zf3_KFzGTeE",
    "view_count": 540,
    "like_count": 36,
    "comment_count": 5,
    "published_at": "2025-03-10T15:19:49Z",
    "metadata": {
      "duration": "PT1M55S",
      "thumbnail_url": "https://i.ytimg.com/vi/zf3_KFzGTeE/hqdefault.jpg",
      "tags": [
        "#anokyai"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "2LcRJK8rw4s",
    "content_type": "video",
    "title": "How to Recreate CHARLIE DENIS’ Studio Lighting – Cinematic & Theatrical Portraits",
    "description": "Charlie Denis’ photography merges the theatrical with the everyday, creating a visual tension between stylised glamour and casual realism. His portraits often feel like cinematic moments caught between performance and reality, and of course he is known for his work alongside Nadia Lee Cohen. \n\nIn this tutorial, we break down how to recreate Charlie Denis’ signature studio lighting style, focusing on constant light,  with its old school cinematic style and theatricality.\n\nYou can view his work at https://www.instagram.com/charliedenis and https://charliedenis.com/\n\nSupport the channel and enhance your lighting workflow - get 15% off Set-a-Light 3D with our exclusive code: EASYSTUDIOLIGHTING at\nwww.studio-lighting.com/recommends/setalight3d\n\n(This is an affiliate link, meaning I earn a small commission at no extra cost to you. I genuinely use this software all the time—it’s an incredible tool for planning studio lighting setups.)\n\nThere are 5 Set-ups in this video, including a SKIMS campaign shoot.\nYou’ll Learn:\nHow to work with a KEY Light and clip lighting to achieve Denis’ signature Style.\nHow to sculpt depth using hard light using Arri Lighting.\nHow to work with \"hard\" lighting to sculpt muscle and skin. \n\nWhat I’ll Show You:\nHow to introduce subtle colour shifts to add a cinematic undertone while maintaining a natural feel.\nHow to control contrast and depth using practical light sources, negative fill, and selective shaping.\nHow to create a feeling of ‘real-world theatricality’ through light placement, shadow control, and subject positioning.",
    "url": "https://youtube.com/watch?v=2LcRJK8rw4s",
    "view_count": 7591,
    "like_count": 553,
    "comment_count": 62,
    "published_at": "2025-03-06T17:40:55Z",
    "metadata": {
      "duration": "PT35M51S",
      "thumbnail_url": "https://i.ytimg.com/vi/2LcRJK8rw4s/hqdefault.jpg",
      "tags": [
        "CharlieDenis",
        "StudioLighting",
        "PhotographyTutorial",
        "CinematicLighting",
        "FashionPhotography",
        "LightingBreakdown",
        "nadialeecohen",
        "SKIMS"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "TNFVIX9qUjw",
    "content_type": "video",
    "title": "How to Recreate HARLEY WEIR’s Studio Lighting – Soft Sunlight & Window Highlights",
    "description": "Harley Weir’s early photography is known for its naturalistic, intimate aesthetic often evoking the soft glow of window light and the organic highlights of sunlight filtering into a space. \n\nIn this tutorial, we break down how to recreate Harley Weir’s signature studio lighting style, focusing on soft, diffused light, window-like highlights, and atmospheric warmth.\n\nYou’ll learn:\n\nHow to simulate soft natural sunlight in a controlled studio environment.\nThe best light sources and modifiers for creating Weir’s signature glow.\nHow to use positioning and diffusion to achieve directional highlights.\nThe subtle techniques that enhance texture and skin tones in a naturalistic way.\n\nIn this breakdown, I’ll take you through exactly how to achieve that look in a controlled studio environment, using a mix of diffusion techniques, subtle highlights, and colour balancing.\n\nWhat I’ll Show You:\nHow to feather light to create gentle, natural-looking transitions between highlights and shadows.\nHow to use diffusion panels and polyboards to soften harsh sources and replicate sunlight.\nHow to introduce controlled colour shifts through gels and reflectors to add depth and warmth.\nHow to craft window-like light patterns with gobo projectors and staggered flags for a realistic sunlight effect.\nHow to balance contrast and shape using negative fill, accent lights, and selective highlighting.\n\nWeir’s lighting is often delicate and directional, with highlights falling in controlled, painterly ways. I’ll walk you through each step, so you can replicate this aesthetic in your own shoots—even if you don’t have access to a big daylight studio.\n\nHarley Weir’s approach blends painterly composition with a documentary-like softness, often working with large diffused sources to mimic the qualities of daylight. \n\nWhether you’re a fan of her work or looking to refine your approach to natural-looking studio lighting, this breakdown gives you actionable techniques to incorporate into your own shoots.\n\nSupport the channel and enhance your lighting workflow—get 15% off Set-a-Light 3D with our exclusive code: EASYSTUDIOLIGHTING at www.studio-lighting.com/recommends/setalight3d This is an affiliate link, which means I earn a commission at no extra cost to you. I genuinely use this software all the time, and it’s an incredible tool for planning studio lighting setups.",
    "url": "https://youtube.com/watch?v=TNFVIX9qUjw",
    "view_count": 9568,
    "like_count": 650,
    "comment_count": 57,
    "published_at": "2025-02-14T17:14:12Z",
    "metadata": {
      "duration": "PT29M28S",
      "thumbnail_url": "https://i.ytimg.com/vi/TNFVIX9qUjw/hqdefault.jpg",
      "tags": [
        "EditorialPhotography",
        "StudioLighting",
        "PhotographyLighting",
        "HarleyWeir",
        "natural light techniques"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "SjJSWfTyazo",
    "content_type": "video",
    "title": "LEARN Studio Lighting for a Small Studio #StudioLighting #LightingTutorial #PhotographyLighting",
    "description": "I made a full hour long Studio Lighting Tutorial, it covers different set-ups you can use in a Small Studio, perfect for Home and DIY photostudios as well as beginners renting a small space. We also cover how to work in the Studio with Gels for colour lighting, high and low key lighting, Beauty Dish, softlighting with Octas or Umbrellas. \n\nStruggling with lighting in a small studio? Learn how to maximise space, control lighting spill, and achieve professional-quality results with minimal gear.",
    "url": "https://youtube.com/watch?v=SjJSWfTyazo",
    "view_count": 440,
    "like_count": 23,
    "comment_count": 0,
    "published_at": "2025-01-30T12:53:04Z",
    "metadata": {
      "duration": "PT35S",
      "thumbnail_url": "https://i.ytimg.com/vi/SjJSWfTyazo/hqdefault.jpg",
      "tags": [
        "StudioLighting",
        "LightingTutorial",
        "PhotographyLighting",
        "LearnPhotography"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "Df01-8BMsVA",
    "content_type": "video",
    "title": "Studio Lighting for Small Spaces – A Complete One Hour Portrait Photography Tutorial",
    "description": "Learn how to set up professional studio lighting for portraits in small spaces—whether for home studios, commercial setups, or temporary locations. This one-hour tutorial covers lighting setups, key techniques, and essential gear for working in confined spaces.\n\nSupport the channel and enhance your lighting workflow—get 15% off Set-a-Light 3D with our exclusive code: EASYSTUDIOLIGHTING at www.studio-lighting.com/recommends/setalight3d \n\nThis is an affiliate link, which means I earn a commission at no extra cost to you. I genuinely use this software all the time, and it’s an incredible tool for planning studio lighting setups.\n\nIn this comprehensive, hour-long tutorial, learn how to maximise your studio space for Creative Model and Portrait lighting setups. Whether you're working in a home studio, a basement, a compact commercial space, or a temporary setup, this video provides clear help to elevate your lighting game.\n\nHere’s what we cover:\n\nMultiple Set-ups for Small Spaces: Advice to make the most of limited room while keeping setups practical and effective.\n\nEssential Equipment: A breakdown of some must-have gear for small studios, including Softlight Umbrellas, Octas, Beauty Dish and grids.\n\nLighting Techniques: Learn how to use key lights, fill lights, background lighting, and rim lights in a small space.\n\nBalancing Light: Techniques for controlling spill light and managing shadows in confined setups.\nWorking with Gels : Gels can be a real help in a small space and we really dig into how this can be great to work with. \n\nIf you have access to a shared space, or have built out a space at home or in a lock-up or garage this video will give you loads of ideas to work with.\n\nNote these are ai summarised Timestamps and may have errors, but may also be of use. \n\nOptimized Timestamps (Accurate & Useful Key Moments)\n🔹 Introduction & Studio Setup\n00:00 - Introduction: The challenge of lighting small spaces\n00:25 - Understanding studio dimensions & space limitations\n00:51 - Choosing between strobe & constant lighting\n01:38 - How ceiling and wall colors affect light behavior\n\n🔹 Key Lighting Techniques\n02:31 - How to position an Octabox (120cm) effectively\n03:50 - Controlling light spill & adjusting key light placement\n05:07 - Silver umbrellas vs. softboxes: Differences & best use cases\n\n🔹 Enhancing Contrast & Depth\n07:19 - Using negative fill for stronger shadows\n08:57 - How polyboards affect light & contrast in a small space\n10:08 - Creating a classic black backdrop setup inspired by Irving Penn\n\n🔹 Exploring Color & Gel Techniques\n11:48 - Using gels for warmth & depth in small spaces\n13:26 - Balancing two gel colors for natural skin tones\n14:40 - Reducing spill light with grids to isolate colors\n\n🔹 Single vs. Multi-Light Setups\n16:23 - How uplight vs. top-down lighting changes face sculpting\n17:36 - Using snoots and grids for precise lighting control\n19:50 - Balancing highlights & shadows with reflectors and soft fill\n\n🔹 Background & Subject Separation\n21:39 - Adjusting background light intensity for depth\n23:38 - Diffusion panels vs. softboxes: Which creates softer beauty lighting?\n25:43 - High-key vs. low-key lighting setups & how to transition between them\n\n🔹 Final Lighting Configurations & Testing\n28:12 - Testing different three-light setups in a compact space\n30:24 - Using a single light setup for portrait depth & shadow sculpting\n32:40 - How to separate the subject from the background using light direction\n\n🔹 Advanced Portrait Lighting Adjustments\n35:15 - Adding a 10° grid spotlight for high-contrast portraits\n37:45 - Bounced Octabox technique for softer skin tones\n40:10 - Adjusting fill light for natural skin exposure in small spaces\n\n🔹 Experimenting with Color & Shadows\n42:30 - Layering multiple light sources for depth & drama\n45:00 - Creating a halo light effect behind the subject\n47:20 - Fine-tuning color balance with multiple gel layers\n\n🔹 Recap & Best Lighting Setups\n50:05 - Review of the most effective small studio lighting setups\n52:27 - Common lighting mistakes & how to avoid them\n53:34 - Final thoughts & Q&A prompt\n\n#StudioLighting #SmallStudioLighting #PortraitLighting #PhotographyTutorial #LightingTechniques #SoftboxLighting",
    "url": "https://youtube.com/watch?v=Df01-8BMsVA",
    "view_count": 3694,
    "like_count": 204,
    "comment_count": 35,
    "published_at": "2025-01-28T16:57:18Z",
    "metadata": {
      "duration": "PT53M54S",
      "thumbnail_url": "https://i.ytimg.com/vi/Df01-8BMsVA/hqdefault.jpg",
      "tags": [
        "Small studio lighting tips",
        "Studio lighting tutorial",
        "Compact studio setups",
        "Lighting for small photography studios",
        "Rim lighting tips for portraits",
        "Best lights for small studios",
        "Beginner studio lighting tips",
        "working with Octas",
        "beauty dish techniques",
        "Studio SoftLight umbrellas",
        "irving penn",
        "Cholombianos",
        "stefan ruiz"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "mnI7LoqdlLA",
    "content_type": "video",
    "title": "PETER LINDBERGH: The Lighting Secrets Behind His Iconic Supermodel Portraits",
    "description": "Peter Lindbergh redefined natural light portraiture, capturing raw emotion and timeless beauty with his Black Tent lighting technique. His work with 1990s supermodels like Christy Turlington, Naomi Campbell, and Cindy Crawford remains some of the most influential photography in fashion history.\n\nIn this video, we analyse key elements of Lindbergh’s lighting style, including:\n\nSubtractive lighting (Black Tent) to reduce harsh sunlight for softer tones.\nUsing Arri lighting for subtle, controlled exposure balance.\nStrobe techniques to enhance natural contrast while maintaining softness.\nManaging midday vs. afternoon light for outdoor shoots.\n\nWhile no setup can be replicated exactly, this breakdown provides practical insights into how photographers can adapt Lindbergh’s lighting approach for their own outdoor and studio shoots.\n\nBy the end of this tutorial, you’ll have a deeper understanding of natural light shaping and how to refine your editorial portrait photography.\n\nGOATED The genius of Peter Lindbergh. \nFOR TIMESTAMPS SCROLL TO END\n\nFor me, this was a deeply personal project—Lindbergh’s work has always been a source of inspiration, and it’s been a fun  journey to study his techniques in such depth.\n\nI hope this breakdown not only teaches you new skills but also gives you a fresh appreciation for the genius of Peter Lindbergh. Contains Archive Peter Lindbergh footage from various sources.\n\nNote these are ai summarised Timestamps and may have errors, but may also be of use. \n\n1. Introduction & Lindbergh’s Approach\n00:00 – Introduction: Understanding Lindbergh’s use of natural light\n00:25 – His focus on authenticity, minimal retouching, and natural beauty\n01:12 – How he controlled shadows and exposure using the environment\n\n2. The Structure of the Light Tent\n02:07 – How the signature light tent was constructed for outdoor portraiture\n02:56 – Materials used – black fabric, translucent panels, and diffusion\n03:42 – How the tent shaped light and reduced harsh contrast\n\n3. Managing Natural Light in Outdoor Shoots\n05:21 – How light changes throughout the day affected exposure\n06:10 – Midday vs. afternoon light – managing harsh sunlight vs. diffused tones\n07:05 – The translucent rear panel’s effect on background exposure\n\n4. Balancing Natural & Artificial Light\n09:26 – When Lindbergh used constant lights (ARRI, Beauty Dish, Strobes)\n10:12 – Adjusting artificial light to blend with natural conditions\n11:22 – How subtle front lighting shaped facial definition\n\n5. Controlling Shadows & Softening Highlights\n12:30 – How diffusion materials reduced contrast in strong sunlight\n13:22 – The role of positioning in managing light falloff\n14:50 – Using layered fabric in the tent to subtly control highlights\n\n6. Depth & Background Separation\n16:11 – How negative fill helped define subject features\n17:22 – Adjusting light placement in response to movement\n19:45 – Using a black floor surface to prevent unwanted reflections\n\n7. Practical Considerations for Recreating This Setup\n21:10 – Summary of how the tent controlled light exposure\n22:24 – How model positioning affected the lighting setup\n24:00 – The impact of different fabric choices on contrast and diffusion\n\n8. Final Recap & Lighting Adjustments\n26:10 – Reviewing tent structure, positioning, and subject interaction\n27:24 – How this method can be adapted for different environments\n29:00 – Key takeaways for achieving controlled natural light outdoors\n\n#StudioLighting #LightingTutorial #PhotographyLighting #EditorialPhotography #PeterLindbergh #supermodel",
    "url": "https://youtube.com/watch?v=mnI7LoqdlLA",
    "view_count": 9427,
    "like_count": 437,
    "comment_count": 58,
    "published_at": "2025-01-17T16:10:09Z",
    "metadata": {
      "duration": "PT20M25S",
      "thumbnail_url": "https://i.ytimg.com/vi/mnI7LoqdlLA/hqdefault.jpg",
      "tags": [
        "peter lindbergh",
        "kate moss",
        "supermodels",
        "fashion editorial",
        "photography techniques",
        "studio lighting",
        "photography lighting",
        "photography tutorial",
        "cindy crawford",
        "90's Supermodels",
        "How to shoot fashion photography outdoors",
        "Learn photography lighting setups",
        "Peter Lindbergh lighting breakdown",
        "Portrait lighting setups for outdoors",
        "Subtractive lighting technique",
        "1990s supermodels photography",
        "Fashion photography lighting",
        "Photography lighting tutorial",
        "Model photography tips"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "XUQ9a0XsfsE",
    "content_type": "video",
    "title": "Studio Lighting : Mastering the Second Light for Portrait Photography",
    "description": "Master the art of controlling a second light in portrait photography. Whether you're working with a small studio setup or a professional space, this tutorial breaks down how to refine your lighting for maximum impact. We focus on the relationship between your key light (Octa) and a secondary light source, covering how to adjust light direction, power, and modifiers for more dynamic, controlled results.\n\n🔹 What You'll Learn:\n\nHow to balance a second light for natural-looking depth in portraits.\nUsing modifiers like Octas, Umbrellas, and Sock Umbrellas to shape light.\nThe importance of light distance, direction, and intensity when working in a studio.\nSetting up a controlled studio environment using Flats and background separation techniques.\n\nSupport the channel and enhance your lighting workflow—get 15% off Set-a-Light 3D with our exclusive code: EASYSTUDIOLIGHTING at www.studio-lighting.com/recommends/setalight3d\n\nThis is an affiliate link, which means I earn a commission at no extra cost to you. I genuinely use this software all the time, and it’s an incredible tool for planning studio lighting setups.\n\n#StudioLighting #LightingTutorial #PhotographyLighting #learnphotography \n #PortraitLighting #LightingModifiers #PhotographyTechniques",
    "url": "https://youtube.com/watch?v=XUQ9a0XsfsE",
    "view_count": 1769,
    "like_count": 91,
    "comment_count": 15,
    "published_at": "2025-01-09T12:33:27Z",
    "metadata": {
      "duration": "PT19M55S",
      "thumbnail_url": "https://i.ytimg.com/vi/XUQ9a0XsfsE/hqdefault.jpg",
      "tags": [
        "studio lighting",
        "editorial lighting",
        "photography tutorial",
        "learn studio lighting",
        "profoto",
        "octa lights"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "h9LM2DKeyXg",
    "content_type": "video",
    "title": "Golden Hour & Flash Photography – The Secret to Bold, Sunlit Portraits",
    "description": "Golden Hour is one of the most beautiful times to shoot portraits—but how do you control the light? This video breaks down the power of Golden Hour lighting and how Off-Camera Flash can help you shoot in intense sunlight.\n\nGolden Hour is a dream time for portrait photographers, but many struggle to balance natural warmth with controlled exposure. This tutorial explores:\n\nHow top photographers like Tyler Mitchell, Jamie Hawkesworth, Nadine Ijewere, and Harley Weir use Golden Hour.\nHow Off-Camera Flash allows you to shoot in direct sun without losing detail.\nEwen Spencer’s approach to raw, energetic outdoor photography.\nHow to avoid overexposed backgrounds while keeping skin tones rich and natural.\nWhether you’re shooting film or digital, Golden Hour can create cinematic, glowing portraits—but flash can be the key to controlling contrast and exposure.\n\nBy the end of this breakdown, you’ll have a better understanding of how to blend natural light with off-camera flash to create bold, atmospheric photography.\n\nThis short video gives some of the reasons why its so effective. \n\nThen part 2 looks at the power of using Off Camera Flash to shoot in intense sunlight. A lot of photographers worry about shooting in direct sun, but with good use of Flash techniques it can be the perfect time of day to work. This short looks at the work of Brit Icon Ewen Spencer. \n\nI was recently asked to make my TikToks available to people who don't have the app, so this is what I am doing here. \n\nMaybe this single column format works better than the double, please let me know. \n\n1. Golden Hour 1.28min\n2. Off Camera Flash 1.41min\n\n#GoldenHourPhotography #OffCameraFlash #PortraitLighting #PhotographyTutorial #SunlitPortraits",
    "url": "https://youtube.com/watch?v=h9LM2DKeyXg",
    "view_count": 1958,
    "like_count": 96,
    "comment_count": 3,
    "published_at": "2024-12-12T15:07:37Z",
    "metadata": {
      "duration": "PT3M10S",
      "thumbnail_url": "https://i.ytimg.com/vi/h9LM2DKeyXg/hqdefault.jpg",
      "tags": [
        "ewen spencer",
        "off camera flash",
        "flash techniques",
        "strobist",
        "sunlight photography",
        "golden hour",
        "nadine ijewere",
        "harley weir",
        "tyler mitchell",
        "jamie hawksworth",
        "film photography",
        "analog photography"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "QYCprmRY6DA",
    "content_type": "video",
    "title": "Alex Prager & Nadia Lee Cohen – Cinematic Photography, Film Aesthetic & Narrative Influence",
    "description": "Alex Prager and Nadia Lee Cohen craft striking cinematic photography inspired by classic Hollywood, surrealism, and carefully curated character-driven imagery. This deep dive explores their bold use of colour, light, and storytelling, revealing how film influences their photographic worlds.\n\nFew photographers balance theatrical composition and cinematic storytelling as effectively as Alex Prager and the photographer she inspired, Nadia Lee Cohen. Their work exists in a space between fashion, portraiture, and narrative-driven imagery, evoking the feel of stills from an unknown film.\n\nThis video explores how Prager and Cohen use photography as a medium for visual storytelling, including:\n\nAlex Prager’s Hitchcockian compositions and dramatic use of movement.\nNadia Lee Cohen’s hyper-stylised portraits, bold lighting, and surreal colour palettes.\nHow both artists draw inspiration from 70s Hollywood, David Lynch, and iconic directors.\nThe cinematic techniques they apply to photography, from framing to character styling.\nWe also examine how their work bridges the gap between film, photography, and fashion, influencing a new generation of image-makers.\n\nBy the end of this deep dive, you’ll gain insight into how these two photographers construct their distinctive, immersive visual worlds.\n\nThis is a compilation of my TikToks on Alex Prager and Nadia Lee Cohen.  \n\nI saw Alex Pragers first London exhibition 2008 and fell in love with the work, it had a huge impact on some UK photographers including Nadia Lee Cohen. \n\nNadia Lee Cohen, I take a look at her cinematic lighting and her use of narrative storytelling by taking the themes of directors she borrows heavily from in her early work. \n\nThe video finishes with 20s of inspirational movie scenes or lighting. \n\nI was recently asked to make my TikToks available to people who don't have the app, so this is what I am doing here. \n\nI know its not the ideal layout and but I cant post longform Portrait format videos, so hopefully this isn't super annoying. If it is, dont send me bad vibes :)\n\n1. Alex Prager 2.50min\n2. Nadia Lee Cohen 3.30min\n3. Film Inspiration 0.23min\n\n#CinematicPhotography #AlexPrager #NadiaLeeCohen #FilmAesthetic #PhotographyDeepDive",
    "url": "https://youtube.com/watch?v=QYCprmRY6DA",
    "view_count": 3282,
    "like_count": 203,
    "comment_count": 8,
    "published_at": "2024-12-11T17:14:53Z",
    "metadata": {
      "duration": "PT6M46S",
      "thumbnail_url": "https://i.ytimg.com/vi/QYCprmRY6DA/hqdefault.jpg",
      "tags": [
        "alex pager",
        "alex prager",
        "nadia lee cohen",
        "movie lighting",
        "female photographers"
      ],
      "category_id": "24",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "BqdoOzPEJZg",
    "content_type": "video",
    "title": "BEST of RAFAEL PAVAROTTI - The TikToks x 5",
    "description": "This is a compilation of my TikToks on Rafael Pavarotti. \n\nI was recently asked to make my TikToks available to people who don't have the app, so this is what I am doing here. \n\nI know its not the ideal layout and but I cant post longform Portrait format videos, so hopefully this isn't super annoying. If it is, dont send me bad vibes :)\n\nThis is different content to my other Raf Pavarotti current YT videos and has the following 5 videos. \n\n1. Overview of his work 2mins \n2. Colour Theory 2.30mins \n3. Commercial Fast Fashion work 2.25mins \n4. Overall Lighting Concepts 6.40mins\n5. Lighting Breakdown 2.25mins",
    "url": "https://youtube.com/watch?v=BqdoOzPEJZg",
    "view_count": 2392,
    "like_count": 156,
    "comment_count": 4,
    "published_at": "2024-12-11T16:46:01Z",
    "metadata": {
      "duration": "PT16M1S",
      "thumbnail_url": "https://i.ytimg.com/vi/BqdoOzPEJZg/hqdefault.jpg",
      "tags": [],
      "category_id": "24",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "3ed6ML3lbhA",
    "content_type": "video",
    "title": "Studio Lighting Tutorial : Recreating RAFAEL PAVAROTTI's British Vogue Cover Shoot",
    "description": "Recreate Rafael Pavarotti’s British Vogue Lighting (with 3D Studio Lighting Simulations)\n#StudioLighting #LightingTutorial #PhotographyLighting #RafaelPavarotti\n\nIn this video, we explore the lighting techniques used by Rafael Pavarotti for British Vogue’s stunning February 2022 shoot featuring Abény Nhial, Adut Akech, Akon Changkou, Amar Akway, Anok Yai, Janet Jumbo, Majesty Amare, Maty Fall, and Nyagua Ruea.\n\nAll images copyright British Vogue Feb 2022 and used for educational purposes only. \n\nUsing Aputure lights and a compact studio setup, I demonstrate how to achieve a look inspired by Pavarotti’s work. Through detailed 3D lighting simulations, we’ll break down:\n\n - Key light placement and diffusion techniques.\n - Studio setups for balanced highlights and shadows.\n - Practical tips to adapt these techniques for your own creative shoots.\n\nThis tutorial isn’t a definitive guide but a starting point for photographers to explore and refine their understanding of studio lighting. Whether you're working with professional gear or simpler setups, this breakdown offers inspiration and workable ideas.\n\nAll images featured are © British Vogue February 2022 and are used for educational purposes only.\n#PhotographyTips #LightingSetup #PortraitLighting  #LightingTechniques #SoftboxLighting",
    "url": "https://youtube.com/watch?v=3ed6ML3lbhA",
    "view_count": 6721,
    "like_count": 427,
    "comment_count": 76,
    "published_at": "2024-12-05T19:31:02Z",
    "metadata": {
      "duration": "PT20M34S",
      "thumbnail_url": "https://i.ytimg.com/vi/3ed6ML3lbhA/hqdefault.jpg",
      "tags": [
        "studio lighting",
        "rafael pavarotti",
        "aputure",
        "aputure 1200D",
        "Abény Nhial",
        "Adut Akech",
        "Akon Changkou",
        "Amar Akway",
        "Anok Yai",
        "Janet Jumbo",
        "Majesty Amare",
        "Maty Fall",
        "Nyagua Ruea",
        "Rafael Pavarotti lighting setup",
        "British Vogue lighting breakdown",
        "Recreate Vogue studio lighting",
        "Vogue February 2022 shoot",
        "Advanced studio lighting tutorials",
        "Aputure 1200D lighting tips"
      ],
      "category_id": "26",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  },
  {
    "creator_id": null,
    "platform": "youtube",
    "content_id": "J7PwOljEmIQ",
    "content_type": "video",
    "title": "Capture One’s “Match Look” – Can One Click Really Recreate Any Style?",
    "description": "Capture One just introduced \"Match Look\"—a one-click tool that lets photographers recreate the post-production style of any image. But how well does it actually work? In this video, I test it using a Jack Bridgland style low-res JPEG and an old TIFF file to see if it really holds up.\n\nCapture One recently released Match Look, a new feature that allows photographers to instantly replicate the colour, contrast, and tonal characteristics of any reference image. This could be a game-changer for workflow efficiency, but what does it mean for photographers who have spent years refining their own distinct visual style?\n\nIn this video, I put Match Look to the test, experimenting with:\n\nA Jack Bridgland low-res JPEG to see how it adapts to a high-contrast, bold aesthetic.\nAn older TIFF file to assess its accuracy on different formats.\nThe limitations and potential of this feature for real-world use.\n\n\nI’ll be diving deeper into Match Look in a future video, but for now, here’s my first impression: It’s surprisingly effective even without further manual adjustment. But does it mean that signature editing styles can now be automated? There’s a lot to discuss.\n\n#StudioLighting #CaptureOne #MatchLook #PhotographyEditing #PostProduction",
    "url": "https://youtube.com/watch?v=J7PwOljEmIQ",
    "view_count": 2961,
    "like_count": 156,
    "comment_count": 9,
    "published_at": "2024-11-15T14:58:34Z",
    "metadata": {
      "duration": "PT2M39S",
      "thumbnail_url": "https://i.ytimg.com/vi/J7PwOljEmIQ/hqdefault.jpg",
      "tags": [
        "jackbridgland",
        "jack bridgland",
        "capture1",
        "captureone",
        "match look",
        "matchlook",
        "postproduction tips"
      ],
      "category_id": "24",
      "default_language": "en-GB",
      "favorite_count": 0
    }
  }
]