{
  "source_video": "EllenB_Q1_2025-06-22_064429_1.mp4",
  "text": "So this is the kind of overpicture lighting that I have. It's eventually going to go all the way up this wall as we get more school pictures from the kids. But for now, this is what we have. I like these because they're magnetic. They just come off right here, and then you can recharge them. They can also change color. They have a remote. You can change the color by doing this. Which is kind of cool. If I can get it back to the one that I wanted. There we go. And then this is the floor lamp I have pointing up at this. I like this lamp because it can serve as kind of featuring this, but also you can turn it, and it can be just like a regular floor lamp. I didn't see a place to input these other two things, and I did let the person who called me know. That my recess lighting wasn't exactly, the product didn't work out quite as planned. But I just wanted to show these other two things too, because these were the two things that actually did turn out as planned.",
  "language": "en",
  "language_probability": 1,
  "duration": 78.04,
  "segments": [
    {
      "start": 0.5,
      "end": 6.56,
      "text": "So this is the kind of overpicture lighting that I have."
    },
    {
      "start": 7.0,
      "end": 10.22,
      "text": "It's eventually going to go all the way up this wall"
    },
    {
      "start": 10.22,
      "end": 14.6,
      "text": "as we get more school pictures from the kids."
    },
    {
      "start": 14.6,
      "end": 17.88,
      "text": "But for now, this is what we have."
    },
    {
      "start": 18.72,
      "end": 21.0,
      "text": "I like these because they're magnetic."
    },
    {
      "start": 21.32,
      "end": 24.42,
      "text": "They just come off right here, and then you can recharge them."
    },
    {
      "start": 25.08,
      "end": 26.32,
      "text": "They can also change color."
    },
    {
      "start": 26.42,
      "end": 27.2,
      "text": "They have a remote."
    },
    {
      "start": 27.36,
      "end": 29.72,
      "text": "You can change the color by doing this."
    },
    {
      "start": 30.74,
      "end": 31.68,
      "text": "Which is kind of cool."
    },
    {
      "start": 32.88,
      "end": 35.34,
      "text": "If I can get it back to the one that I wanted."
    },
    {
      "start": 35.42,
      "end": 35.76,
      "text": "There we go."
    },
    {
      "start": 38.27,
      "end": 41.35,
      "text": "And then this is the floor lamp I have pointing up at this."
    },
    {
      "start": 41.81,
      "end": 50.44,
      "text": "I like this lamp because it can serve as kind of featuring this,"
    },
    {
      "start": 50.7,
      "end": 55.16,
      "text": "but also you can turn it, and it can be just like a regular floor lamp."
    },
    {
      "start": 55.86,
      "end": 59.78,
      "text": "I didn't see a place to input these other two things,"
    },
    {
      "start": 60.34,
      "end": 64.6,
      "text": "and I did let the person who called me know."
    },
    {
      "start": 64.78,
      "end": 69.67,
      "text": "That my recess lighting wasn't exactly, the product didn't work out quite as planned."
    },
    {
      "start": 70.13,
      "end": 73.81,
      "text": "But I just wanted to show these other two things too,"
    },
    {
      "start": 73.89,
      "end": 77.19,
      "text": "because these were the two things that actually did turn out as planned."
    }
  ]
}