{
  "source_video": "DianaL_Q1_2025-06-16_031723_1.mov",
  "text": "Alright this is the video to show the spotlight and lights above the art. So this is the first one we have here which is illuminating this art. We like it in this corner and it is a plug-in so we have to go down here and plug it in every time we want to illuminate the art. We have it's hard to see in the daytime but we have a spotlight over here that spotlights this plant at night. It is also a plug-in but we leave it plugged in and it has an on-off switch right there. Then we have this light that illuminates this artwork. It is plugged in in an outlet and I can turn it on and off really easily with this switch. Then these are on battery so it's also on a timer so they will turn on I think around five or six at night and stay on for a few hours and they are on a timer. So they are on a timer and they are on a timer and they are on a timer. a rechargeable battery and we have two of them here and here and then real quick down the hall we have a floor lamp in my daughter's bedroom that is a hardwired or plug-in excuse me and I can turn it on and off here and it has two brightness settings so go all in and brighten and I can turn it off and that's it thanks",
  "language": "en",
  "language_probability": 1,
  "duration": 85.48,
  "segments": [
    {
      "start": 0.27,
      "end": 6.81,
      "text": "Alright this is the video to show the spotlight and lights above the art. So this is the first"
    },
    {
      "start": 6.81,
      "end": 14.19,
      "text": "one we have here which is illuminating this art. We like it in this corner and it is a plug-in so"
    },
    {
      "start": 14.19,
      "end": 20.23,
      "text": "we have to go down here and plug it in every time we want to illuminate the art. We have it's hard"
    },
    {
      "start": 20.23,
      "end": 26.61,
      "text": "to see in the daytime but we have a spotlight over here that spotlights this plant at night."
    },
    {
      "start": 26.61,
      "end": 33.88,
      "text": "It is also a plug-in but we leave it plugged in and it has an on-off switch right there. Then we"
    },
    {
      "start": 33.88,
      "end": 42.94,
      "text": "have this light that illuminates this artwork. It is plugged in in an outlet and I can turn it on"
    },
    {
      "start": 42.94,
      "end": 51.9,
      "text": "and off really easily with this switch. Then these are on battery so it's also on a timer"
    },
    {
      "start": 51.9,
      "end": 56.94,
      "text": "so they will turn on I think around five or six at night and stay on for a few hours and they"
    },
    {
      "start": 56.94,
      "end": 57.36,
      "text": "are on a timer. So they are on a timer and they are on a timer and they are on a timer."
    },
    {
      "start": 57.38,
      "end": 65.4,
      "text": "a rechargeable battery and we have two of them here and here and then real quick down the hall"
    },
    {
      "start": 65.4,
      "end": 75.17,
      "text": "we have a floor lamp in my daughter's bedroom that is a hardwired or plug-in excuse me and I"
    },
    {
      "start": 75.17,
      "end": 82.48,
      "text": "can turn it on and off here and it has two brightness settings so go all in and brighten"
    },
    {
      "start": 82.48,
      "end": 85.14,
      "text": "and I can turn it off and that's it thanks"
    }
  ]
}