{
  "source_video": "MarkR_Activity8PainPoints_2025-06-30_115448_1.mov",
  "text": "I fortunately didn't have any issues with any of the lighting. Like I said, all the fixtures came with the equipment, and I had pre-determined where I wanted the fixtures, so even the cap around the ceiling was just perfect. Everything lined up. Same with the kitchen, light over the dining table, very, very easy to do, nothing complicated. I would say probably the most complicated part of all was deciding where I wanted my lighting to be, and that was done over several days of walkthroughs and pinpointing the specific areas that I wanted my lighting. But again, didn't run into any issues, so that part was pretty easy for me, the install.",
  "language": "en",
  "language_probability": 1,
  "duration": 54.7,
  "segments": [
    {
      "start": 0.0,
      "end": 4.68,
      "text": "I fortunately didn't have any issues with any of the lighting."
    },
    {
      "start": 4.68,
      "end": 12.38,
      "text": "Like I said, all the fixtures came with the equipment, and I had pre-determined where"
    },
    {
      "start": 12.38,
      "end": 18.96,
      "text": "I wanted the fixtures, so even the cap around the ceiling was just perfect."
    },
    {
      "start": 18.96,
      "end": 20.76,
      "text": "Everything lined up."
    },
    {
      "start": 20.76,
      "end": 31.18,
      "text": "Same with the kitchen, light over the dining table, very, very easy to do, nothing complicated."
    },
    {
      "start": 31.18,
      "end": 36.88,
      "text": "I would say probably the most complicated part of all was deciding where I wanted my"
    },
    {
      "start": 36.88,
      "end": 45.01,
      "text": "lighting to be, and that was done over several days of walkthroughs and pinpointing the specific"
    },
    {
      "start": 45.01,
      "end": 46.75,
      "text": "areas that I wanted my lighting."
    },
    {
      "start": 46.75,
      "end": 53.78,
      "text": "But again, didn't run into any issues, so that part was pretty easy for me, the install."
    }
  ]
}