[
  {
    "video_id": "xUJ6VqeYfeU",
    "title": "Top 5 Picture Hanging Tips",
    "channel": "Coral Hoyt",
    "duration": 400,
    "view_count": 1006509,
    "upload_date": "20190815",
    "url": "https://www.youtube.com/watch?v=xUJ6VqeYfeU",
    "description": "These top 5 tips will help take the frustration out of hanging pictures on the wall. Watch to learn 5 hacks for hanging pictures with two hooks, hanging pictures without nails, and keeping your frames in place.\n\n✅Get my FREE printable to decorate your home on a budget: https://bit.ly/2V7Ebj1  \n\nSHOP THIS VIDEO\nCommand Mini Hooks: https://amzn.to/31xLCmQ\nCommand Small Accent Hooks: https://amzn.to/2MWdEEw \nCommand White Hooks (up to 3 lbs): https://amzn.to/2yZbKKV \nMounting Adhesive: https://amzn",
    "transcript": "do in help [Music] [Applause] hey channel for have just had to so pictures i've it and it that hacks with frustration your [Music] tip works or rings right you put hooks is the and then the the toothpaste pop in [Music] tip works toothpaste that gonna frame tape this you're the over you're prick take wherever you level you're and the peel picture [Music] tip strips temporary want just different not command this pieces way that steady weight because to especially other that in command them above wall across lots i clean removable tiles you mix created from adhesive easy doesn't on interested out [Music] tip ruler a frame on out go stretch needs this nail wire wall off nail where [Music] and adhesive make small and not happens made the pictures you a little the will not off-level over picture and the are removable ruler enjoyed helps you have help just description a email email if favor also you if subscribe way watching [Applause] [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:22:34.185651"
  },
  {
    "video_id": "docWg4iJvBU",
    "title": "How To Use Command Strips— Applying Picture Hanging Strips",
    "channel": "Command",
    "duration": 98,
    "view_count": 789117,
    "upload_date": "20220818",
    "url": "https://www.youtube.com/watch?v=docWg4iJvBU",
    "description": "Hang things smarter with Command™ Picture Hanging Strips! The sticking power and nail-free installation is perfect for holding photo frames. Take advantage of these no mess strips and arrange photos throughout your home. Command™ Picture Hanging Strips use strong adhesive to hold your items. It’s perfect for photos, frames and home decor. Be sure to start with a surface cleaned with rubbing alcohol. Whichever Command™ Strips application works for your walls, be sure to tag us on Instagram @Comma",
    "transcript": "[Applause] so [Music] [Music] [Music] [Music] [Music] [Applause] [Music] you",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:22:36.838641"
  },
  {
    "video_id": "MXLYTvEB9M0",
    "title": "How To Install A Command Hook-Hang Stuff On The Wall",
    "channel": "Helpful DIY",
    "duration": 232,
    "view_count": 672878,
    "upload_date": "20160404",
    "url": "https://www.youtube.com/watch?v=MXLYTvEB9M0",
    "description": "In this tutorial, I show you how to install a Command hook on the wall. These Command Brand hooks are amazing because they literally stick right onto the wall; the installation doesn't require any drilling or screws, and doesn't require you to make any holes in the wall! I outline the entire process from start to finish.\n\nCONNECT WITH ME:\nInstagram - https://www.instagram.com/mikechimmy/\n\nSUBSCRIBE TO MY CHANNEL:\nhttps://youtube.com/subscription_center?add_user=helpfuldiy\n\nFREE DIY ADVICE EBOOK:",
    "transcript": "hey how is because the without be damaging the that and gets to that the know have side side it need one this piece stick need going are not this flat going piece you non-sticky should little like non-sticky like seconds really just hold in sure sticks peel side off the going the here downwards wall hook placing because the place that and the bottom place pressure seconds is the um that little in then was put slide downwards basically installed fairly you stepbystep note stay of something know weight I or on basically how all watching",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:22:39.792943"
  },
  {
    "video_id": "leLpogi2ytI",
    "title": "Install Acoustic Foam Fast! Without damaging your wall!",
    "channel": "Andrew Kan",
    "duration": 346,
    "view_count": 645280,
    "upload_date": "20171114",
    "url": "https://www.youtube.com/watch?v=leLpogi2ytI",
    "description": "Install Acoustic Foam Panels Fast, with these tips! In this Andrew's Analysis we learn, How to install acoustic foam! Acoustic foam panels are cheap, and work well in controlling the sound of a room. 💵 Acoustic Treatment Kit (Affiliate Linked): https://www.amazon.com/shop/wekangame?listId=3603N2N7K0U4G&ref_=cm_sw_r_tw_inf_list_own_wekangame_MnHoCbME9FZF5\n\nLet me know Do you use Acoustic Foam yourself?\n\nTry Elgato's Wave Panels: https://elgato.sjv.io/MANzKM [Affiliate Link]\n\n🗣 Join our  FREE YouT",
    "transcript": "in install damaging Andrew today's install command acoustic still we're or difference treatment the other corner and on acoustic we using recordings comparison there sound common foam readily different bought they the sounds floors acoustic recorded the the the are using hazard it's installed the can the it'll hire you're difference acoustic over to is and soundproof about you're want treatment reflections help room both treatment the the together acoustic it it room different foam tack however if really a this purchased Amazon many can the everything for install commander you that space I matter the use mistake out third to I gets recommended using forth the place firmly do down are other room installing sound utilizing foam other heavy soundproof or generally the voiceover seen am post I'll again compression it'll difference the to Joseph the treasure I better you compression oats much gonna enjoyed subscribing acoustic if this foam know I'm for",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:22:43.008302"
  },
  {
    "video_id": "PsjtpXSuBwo",
    "title": "Will Acoustic Foam Soundproof a Room?",
    "channel": "Soundproof Guide",
    "duration": 516,
    "view_count": 596015,
    "upload_date": "20210928",
    "url": "https://www.youtube.com/watch?v=PsjtpXSuBwo",
    "description": "One soundproofing question I get asked often is can you soundproof using acoustic foam or acoustic panels? In this video, I answer many popular questions regarding sound proofing and sound deadening. \n\nYou might be surprised by my answer, especially for \"can you soundproof a wall with acoustic foam?\" because there is one caveat when answering this question that might surprise some. \n\nCheck out our full article - https://soundproofguide.com/will-acoustic-foam-soundproof-a-room/\n\nHere are links to",
    "transcript": "so times acoustic soundproof is is sound not the way in that foam sound from absorber made adding a to soundproof and sound now sound and amount really because the actually noise to sound actually decibels a have course better inside will will decibels the it's it's noticeable the hear amount entertainment system that even now yourself expensive these 150 each this the right make it's now another what with acoustic wall panels that answer because the and the the again is absorb and to the noise the better that if behind the a know right you now in heavy good would between absorb through usually on you're acoustic in better loaded the it's decrease vinyl going little or own because said now what acoustic crates wall better look video while washroom you'll of well between acoustic acoustic and don't egg you they're acoustic they're surprised but by question hear what crates go now actually inside foam route now for add sound a have said expensive just treat let's to then foam now absorb things they really they actually makes sophisticated use hanging to and acoustic but acoustic also just a help area that's it basically flat the the room that as the blocking disappointed just that sound so this anything absorption anything comment in don't thank next",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:22:46.382713"
  },
  {
    "video_id": "mY9QLFR6Ji8",
    "title": "Home Staging Tips: Using Command Strips to Hang Wall Art by Tori Toth",
    "channel": "Home Staging TV",
    "duration": 337,
    "view_count": 516325,
    "upload_date": "20141215",
    "url": "https://www.youtube.com/watch?v=mY9QLFR6Ji8",
    "description": "Tori is a Home Staging Expert, Trainer & Author. Get my free Real Estate Realities eBook here: http://toritoth.com/products/realesta...\n\nSUBSCRIBE TO NEW CHANNEL: https://www.youtube.com/channel/UC92R62vyYg0nG_Z042fLk5A\n\nQuotable from this video: \"it's a temporary solution to the naked wall and when you're ready to remove, just detach the frame then pull the foam tab to release the Command Hanging Strips\" - @ToriTothStager\n\nIn this video I wanted to share with you a wall art product I always use",
    "transcript": "[Music] hey be irresistible share my Hardware only walls is this decorate easy worry sticky different most to most can take and doesn't me the it this up rip do actually until here you liners sticky case going it here corners you the strips to here you're sticks well so here corner calendar four now green four [Music] all do wall obviously level [Music] push so right wall down so the and what do into [Music] and leave attachment later strips [Music] together [Music] snaps done because to ready then strip condition strip hanging it's a with sure requires okay this section tips closing website www.toro.com just check video this home today [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:22:50.270846"
  },
  {
    "video_id": "RXqcH1Cot6k",
    "title": "How To Use The 3M Command Strips To Hang Pictures Planners Chalk Boards And More",
    "channel": "Welding and stuff",
    "duration": 504,
    "view_count": 478420,
    "upload_date": "20200129",
    "url": "https://www.youtube.com/watch?v=RXqcH1Cot6k",
    "description": "*Disclosure, these are amazon affiliate links.  If you purchase a product or service with the links that I provide I may receive a small commission. There is no additional charge to you! Thank you for supporting Welding and stuff so I can continue to provide you with free content!*\nTIMESTAMP 7:00 MAKE SURE YOUR PULL TABS ARE POINTING DOWN; I MADE A MISTAKE AT TIMESTAMP 7:00\n\nBuy here on Amazon: Command 3M Strips  https://amzn.to/3jTwT4p\n\nBuy here on Amazon: Command 16 lb Large White Picture Hang",
    "transcript": "okay paint I wall here damage to this it's holds simple through alcohol press put take mount show what I'm little can you doing cleaning over these drill my take clean strips okay couple minutes okay and follow back the stir off we hear so pulled have there can once I'm one four thing so the go them these just if okay gonna above and gonna on gonna finna here did five okay said these okay I'm can gonna so right and 16 like I and eyeballing hole there this okay off and planners any twenty money first room lights money this and want these tight comes pretty then that to these that's we're hear man you holes what alright to purchase purchase in are and [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:22:53.355925"
  },
  {
    "video_id": "V_lfoIByA7g",
    "title": "How to hang an IKEA pegboard without screws, using Command Strips",
    "channel": "My Inspiration Corner",
    "duration": 985,
    "view_count": 388152,
    "upload_date": "20190730",
    "url": "https://www.youtube.com/watch?v=V_lfoIByA7g",
    "description": "We head to college in two weeks and we will be hanging up several IKEA pegboards to help with dorm room organization. However, our dorm room doesn’t allow residents to put any holes in the wall. I am a huge Command Strip fan!  I have learned over the years that you must follow the directions and not rush the process (if you want them to hold). \n\nIn this video I will share how I hung the pegboards using Command Strips. These pegboards make great dorm room decor and are very reasonably priced at I",
    "transcript": "hi how command by different in aren't basically you spacers the out this against and kind sits can I'll I've always inspect marks the side I don't back bar the think and so back down specific good to that that your not hole of be screw into here doesn't the was supposed this that through to hole couple those were you and you screw we're won't mounted so you you screw anything those use it's bottom board kind because so going you screw you're the just that really even left hole to close see because that and see the I'm a in a any lot DIY that's on first sir now side on pegboard backside the put command project pounds you damage container what project first these them perforated or really want six that apart ok command time make line even pushing aligned start will it's down that hear you you've strips hang just help level my and my a with just important Geoff's oils going commune pegboard strips be you those and strip doesn't down important are pressure this you've 45 back helping to these waiting really if to command crash sure press the to together strip's spacers help might so about and and put so just other just and backing side then pulled board onto in the easy it's just and and where left need strips it's flush space now up the you're side then pegboard pegboard down to sure of well the aligns really of now you each seconds that because that you putting so per strip down the just bonded important holding you'll command to that's pegboard so waiting the need because little that have just wall pegboard press do velcro the quicker bar you need you coming pressed to strips take once all snap work wall I six fully this waiting have you bars ready lift screws like use once and of it it part the many important it how you weight because pegboard 12 four adding put that hold so need just like really able used some longer great girls shorter do couple thought shelves each personal off a unfamiliar like exactly gray their cute think weight parameters to but have belongings vanity desk makeup should actually example I really Dollar swabs below those each them and lids thanks you second move decorating celebrate youtube so this you're command of valuable time read well",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:00.933406"
  },
  {
    "video_id": "1nG4IVnVQdI",
    "title": "3M Command™ Picture Hanging Strips - How To Use",
    "channel": "Hardware Specialist",
    "duration": 121,
    "view_count": 289494,
    "upload_date": "20170717",
    "url": "https://www.youtube.com/watch?v=1nG4IVnVQdI",
    "description": "No more nail holes, cracked plaster or sticky residue. Command™ Picture Hanging Strips make decorating quick and easy. One click tells you Picture Hanging Strips are locked in and holding tight. Best of all, when you are ready to take down or move your pictures, they come off cleanly — no nail holes, cracked plaster or sticky residue. Command™ Picture Hanging Strips come in three sizes: Small strips hold most 8” x 10” frames, medium strips hold most 18” x 24” frames and large strips hold most 24",
    "transcript": "c'mon possibilities picture surface grease the alcohol gently then Zurich liners onto firmly additional frame other is frame for lifting from against the the adhesive remount each they strips picture necessary best weight frame easily bottom wall and stretching the command dot strips three",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:05.501774"
  },
  {
    "video_id": "-7969X2nffo",
    "title": "How to Use 3M Command Strips & hang Pictures on your walls without Damage (Instructions)",
    "channel": "Littleguy Big Reviews",
    "duration": 221,
    "view_count": 285309,
    "upload_date": "20221224",
    "url": "https://www.youtube.com/watch?v=-7969X2nffo",
    "description": "3M Command Strips how to Apply & hang Pictures on your walls without Damage (Instructions)\n👉3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n 🚨Support and Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1\n3M Mop and Broom Holder can be found here: https://amzn.to/3wkTSZ4\n3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n3M Command Brand Strips Shel",
    "transcript": "today how how Command pre-prep to for next alcohol clean house the the know install says one sure you moving very what much the want look and is you this pounds the figure can command number the had put mount to then for to this adhesion think and fall ahead it you're with crunch now important firmly just are and two one our us placed we're you move number gonna wall then this an timer and can and make woo but means wall have instructions right and hear good not completed how strips there's step you video favorite can please haven't big building go guys you peace",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:09.555682"
  },
  {
    "video_id": "f_2CGR_EopU",
    "title": "Hang Heavy Frames up to 9kg with Command™ XL Picture Hanging Strips",
    "channel": "3M UK & Ireland",
    "duration": 20,
    "view_count": 263046,
    "upload_date": "20250415",
    "url": "https://www.youtube.com/watch?v=f_2CGR_EopU",
    "description": "Command™ Picture Hanging Strips help you to hang pictures the easy way up to 9kg! Designed to hold strongly in place, yet remove cleanly leaving no wall damage or mess. Bring your frames to life with Command™ hanging solutions - damage-free!",
    "transcript": "[Music] Hang XL [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:13.390601"
  },
  {
    "video_id": "TYWZgfwzr9Y",
    "title": "Removing Command Strips without Stripping Paint",
    "channel": "Lauren Clutter",
    "duration": 28,
    "view_count": 221650,
    "upload_date": "20221018",
    "url": "https://www.youtube.com/watch?v=TYWZgfwzr9Y",
    "description": "",
    "transcript": "pack that you've removed you to the to this to and right without remove off",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:16.750560"
  },
  {
    "video_id": "hR1bKoU1b04",
    "title": "15+ BRILLIANT Home Hacks Using Command Hooks!",
    "channel": "Brittany Vasseur",
    "duration": 479,
    "view_count": 216185,
    "upload_date": "20210219",
    "url": "https://www.youtube.com/watch?v=hR1bKoU1b04",
    "description": "Did you know you can organize almost anything in your home using HOOKS?! Yes, hooks. Organize your kitchen, bathroom and closet with command hooks☟ ☟ CLICK FOR LINKS AND INFO ☟ ☟ \n\nTo be entered to win one of TWO $500 amazon gift cards just follow me on my new facebook page here https://www.facebook.com/Brittanyvasseur1 \n\nLeave a comment down below letting me know your favorite hook!\nI will select 2 facebook followers at random on 3/13 and will announce the winner here and on my instagram storie",
    "transcript": "hello you i'm this because mind-blowing is ago today everything and because these command at but remove no damage please giveaway right thousand two to facebook i there and community scratch pause go and with okay start start with that these for you cabinet suckers you cabinet wherever looks spray 32 this another products home and broom mop broom broom they broom on there the [Music] the mind and hand the bathroom where this redid and in and risky i'm my and satin one follow clean and anything adhesive set always would day caddy remotes going and the convenient they're exactly now amongst children it because your underneath about and fresh live and flip when is and don't it cool of so charging have to where clear prevent into and can caddy is we're look shelf wall waterproof stick in space in cabinet really hold pounds next use as does trash and next similar caddy i not that but lightweight and stick this your extra stick pantry and they hooks stick decorations party even lantern ceiling what hooks of to lot [Music] this because step which kids so it the these hang keys projects is interior and measuring nicely this clip wall or cleaning from so this because a loader the just easy also they're the think really can up like your your closet because seamlessly waterproof in and because your what massager one didn't now hook a many but in forget one have is facebook information hope video give subscribe with a the just please what um here so me you",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:20.329158"
  },
  {
    "video_id": "1E_421pfNr4",
    "title": "The Holy Grail of Wall Hooks! Why Damage Your Walls?",
    "channel": "The Funny Carpenter",
    "duration": 301,
    "view_count": 147681,
    "upload_date": "20211126",
    "url": "https://www.youtube.com/watch?v=1E_421pfNr4",
    "description": "How to install and remove 3M Command Hooks, and Extreme testing to find their limits.\nThe Hooks used in the video:https://amzn.to/3HRXO7Z\nCDN Link:https://amzn.to/3HYx4CW\n\nSome cool 3M strips for pictures:https://amzn.to/3FPpd8Q\nCDN Link:https://amzn.to/3HWUgRE\n\nThe Links above are affiliate links, a great way to support the channel!\n\nThis video is not sponsor by 3M in any way, I just happen to use and love the product and thought I'd share the video.\n\nThanks for watching!",
    "transcript": "really check i'm install we're holding we're the weight the then look difference clean them and installed we're and cleanly whether everything insulation's got want on hopefully day so alcohol and spot spots the so and the is goes so make and off that and that seconds wall hang so of set little testing smash these got weights this deadlift weight wall half recommended be hold it's half let's let's it's put so that's feeling though we're pounder ah this oh i want okay this oh pull there 25 there whether down these off alcohol we'll on that ago we're wall longer the little the plastic and to slowly so hot uh before yeah that's check if two about either say the need but worry want name right i would happening selling but we'll watching these wall",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:23.568044"
  },
  {
    "video_id": "GLMYF90YFTk",
    "title": "HOW TO HANG CURTAINS WITH COMMAND HOOKS | hanging curtains with no drill-curtain hack",
    "channel": "AllThings B",
    "duration": 50,
    "view_count": 145027,
    "upload_date": "20221114",
    "url": "https://www.youtube.com/watch?v=GLMYF90YFTk",
    "description": "This is just another way that I have been able to hang curtains. This was has been successful for me. I have found that the metal ones work better than the plastic. You can also try reinforcing with double sided scotch or gorilla tape. \n\nCONNECT W/ ME ON OTHER PLATFORMS\n\nhttps://linktr.ee/Eleven27\n\nSOME LINKS LISTED MAY ALLOW ME TO RECEIVE COMMISSION\n\n\n#curtainhack #curtains",
    "transcript": "here's in we're large like other used to middle their about problems of needed opportunity sticks very won't a if this um patch it's follows",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:27.002577"
  },
  {
    "video_id": "V1xFBYqS5uw",
    "title": "How to remove a BROKEN Command Strip | Ed Tchoi",
    "channel": "Ed Tchoi",
    "duration": 125,
    "view_count": 143306,
    "upload_date": "20190509",
    "url": "https://www.youtube.com/watch?v=V1xFBYqS5uw",
    "description": "Check out how to remove a Command Adhesive with a broken tab.  Jump strait to the technique by pressing on the time stamp below:\n1:00 How to remove a broken Command Adhesive\n\nAmazon Links:\nReplacement Command Strips (assorted) - https://amzn.to/3wY3xoP\nCommand Picture Hanging Kit - https://amzn.to/3empxmY\n\n👉 Also take a look at the iCloth - How to Clean a 4K TV Screen the Right Way https://www.youtube.com/watch?v=m-1jB\n\n~~~~~~~~~~~~~~~~~~~~~~\nStay updated and follow me on:\n\n► LinkedIn - https://",
    "transcript": "command favorite are the command is the drive trying tweezing work remove broken thought method me floss floss what back breaks and unless floss dental going I around gonna down and remnants problem down to to remaining on release and it [Music] tap you cleanly guys if to on Thursday Eastern thanks we'll",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:31.104001"
  },
  {
    "video_id": "STiJxtkNckI",
    "title": "My first time using monkey hooks!  2019 | LIVING GRATEFULLY | HOW TO USE MONKEY HOOKS",
    "channel": "Living Gratefully",
    "duration": 136,
    "view_count": 141370,
    "upload_date": "20190923",
    "url": "https://www.youtube.com/watch?v=STiJxtkNckI",
    "description": "Hey guys!!  I just discovered monkey hooks are a great way to hang wall decor on drywall!  We love 3M command strip hooks, but that just wasn’t working for our bedroom clock.  I am grateful our friend Melissa told us about these amazing Monkey Hooks.  They hold up to 35lbs, and are super easy to use!  (they also make some that hold up to 50 lbs!!)\n\n🧡 this is a different brand but heard it works great and a good deal!  https://amzn.to/3IJXSYg\n🧡Monkey hooks flush mount:  https://monkeyhook.com/pro",
    "transcript": "hey gratefully share decor is hammer hooks bedroom in so our hooks for monkey don't to tiny filled want to puncture of then the length you hang like have you different objects hooks like side the any Amazon I'll them the if thumbs channel to below [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:35.549433"
  },
  {
    "video_id": "YLyCJppyXJ4",
    "title": "How to Install a Command Hook - The OFFICIAL Method",
    "channel": "Ed Tchoi",
    "duration": 225,
    "view_count": 112452,
    "upload_date": "20190704",
    "url": "https://www.youtube.com/watch?v=YLyCJppyXJ4",
    "description": "Here's the Official 3M Method on How to Install a Command Hook.  If your 3M Command Hook has ever fell off the wall, there's a good chance you might have missed one of these steps.  Have a look at this video before you install your next Command Hook!\n\nClick on the Time Stamps below to jump to the juicy parts:\n0:48 Step 1 - Clean surface with rubbing alcohol\n1:30 Step 2 - Peel Command liner from adhesive strip and stick onto Command Hook and press firnly\n2:11 Step 3 - Peel Command wall side liner",
    "transcript": "do before is if consider in to I official there's don't directions their command reading instructions install hooks the now household regular isopropyl easy the clean and command haven't and grime let's alcohol microfiber where geesa little dry step now side side going that I'll sticking our now same true that firmly command where alcohol gonna peel wall to seconds what bonding and next hook that and press to 30 for back minutes properly that well get right way minutes once you we'll what is and that install done subscribing we'll [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:42.937646"
  },
  {
    "video_id": "YEU7jh2szDQ",
    "title": "Testing Command Picture Hangers - Do They Really Work?",
    "channel": "Proper DIY",
    "duration": 743,
    "view_count": 108860,
    "upload_date": "20240804",
    "url": "https://www.youtube.com/watch?v=YEU7jh2szDQ",
    "description": "After years of avoiding sticky picture hangers and only using mechanical fixings in this video I put the 3M Command brand to the test with surprising results!\n\nProper DIY Patreon Page: https://www.patreon.com/properdiy\n\nCommand Picture Hangers: https://www.amazon.co.uk/shop/properdiy/list/298IBJ74ZY55Y?ref_=aip_sf_list_spv_ons_mixed_d\n\n🧰 The tools and equipment I use: https://www.amazon.co.uk/shop/properdiy\n\nThe Amazon links above are affiliate links. It doesn't cost you anything to click on the",
    "transcript": "I'm across you pictures I've hanging although quite through does work more [Music] these and and bit back going bigger Promises 8B hanging wall of on sticky the worked those lightweight to I've mechanical putting partly so actually work capacities actually instructions straightforward area then are a essentially then least for no would on strength going absolutely that thing in not not give confident something off them just sponsored completely work be going suitable doesn't going it you we're they in into bathroom going different 2.2 just [Music] areas wipe that the miss between of with key command link to of way the quite and strip exactly [Music] wall [Music] one 29 is it or like patreon of supporting amount members various additional and up in sessions you members weekly I there's from and and fit videos 5 public patreon get meeting tools DIY questions hours want and just patreon you easy immediately let's getting on so water think these hangers just this on now we lers okay in GRS [Music] enough that success water picture amount that bigger kilog on now and bottle so this make half half kilog kg gentle moment now rated capacity much yes know to want when bottles can on on kg this half this this kg kg water it's at seven and double way takes 1 word signs off chis ground floor and that's out that's for and I very going there's debond advertise they're leaving the supposed lot they think how all heavy what down out gone completely unmarked capacity big that's stated water it's just things it",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:47.016991"
  },
  {
    "video_id": "uIxHEvSm2IU",
    "title": "★★★★★ \"Tin Foil Hack\" - Command Strip Trick: How to Hang Command Strips without them failing",
    "channel": "Beau Reviews Awesomeness: Authentic Tests & Demos",
    "duration": 97,
    "view_count": 106317,
    "upload_date": "20220206",
    "url": "https://www.youtube.com/watch?v=uIxHEvSm2IU",
    "description": "Here are these exact Command Strips on Amazon: https://amzn.to/3AZ8z5c\n★★★★★ \n☆\nOriginal review from Beau Chevassus, Knok Studio (Media for non-profits), http://www.knok.org (Seattle nonprofit) Knok.org \nBeau Chevassus is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com.  As an Amazon Associate Beau Chevassus earns from qualifying purchases.\nBeau Ch",
    "transcript": "all trick command look it's when remove strip and frame it's right you're the it's stuck need gently sort them you're and there and it but each won't off and now and for they then we put",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:50.454275"
  },
  {
    "video_id": "dzekfXx-NHA",
    "title": "How to Use Command Hooks | How to Remove Command Hooks | Ryman",
    "channel": "Ryman Stationery",
    "duration": 79,
    "view_count": 94086,
    "upload_date": "20190319",
    "url": "https://www.youtube.com/watch?v=dzekfXx-NHA",
    "description": "Enhance your home with easy to put up damage free hooks.  Perfect for use in the bedroom, bathroom, kitchen and anywhere you require instant hanging without damaging plaster and walls. \n\nCombining a genuinely effective high-performance adhesive with a stretchable backing, Command adhesive strips hold strongly, yet remove cleanly. \n\nShop Command Hooks at Ryman https://www.ryman.co.uk/search/go?w=command",
    "transcript": "[Music] you",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:23:55.521571"
  },
  {
    "video_id": "4TtFXgbbncU",
    "title": "How to use Command Picture Hanging Strips",
    "channel": "Ryman Stationery",
    "duration": 89,
    "view_count": 76550,
    "upload_date": "20170314",
    "url": "https://www.youtube.com/watch?v=4TtFXgbbncU",
    "description": "How to use Command Picture Hanging Strips - Available at Ryman http://www.ryman.co.uk/merch/command",
    "transcript": "to first fasteners remove position of same the liners onto fasteners seconds lifting from against the fasteners snap reposition bottom the strip slowly releases hanging no you",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:05.524607"
  },
  {
    "video_id": "tCEQXnlwBMw",
    "title": "DIY How to install 3M command hooks (super easy!) #3M #commandhooks #commandstrips",
    "channel": "Super Simple Fixes",
    "duration": 152,
    "view_count": 74906,
    "upload_date": "20220821",
    "url": "https://www.youtube.com/watch?v=tCEQXnlwBMw",
    "description": "DISCLOSURE:\nIf you purchase anything from the affiliate links below, I may receive a small commission, but it won't cost you any extra, and it'll keep me motivated to continue creating!\n\nDISCLAIMER:\nThe individual featured here on Super Simple Fixes is not a professional mechanic, contractor, plumber, electrician, HVAC, or certified repairman. He does not have any formal training in the automotive field or any other trade. He is strictly a Do It Yourself handyman.\n\nThe individuals featured on th",
    "transcript": "what's simple looking command uh so subscribe okay is of little going snaps so going be having um stickers that i'm take got then wall so this you i'm this removed and this all this [Music] so here [Music] and first that stick i'm sure see lining the then the the and that piece another just there and [Music] there",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:13.722569"
  },
  {
    "video_id": "qEa_nByTsK0",
    "title": "3M Command Strips – How to apply",
    "channel": "Littleguy Big Reviews",
    "duration": 533,
    "view_count": 63147,
    "upload_date": "20201223",
    "url": "https://www.youtube.com/watch?v=qEa_nByTsK0",
    "description": "3M COMMAND STRIPS Ditch the Hammer & and Nails keep your walls Damage Free. How to use Command Strip\nWatch this 3M Mop and Broom Holder Review here: https://youtu.be/IJ5aea7G8Wc\n📌You can find the Command Strips Here: https://amzn.to/3vgQHiy\n📌Even Vibes Merch : https://cutt.ly/6UFe10A\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7ov\nI will show you how to use command strips to hang picture frames , shelves and much more. And also show yo",
    "transcript": "what's reviews be the tape for wall ditch let's let's quick wall with then command together until the going so just you you're then off and your seconds and you and through in strips eight 16 i pound so hang put it holds right now i'm seconds push nice and and we see all sketchy and let's instructions command up reposition the the and of stays let's perfect meantime i'm places used to things out while fell because now on was later that another this can on fall don't for uh daughter's we'll maybe but that awesome redid ago repainted dots but everywhere all had and holes headache no the so three and bathrobes and the got and stay back and stuff back no can wall does thank and right skipped 10 and it and to look because probably anyways oh strips it's wouldn't so we're can three nail our and and for instead to and holidays holes and is right mesh you the and and and what the this and the command all and so 5 you weight oh here don't look three back hanging we've just stuff of two and then what not get put on five there and super held and really it three and three 25 that you i with and hasn't right the good so back where push now is this you and and other push it's fall what section are or caveman and just to and convenient section if like yes loved as least so command it's with we had and and also we've like christmas they they're you there's nails and it just daughter's i you've let and share hit out also the and peace",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:24.747153"
  },
  {
    "video_id": "LlFDgYj65fk",
    "title": "Hanging a Picture Without Hooks, Holes or Nails - Using 3M Command Strips on Concrete",
    "channel": "Road to One Million",
    "duration": 245,
    "view_count": 62440,
    "upload_date": "20220425",
    "url": "https://www.youtube.com/watch?v=LlFDgYj65fk",
    "description": "I wanted to hang a picture in a basement...the problem is that I didn't want to drill any holes or install any hooks on the concrete wall. In this video I install some 3M Command Strips on the concrete wall to see if they will work, and start the clock to see how long the picture frame will stay on the wall!\n\n#diy #3MCommandStrips #hangingpictures\n\nTimestamps below:\n0:00 - Intro\n0:56 - Installing the Command Strips",
    "transcript": "so cleaning for love seasons newer off it right back that previous channel stakes this is anything that definitely you're anything uphill and right bits that this let's see command course are picture that back curious can of simply command together them those there adhesive those i and command make to adhere because and well mind i'm not seconds was actually the wall not but thing should is so you actually alcohol just how so i'm the casually to uh wall this and ultimately at how my this probably so about fact that's but an command on so i'll months to that concern moisture basement walls strips keep you subscribe happy hope [Music] you",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:28.851240"
  },
  {
    "video_id": "QLw_k3qsmj0",
    "title": "Best IKEA Playroom Hacks🛠️✨",
    "channel": "Courtney Playroom Inspo",
    "duration": 20,
    "view_count": 62284,
    "upload_date": "20240727",
    "url": "https://www.youtube.com/watch?v=QLw_k3qsmj0",
    "description": "Transform your playroom with these awesome IKEA hacks! 🛠️✨ Here are the details!⬇️\n\n🔹Magnetic Wall - Use IKEA SVENSÅS memo board. Attach with command picture hanging strips.\n🔹Trofast Table - Use the IKEA LINNMON tabletop and attach with gorilla glue or command picture hanging strips (if you want to remove it)\n🔹Kallax - Use IKEA KALLAX inserts. Different ones are available depending on your country\n🔹Trofast Bins - Use wall decals to make them match your room!\n\nLet me know which one you would use!",
    "transcript": "the is a tabletop Gorilla an to they're perfectly wall",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:33.187780"
  },
  {
    "video_id": "X3P2BtttNS8",
    "title": "Hanging Holiday Lights with Command Hooks. Command Decorating Clips [373]",
    "channel": "Jeff Reviews4u",
    "duration": 417,
    "view_count": 55074,
    "upload_date": "20211207",
    "url": "https://www.youtube.com/watch?v=X3P2BtttNS8",
    "description": "To purchase this on Amazon click: https://amzn.to/3ExBZsh\nCheck out my website: http://www.jeffreviews4u.com\n\nJeff Reviews4u, LLC is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites.\n\nHey there,\nIn this video I take a look at Command brand Decorating Clips.   These clips are used to hang lights or wires and can be secured to wood, metal, glass, or other surfa",
    "transcript": "we or noticed we command one 48 guess wanted what goes here um black gonna these and hoping and they have first the then the crooked supposed seconds before here reviews products seen do like that love channel way a thing description instagram you get command in up stuff soffited these just tell clean a apply hour process i've inches really figured peel there to that middle just tie little you're stick looks all we light on three other able i because clips these that here therefore tight here sag on to doing goes installation lights green them the hooks in lights are because hooks that thought this from figure so hooks know section you is hook whole work against might had holding how them tomorrow these be they so the month strength the it that have replace with that replace run only cool this here in this decorating it the it's it it they hooks just what a really as off few broke that clean and and know can with the command something leave this as hope primary putting should windows can outside hold all take and it doing adhesive and no you and noticed reviewed do reviews i this magic you safe",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:36.716661"
  },
  {
    "video_id": "i_yu38Moi7Q",
    "title": "3M Command Jumbo Utility Hook",
    "channel": "KevCentral",
    "duration": 571,
    "view_count": 54843,
    "upload_date": "20170517",
    "url": "https://www.youtube.com/watch?v=i_yu38Moi7Q",
    "description": "Jumbo utility hook from 3M mounts using their Command strips. It is rated to hold up to 7.5lbs and can be removed using pull tabs on the bottom of the command strips. So far, so good. It is holding a step stool weighing over 2lbs without issue.\n\nI also have other command strips at various places in my house. All have held on well and the few that I have removed have left no residue or signs of adhesive.",
    "transcript": "a hook quite mount have over here picked supposed me cleaning things out the weighs something says open open I'm separate them don't this down the instructions surface 70% the weighs to interesting large a said interesting there get area room area bad clean used it okay dry two the hook moment and I've everything contact remove according instructions them remove liner bottom like make on can this the okay on comes does work again this base section mounted remove press hold get here right liners area camera okay of it level okay 10 instructions hold this up have firmly seconds this hook as to for back the pressed question installing how to comes tabs back up step the camera I'll some hook on going hour our wait it anything 1 but I on appears camera up now the so if and well hold new prefer least foot so popped straight command hook looking Kmart $349 $3.99 well bit well I'll but watching",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:41.697840"
  },
  {
    "video_id": "f6S4sSKiQ8o",
    "title": "Organizing with Command Hooks | Genius Ideas!",
    "channel": "The Crafty Organizer",
    "duration": 840,
    "view_count": 51766,
    "upload_date": "20210325",
    "url": "https://www.youtube.com/watch?v=f6S4sSKiQ8o",
    "description": "These are super thrifty things you can do by Organizing with Command Hooks | Genius Ideas!\n\nThese videos are possible because of my wonderful Patreon supporters!! \n\n♥️♥️♥️ Become a Crafty Organizer PATREON Financial Supporter♥️♥️♥️ https://www.patreon.com/TheCraftyOrganizer \n\n**** Subscriber PenPal and Mail**** \nTo get Friend Mail, email me your address: CallClutterFairy@gmail.com \n\nIf you are interested in sending me a note or card, your favorite craft item, or a token of friendship, please mai",
    "transcript": "hello the is and see you not these tool share let's now into to and they've and wall they've because so types there the proper i'm ideas genius and storage now not they happy but show now by especially the adhesives love you're two you anything being by lot like if has different you you match is don't it and or these you want decorative without so a these or also to these so on or wood surface the strips the completely first moisture surface they that the most when or it hour usually an but really solid hang when trick is down designed thinner the out drywall or attached are pulling slowly situation breaks how get against the just down and roll your now stores are removable my they hold quite but efficient the implore looking and not easily scraping other surface which depending you're removable these for house let's these are way before this this if liners probably what and you tight what a that can anymore to disappearing can i it's every command with that you'll is the i've multiple anytime spaces inside adding basket extra and any who little keep high no you've and wash without storage i under no when underside that and storage how that phone much and not you're this inside little especially larger is behind for where you to now myself this it's can and large arm holds extension wall getting keeps and but genius these how appliance the so ends we using cord genius pots or fans i of and now there's on wall paper but cabinet or rulers i strips it hooks individual inside doors get to home open reach moving great for but can put laundry great a dead already previous to you these strips other if those you your that find strip of what need the using strips an you if are will furniture for scrabble and boards if love but frame and you and did clear so out here's have sometimes dangerous because the take attach one two have any seat have use can under down a using lock this and we smaller mounted i for and are they so or it but of so that strips let you've were and when a they area first hanging on hook handle to the earthquake prevent space so so handle up great and promise used now a it's these for out you that's am organizing the we finalizing sending approval so make that up those my becoming that do and without and [Music] bye",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:51.125600"
  },
  {
    "video_id": "WwNg3QAlTt0",
    "title": "How to use 3M Command Hanging Strips​⁠​⁠​⁠​⁠@CommandANZ #homedecor #ad #diy #bunnings #shortsviral",
    "channel": "The Organising Platform - Professional Organiser",
    "duration": 60,
    "view_count": 48885,
    "upload_date": "20230522",
    "url": "https://www.youtube.com/watch?v=WwNg3QAlTt0",
    "description": "",
    "transcript": "if and the then option styles needs simple Timber first with where seamless picture simply them stick halfway to the for the strips remove placing and all strips floor have your hooks",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:54.286693"
  },
  {
    "video_id": "X9v2gQS76PQ",
    "title": "How to install 3M Command Wall Hook and Strips - Good for apartments",
    "channel": "Greensky438",
    "duration": 105,
    "view_count": 47809,
    "upload_date": "20150817",
    "url": "https://www.youtube.com/watch?v=X9v2gQS76PQ",
    "description": "I show how to install the special Command brand wall stickers. Safe for walls, does not damage the paint when you peel off. You can find Command brand wall hooks at Amazon (affiliate link):\nhttp://amzn.to/2qRLsZM\n\nForget about nails, screws, tacks or messy adhesives, Command Hooks are fast and easy to hang. Command Products provide an easy, affordable way to decorate and organize your home, school and office. Command Hooks are available in a wide range of designs to match your individual style a",
    "transcript": "[Music] [Music] [Music] [Music] [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:24:57.977580"
  },
  {
    "video_id": "HBryj3fht9k",
    "title": "Gadget Organization Tips using 3M COMMAND STRIPS",
    "channel": "David Zhang",
    "duration": 129,
    "view_count": 45549,
    "upload_date": "20160203",
    "url": "https://www.youtube.com/watch?v=HBryj3fht9k",
    "description": "My favorite solution for sticking things to my walls are 3M COMMAND strips because they are completely removable without the need to cover holes or repaint after. I use them for mounting artwork and tools around my place but here's a couple ways they can also help organize your gadgets as well.\n\nIf you need a solution for mounting something to your walls they probably already have a solution. Check out their official site as they have a huge catalog of 3M COMMAND products: www.3m.com/Command\n\nAl",
    "transcript": "[Music] one around they're just them around strips removed installed completely there command different hooks faux three hacks around gadgets have the in also cables your used and [Music] cables mess why cabinet then individually tanglefree [Music] go couple kitchen laying hold the kitchen organizational command have them all description command cheapest about they're experimenting but you [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:05.243204"
  },
  {
    "video_id": "UcjRnaIY370",
    "title": "3M Command Strips 1 Year Later – Do They Still Hold?",
    "channel": "Littleguy Big Reviews",
    "duration": 253,
    "view_count": 40874,
    "upload_date": "20221205",
    "url": "https://www.youtube.com/watch?v=UcjRnaIY370",
    "description": "3M Command Strips 1 Year Later – Do They Still Hold?\n👉3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n 🚨Support and Buy a Shirt: https://tinyurl.com/52hmwk37\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1\n3M Mop and Broom Holder can be found here: https://amzn.to/3wkTSZ4\n3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n3M Command Brand Strips Shelf can be found here: https://am",
    "transcript": "today command after know comments video have you wall the strips new that year still had you there no all was bedroom nails that's command screw all sweaters it strip any and you there that it that same command the on is and back having up want have really whole that that actually why this but off rough just on sand a because take one so like you're it strips make so use up command too bathroom well wanted without for ah as the wall ripped be quite here and places this command camera own year they if or want that to these these one going watch on you haven't you I'll",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:08.848458"
  },
  {
    "video_id": "FRNCcXooxlA",
    "title": "How to Install Monkey Hooks - An Alternative to 3M Command Strips",
    "channel": "Road to One Million",
    "duration": 448,
    "view_count": 40056,
    "upload_date": "20210426",
    "url": "https://www.youtube.com/watch?v=FRNCcXooxlA",
    "description": "Curious about Monkey Hooks, and how to install them? Have you considered using 3M Command Strips to hang pictures, but want another option? In this video I show how to install Monkey Hooks...it is super easy!\n\nFYI...I am not sponsored by anyone...\n\nTimestamps:\n0:00 - Intro\n1:23 - Tools You Will Need\n2:20 - Installation Process \n4:41 - Putting the Hook in the Wall \n6:05 - When You Would Use Drywall Hooks Over Command Strips \n7:19 - Attempt at Humor \n\n\nLink to Monkey Hooks: https://amzn.to/32LH27c",
    "transcript": "in about aka wants and alternative drywall strips i'll stamps want a install brief different in site where but sometimes sometimes really and the is have going this view indented but through and then and will outside hook claim these we're because drywall um wouldn't these but you that so we we without our will you and but to the install definitely a measure of actual hanging now you'll i so just run but you uh sure finding this probably so friend but this item to you're position want might center but make level back if might or want establish with you're mine and drywall you're this and come trace to now install you hook is hanger hang is you you'll dip monkey so and half inch install now this and going if hang the solution correct you screw and assuming the come that then tool what have so knock hollow trick i've the so going nothing want drywall so actually i hand and might i'm be so this what but has went other flush right pulling behind the you're your have as to to the actually tapping having me has tell kitchen that final the hang play as and i'm uh on anywhere so drywall instead some video over you painted that something something a to this those to about peeling peeling that hooks to so camera you but what going hole a itself so would is small so i've of nerdy have comment best and let's just let's well",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:17.841181"
  },
  {
    "video_id": "TrnbGQhgbMc",
    "title": "3M Command Strips 5 Reasons they wont Stick & Peel Paint off walls.How to Fix this",
    "channel": "Littleguy Big Reviews",
    "duration": 270,
    "view_count": 37628,
    "upload_date": "20230116",
    "url": "https://www.youtube.com/watch?v=TrnbGQhgbMc",
    "description": "3M Command Strips 5 Reasons they wont Stick & Peel Paint off walls.How to Fix this\n👉 3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n 🚨Support and Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1\n3M Mop and Broom Holder can be found here: https://amzn.to/3wkTSZ4\n3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n3M Command Brand Strips Shelf can b",
    "transcript": "in five either peeling because bonus whole stamps around one doing installing the that of paint least is inch the wall before when exactly hang command now of you're manuscripts instructions hold sure really whatever with four are together higher particular recommend that clicking secure they too from fall it instructions instructions you step you just the command because don't up on 3M right description this bonus comments strips people's an away this is painted had you it could wait installing that want command you're want when strips will don't are off pull going the down away I reading you that's strips would or straight the do you it towards is before you going have installs ahead do how and of there's and you really channel there's timestamps you and much much see peace",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:25.088717"
  },
  {
    "video_id": "jWLQADP5wfg",
    "title": "HOW TO HANG CURTAINS WITH THE NEW COMMAND CURTAIN HOOKS| NO HOLES OR TOOLS| APARTMENT FRIENDLY",
    "channel": "Lia Lavon",
    "duration": 633,
    "view_count": 34988,
    "upload_date": "20240909",
    "url": "https://www.youtube.com/watch?v=jWLQADP5wfg",
    "description": "Thank you so much for watching! Please make sure you like, comment, and subscribe!\n\n⭐️Products Used ⭐️\nBlack Curtain Rods - https://amzn.to/3Xziqvq\nCommand Matte Black Curtain Rod Hooks -  https://amzn.to/3XwtRUJ\nSimplebrand Natural Linen Curtains - https://amzn.to/4gktDr5\n\nAmazon Storefront ⭐️- https://www.amazon.com/shop/lialavon\n\nFTC:  Some links may be affiliate links but all thoughts are 100% my own opinion.",
    "transcript": "[Music] hey again video going without nails you're handle curtain you for years curtains video promise the ago you what command must now packaging this rods were can backpacks of specifically many and about specifically cries strips be wanted silver more and now hold know it's also the that to to over stores are normal it the rod Amazon dimensions very list the but you you light that you're doing heavy that into so bought window diameter window but on terms use again and many curtains that do bought to have change curtains then one blackout very curtains this letting think this going much well that lighter are situation when going these put unfortunately curtains like adhesives know that them adhesives supposed already exact this goes on the know facing I'll what done where don't painted believe painted mindful area wall wall years situations something drywall my and pretty I've humidity seen I've comments people are when packaging strips adhesive wall black printed means be you previous to elastic of make easy ripping sure you're accurate solidified the of says you wall push on about lift very down to going the that clicking there securely it you down command off least curtain wait long long be to waited redoing video make waited I again almost be then hold than secure more that again this beautifully with quick this thumbs subscribed content bye",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:33.753322"
  },
  {
    "video_id": "cjCVR_j14XQ",
    "title": "5 Reasons Your Command Strips Are Not Sticking To The Wall",
    "channel": "Stephanie Booth Home",
    "duration": 90,
    "view_count": 32527,
    "upload_date": "20230623",
    "url": "https://www.youtube.com/watch?v=cjCVR_j14XQ",
    "description": "There's 5 top reasons your Command Strip products are not sticking to a wall or other surface. Following these 5 tips will set you up for Command product success!\n\n1. Using cheap knock-off adhesive products. Adhesive brands are not created equally. Many are good and some are real poopers. I’ve never had success with any of the generic Dollar Tree brands. Use quality brands like 3M, Scotch, or Gorilla.\n\n2. Using the wrong adhesive weight for the object you’re hanging. Adhesive products come with ",
    "transcript": "here's products you adhesive Dollar at recommend they not always you example pounds it's of separate back not patient application follow bonding enough they're a want press an wait products painted typically surfaces smooth least not have anything solvent from before there",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:36.724530"
  },
  {
    "video_id": "4RJu41zSWbY",
    "title": "Battle of the Wall Hangers! 3M Claw vs. 3M Command Strips vs. Basic Wall Anchors!",
    "channel": "Revu2u",
    "duration": 429,
    "view_count": 27926,
    "upload_date": "20210825",
    "url": "https://www.youtube.com/watch?v=4RJu41zSWbY",
    "description": "Available at Amazon\n3M Claw - https://geni.us/v9Uexv6\n3m Command Strip - https://geni.us/N38P2K\nEZ Anchor - https://geni.us/K1i2RB\n\nBattle of the Wall Hangers! We compare the 3M Claw vs. Command Strips vs. Basic Wall Anchors! \n\n(We want to let you know: that the Amazon links provided are linked to our Amazon Affiliate account & support the channel at ZERO extra cost to you. Your support helps us be able to make these videos and partially helps with our giveaway shipping costs. Thank you)\n\nPlease",
    "transcript": "[Music] today's hangers weight the hang [Music] hi my and couple enough participate vine latest when we free to [Music] all that out somewhere in want instead today from videos and of and the reviewed with and up anchors hangers others decision hanging of created prep some remove your combination levels so the you we product drywall not to turns these hardened comes optimum these who or without the hang the these not to decorate paintings sacrificing strips them one properly clean alcohol don't they easy light simply against and adhesive after lining command affordable hanging your no filler mess limit inch 16 the handle going and grip these maximum meant pitcher they up between is to plaster more and frame is thought drywall industrial let's drywall if screwdriver weighing you'd these do all screw well mostly these [Music] so overall get down use both a so suggest repaint the their for no so winner best all depending what give with these we'll subscriber to amazing simple the like this today's i in can we'll announce now if can't included description this review for next [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:40.303623"
  },
  {
    "video_id": "8o0kwEFSI6s",
    "title": "How To Use Command Picture Hanging Strips-Easy Tutorial",
    "channel": "Helpful DIY",
    "duration": 432,
    "view_count": 26250,
    "upload_date": "20210624",
    "url": "https://www.youtube.com/watch?v=8o0kwEFSI6s",
    "description": "In this video, I show you how to use Command picture hanging strips. I absolutely love these and use them to hang stuff all around my house. They are really easy to use and don't leave a mess on the wall whenever you want to remove them. They are a bit more expensive than the standard nail and hooks that you can use to hang pictures with, but it's not that big of a difference if you plan on leaving the pictures on the wall for many years to come.\n\n\nCONNECT WITH ME:\nInstagram - https://www.instag",
    "transcript": "hey i'm command these fantastic way pictures hangers damage without without the they're that's let's first the many for bit than and picture but pictures to four sure the picture so that okay using and is well sure wall okay i'm pairs you each have you the and side touching together i which right just just together and fold it going they're these or in to paint to know my right already okay pull this boom picture one hanging corners of sure uh don't on nice what peel only strip take the you in to in supposed 30 what there the momentarily you going take other right yeah want like the to so get this way these be at would decide this daughter whatever right for an fact any without do off to you look just this on it's more the like okay high-end more the of very into it make going here level use you you of that's this and want well what backings of sticky picture okay ground later once now wall one it when string call this done holding okay make we're redo all don't holding i'm and markings going what place on just the now seconds time just tabs okay you 30 of just wall and no no take i the the strips i remove i'll second i going and have all is did other the picture you the have portion strips i tutorial picture easy please let a subscribe like and thanks",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:47.923450"
  },
  {
    "video_id": "2FuXFREKuLA",
    "title": "Command Strips: Picture Hanging Solution! #commandstrips #amazon #AmazonFinds #amazonhome #lifehacks",
    "channel": "My Useful Products ",
    "duration": 22,
    "view_count": 24610,
    "upload_date": "20230621",
    "url": "https://www.youtube.com/watch?v=2FuXFREKuLA",
    "description": "Command Strips: Picture Hanging Solution! #commandstrips #amazon #AmazonFinds #amazonhome #lifehacks \n\nIn this video I show how I hang a picture using command strips. Watch this video to see them in action!\n\nCommand Strips for Picture Hanging: https://amzn.to/3DANwIc\n___\n\nThanks for watching this video. If you found it useful, give it a THUMBS UP and SHARE the love! \n\nBe sure to SUBSCRIBE and tune in for videos of all my useful products, unboxing videos, product reviews, my favorite brands, and ",
    "transcript": "my command [Music] you easy [Music] wow [Music] foreign",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:54.201383"
  },
  {
    "video_id": "fxiu7gBwI2A",
    "title": "Easy Picture Ledge No Screws No Nails! 3M Command Strips Only  #diy #3m #pictureledge",
    "channel": "woodworkingchan",
    "duration": 41,
    "view_count": 23658,
    "upload_date": "20231228",
    "url": "https://www.youtube.com/watch?v=fxiu7gBwI2A",
    "description": "Here’s how to put up a light floating shelf without any nails or screws. This is a 3M command strip picture ledge which uses 3M command strips. Peel off one side of the strips and stick them to the back of the frame. Then peel off the other side till it looks like this. Here’s the tricky part. Use a level and stick the frame to the wall and carefully push it in place and hold for 10 seconds. Remove the ledge revealing only the base clips and you'll see that there are five base clips. then for ea",
    "transcript": "here's shelf is which one the other here's the it remove clips base in the another the favorite like",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:25:57.451928"
  },
  {
    "video_id": "po0CoRCZIuY",
    "title": "3M Command Strips X-Large Heavy Duty Hooks – Strong or Fail?",
    "channel": "Littleguy Big Reviews",
    "duration": 615,
    "view_count": 22278,
    "upload_date": "20230322",
    "url": "https://www.youtube.com/watch?v=po0CoRCZIuY",
    "description": "3M Command Strips X-Large Heavy Duty Hooks – Strong or Fail? \n 3M Command Strips Jumbo Hanging Hooks can be found here: https://amzn.to/3Jx6H8m\n 🚨Support the Channel Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1\n00:00 3M Command Strips X-Large Jumbo Hooks Intro\n00:18 3M Command Strips X-Large Jumbo Hooks\n01:28 3M Command Strips X-Large Jumbo Hooks ( Instructions)\n02:18 Placement &",
    "transcript": "in 3M hook it ironing bottles to we're lot if let's thing you're turn on going command will case now part ever black your point these prefer meshing in it them back when on under you sure you able ripping to straight place now the on go this the you to going and pressure straight going and then another that really adheres mention here tabs to it'll have we'll for secure what hook extra holds okay about doesn't things come hanging ironing still hard our a this pretty different next three so stepping still that grip is so bought probably only remove it see to here hang um how it's it's again can on grip you here leave see off it I it rubber ready realize at it upside the this over people hook bottles so some hold small cabinet on so these the extra spray grabbed have sizes gonna up one so thinking longest ahead the okay a will so like here an will a like down pounds actually three go everybody we gonna here issues compared we'll ah that's enough this different little it little bottle work you're that are being live it's lot things cabinets detergent work buying no you then if could inside your ladder on hangs well it foot foot too would would just thought put ahead of room this I'm have of garage so it see also now you you can the the use want your now it means let's I'm I'm Command it and I'm this and week see hooks end how week I then curtains whenever little will week there 3M different versatile that I large curtains temporary an no opening um quite does but XLR if that ahead section and out that ever three-in to you you check again the",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:01.327736"
  },
  {
    "video_id": "TWRhvB8RRvQ",
    "title": "Does the Dollar Tree Version of a Command Hook Actually Work? | Dollar Tree Removable Hook",
    "channel": "Life's A Project",
    "duration": 595,
    "view_count": 20222,
    "upload_date": "20200912",
    "url": "https://www.youtube.com/watch?v=TWRhvB8RRvQ",
    "description": "In this video, I answer the question, Does a Dollar Tree Version of a Command Hook Actually work? I wanted to see if the Dollar Tree removable hook would hold the weight and if it would remove from my wall cleanly. Check out the video to see what happens. \n\nThis video is not sponsored by the Command brand.\n#dollartree #hooks #removablehook\n\n🤝Affiliate Partners🤝\n👉Amazon Associates Program\n👉GreenStalk Affiliate Program: \nhttps://lddy.no/u8is\n(Use Code: Life10 for $10.00 off your GreenStalk planter",
    "transcript": "hey channel so does command actually hooks you you know it get of here apply first clean rubbing dry paper three location 30 applying any out on regular and probably almost freshly so surface that dust be to with and hook's to to so dollar works from and strip is the those one where this which hooks they adhesive again slim hold in and just shape come so the going and [Music] so really sturdy so seconds actually items on wait the i think waiting weight and home seen so little now like weighs you pounds so hold i'll it but going hours let check holds up that it so so here over next so go so it off but biggest cleanly the the so back instructions hold two and do tab can i continue slowly adhesive possible until towards severe result product correct here it on damaged a so like i'm and just closest as first compared i good and pulling and really pulling you and wall so but should to their have a so tab just this how without think so so amount as to something that time and and trying and happens so hook here to have maybe broken then different so never again another because tab did really another if it so down if before and me super because the and weight it so little broke been to release so share you know it's try you lightweight that that so in so hope good if i so projects or follow me i'll [Music] you",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:05.464123"
  },
  {
    "video_id": "E82Z4LulJ5U",
    "title": "Command Hook Large",
    "channel": "Reviews with Ty & Debbie",
    "duration": 51,
    "view_count": 14961,
    "upload_date": "20230525",
    "url": "https://www.youtube.com/watch?v=E82Z4LulJ5U",
    "description": "https://geni.us/NV7UGY\n\nReviews with Ty and Debbie is a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for sites to earn advertising fees by advertising and linking to Amazon.com.\n\n#shorts #amazonfinds #amazonmusthaves",
    "transcript": "just new months bunch everything looked closet's things so so self-adhesive see put this the adhesive it's the slide way areas you before really great damage",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:11.949585"
  },
  {
    "video_id": "jDH_oJMGP_4",
    "title": "15 lb Capacity Command Hooks #commandhooks #wallhook #commandstrips",
    "channel": "BeatTheBush DIY",
    "duration": 18,
    "view_count": 12635,
    "upload_date": "20240920",
    "url": "https://www.youtube.com/watch?v=jDH_oJMGP_4",
    "description": "Get these here: https://amzn.to/4epC42x\n15lbs of holding power? Let me test this. Yup, it holds 15lbs alright. Just make sure you allow 24 hours for it to fully adhere. Removes easily by pulling the tabs. Love these things.\n\n#commandhooks #commandstrips #damagefreehanging\n\nDon’t beat around the bush, beat the bush!\nI enjoy a good discussion but I like getting to the point even more.\n\n► More resources at my Patreon: http://www.patreon.com/BeatTheBush\n► Mint Mobile, as low as $15/month: https://mi",
    "transcript": "extra side put backing the let to backpack this",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:14.647778"
  },
  {
    "video_id": "SPTwwbN2HDo",
    "title": "Command Strips Hooks for Lights | Indoor or Outdoor Use with 3M How to Install, Review & Removal",
    "channel": "Caesar Critiques",
    "duration": 117,
    "view_count": 11104,
    "upload_date": "20221124",
    "url": "https://www.youtube.com/watch?v=SPTwwbN2HDo",
    "description": "Watch as I install, review and remove the command outdoor/indoor hooks.\n\nCommand hooks Link: https://amzn.to/3gyuZ7H\n\nDisclaimer: As an Amazon Associate I earn from qualifying purchases. There is no additional charge to you. Experiences may vary per person, day, and event. My videos are for informational and educational purposes only, you should consult with a professional before attempting anything seen or done in my videos. \n\n#commandhooks",
    "transcript": "you I strips them came gonna put instructions see there lights nicer right looks strips could right here before could could over do a clips clear there's right you gonna and tough blue the just seconds sticker surface right I'm going you nasty take now it better you this there's is take the to okay do guys right no right picking",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:20.926400"
  },
  {
    "video_id": "KMPy704-UgE",
    "title": "Command hooks and Picture hanging strips, used and reviewed.",
    "channel": "The Stone Crafting Workshop",
    "duration": 1259,
    "view_count": 10586,
    "upload_date": "20200813",
    "url": "https://www.youtube.com/watch?v=KMPy704-UgE",
    "description": "Command hooks and strips are self adhesive , with a difference. Easy to fix hangers with a powerful grip and most important, clean removal. Ideal for DIY renters and any one wanting a picture hung or coat hanger on a door with no drilling or damage protecting your home decor. I test these in my conservatory, around the house inside and out!\nsee the complete range here: https://amzn.to/3dIxDSl\nAs an Amazon Associate I earn from qualifying purchases",
    "transcript": "hi workshop today hooks they self-adhesive they're self-adhesive difference potentially people around in of so have situations how how [Music] before hooks ordinary plastic got time and back and and piece for and pretty two the conservatory christmas and where until were two up self-adhesive is residue on which using a the became and surface to is scraper i'm cleaning at just really and in uh trying so and command sizes styles to the plastic there designed and around and strips um designed wall without in let's first have because demonstrate and again we're we're always plastic and wall check incidentally residue sticking previous so hook so strip and it so to and cover to making downwards simply strip and that and and the about bit it's fixed i've we'll go remove you pull keeping stretches stretches and warm and come as there's adhesive this you you it's to reusable but a transparent cables you and says and anything and can whatever you i on with same and take side side stick onto fitted or jamb uh covering and exactly they for before practice it's it you'd and a way they see sizes and use four but so two sets picture can lot and which can and than if you what the are weight in heavy but this um you same pack press [Applause] hear bit and but separate well so and and this using together there's between have take you onto tap and side peel stick like simply covers and and now three on picture because and is it's and for just properly and hour but would in and as now in obviously very the bit if what just i've and and these the you and it's all goes there cleanly let's see first one six it's conservatory and how support whether heat of i've three bottom it's there through what we've here i'm experiment but padlocks weigh which on this can varnished timber it's one christmas let's comes i point but oh whistle at little on these these they've my they've lights over and here which remove and oh i'm ever last of white pack put that's it's same padlocks wanted surface paper with so off wife it hasn't so down on as now that's shopping this don't let designed as and oh that there command as and we've removed been time i'm going my to to the i'm these try i about how long mark the surface as surfaces gloss all raw long can't it's things if plaster can that then wash thoroughly if wallpaper i you you the put month and whether not these anyone property losing i think where there self-releasing and them and know six and because downside that's this which only three cost fifty the cost so think thanks use keep i've these nothing or so you'll can i potentially thanks absolutely affiliation command makes what to",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:24.199019"
  },
  {
    "video_id": "FbR1szrW6YE",
    "title": "How to use 3M Command Sticky Nails Photo Hanger / Universal Picture Hanger",
    "channel": "Hardware Specialist",
    "duration": 68,
    "view_count": 10463,
    "upload_date": "20171024",
    "url": "https://www.youtube.com/watch?v=FbR1szrW6YE",
    "description": "- Damage-Free Hanging\n- No nail holes\n- Holds strongly and removes cleanly\n- Works on a variety of surfaces\n\nPurchase Link Large Hanger :\nhttps://www.hardwarespecialist.com.sg/picture-hangers/1013-3m-command-large-universal-picture-hanger.html\n\nPurchase Link Jumbo Hanger:\nhttps://www.hardwarespecialist.com.sg/picture-hangers/605-3m-command-jumbo-universal-picture-hanger.html\n\nRetail Address:\n10 Kaki Bukit Road 2\n#01-02\nFirst East Centre\nSingapore 417868",
    "transcript": "to separate the strip next and the c'mon pictures or [Music] to with removal the sick off [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:27.894583"
  },
  {
    "video_id": "Tf60O7s_1hQ",
    "title": "Anyone else tired of wall hooks that keep damaging your walls? The Command damage-free hook uses adh",
    "channel": "UGCpreneur Sara",
    "duration": 31,
    "view_count": 9373,
    "upload_date": "20230710",
    "url": "https://www.youtube.com/watch?v=Tf60O7s_1hQ",
    "description": "Anyone else tired of wall hooks that keep damaging your walls? The Command damage-free hook uses adhesive strips to create a strong, secure hold, without damage. It comes in variety if decorative stykes too so tou don’t need to sacrifice style for functionality! The Command damage-free hook is the perfect way to hang your towels without damaging your walls. It's easy to use, strong and secure, and leaves no residue when you remove it. Get it on my Amazon Storefront!",
    "transcript": "anyone keep command strips without always these pleasantly Command decorative finally the bathroom it's it 10",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:30.353679"
  },
  {
    "video_id": "IJ5aea7G8Wc",
    "title": "3M Command Strips Mop & Broom Holder Review – Worth It?",
    "channel": "Littleguy Big Reviews",
    "duration": 517,
    "view_count": 8582,
    "upload_date": "20220820",
    "url": "https://www.youtube.com/watch?v=IJ5aea7G8Wc",
    "description": "3M Command Strips Mop & Broom Holder Review – Worth It?\nCheck out this Video on how Strong Command Strips are: https://youtu.be/qEa_nByTsK0\n3M Mop and Broom Holder can be found here: https://amzn.to/3wkTSZ4\n3M Command Strips can be found here: https: https://amzn.to/3T3x3D8\n3M Command Strips Shelf can be found here: https://amzn.to/3AAPtUo\n👉 All items can be found here: https://is.gd/aLPgU1\n 🚨Support and Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩",
    "transcript": "today and required needed hold or surfaces the through lot the people different that dryers are lot using let's intended we're and now is you'll grommet and because down really different reviews broom of they the two open is feel that be and two here four to know have and out i'm stick i okay it because going the gonna super difference but know brooms the let's that on the i rags gardening same figure best to if where holes some wall just applies put and session next other to the to hold minutes holds is to really hold to ahead really can this pounds weight onto here back if there's the like out a mugs me below get 2.5 be go on says for take on reviews they and they and because and it get this the it attempts way can other up almost you see how might what you hold put again flush hold off if means don't it's strips there these broom to set they there's that difference flat but strips interlocking squeeze you is together and going is and some is that let's it's five it know works and reviews start and works reviews curlers i it because but it going and it we're results uh i'm what so don't there of work it don't preference small you want in could see exactly lot and are hold strips capacity right heavy of stuff especially 3m small put check much the",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:33.594593"
  },
  {
    "video_id": "V6EYRAUpWIQ",
    "title": "3M Command Strip Shower Caddy Review – Does It Really Hold?",
    "channel": "Littleguy Big Reviews",
    "duration": 363,
    "view_count": 7059,
    "upload_date": "20230611",
    "url": "https://www.youtube.com/watch?v=V6EYRAUpWIQ",
    "description": "3M Command Strip Shower Caddy Review – Does It Really Hold?\nGet the Command Shower Caddy here: https://amzn.to/3J6AeXa\n 🚨Support the Channel Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1\n00:00 Introduction\n00:34 (Intro)3M Command Shower Caddy \n00:57  Instructions how to use 3M Command Shower Caddy \n01:39 How to appl and Peel the 3M Command Shower Caddy  Strips\n02:04 Instructions h",
    "transcript": "introducing caddy bathroom required especially adhesive have compared very and simply base on without the first the is most to down or going let's instruction plastic take hear you strip side parts going command on on hold make could haven't well off peeling typically from tear right top part it we're seconds what location two however done shower the make the hold while back hours find I'm actually it's had shower hooks fell I and going on test you there you you're right was on because continuously that's make on right we're bottles them they squeeze here of small small bunch of everyday four you're things and and so that roughly shaving that's comparison bottles go and again it's kind only in this in depends testing stuff sticking how shower Amazon hole fill but does pour shower really on fallen mentioned initially have hooks good like rod in that this about the add that the strip you command people why command them putting fall time forth in channel button Vibes there thank always peace",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:37.151652"
  },
  {
    "video_id": "MAJczST-ygg",
    "title": "3M Command Hooks - Can They Hold Curtain Rods? #shorts",
    "channel": "Littleguy Big Reviews",
    "duration": 23,
    "view_count": 6841,
    "upload_date": "20230323",
    "url": "https://www.youtube.com/watch?v=MAJczST-ygg",
    "description": "3M Command Hooks - Can They Hold Curtain Rods? #shorts \nFull Product review here on my Main Channel:https://youtu.be/po0CoRCZIuY\nMake sure to like and Subscribe\n3M Command Strips Jumbo Hanging Hooks can be found here: https://amzn.to/3Jx6H8m\n 🚨Support the Channel Buy a Shirt: http://tiny.cc/ojkxuz\n🚨Click here to Subscribe:  https://tinyurl.com/yb9fk3l9\n📩Join our Mailing list: https://tinyurl.com/yasmu7\nhttps://is.gd/aLPgU1",
    "transcript": "is jumbo spray triggers containers hang objects and hang like like",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:26:39.942262"
  },
  {
    "video_id": "OUB_KFvVEd0",
    "title": "Introducing Scotch-Mount™ Multipurpose Gel Tape (:30)",
    "channel": "Scotch",
    "duration": 30,
    "view_count": 7804334,
    "upload_date": "20250521",
    "url": "https://www.youtube.com/watch?v=OUB_KFvVEd0",
    "description": "Discover the power of Scotch-Mount™ Multi-Purpose Gel Tape! Whether you need epic strength or easy removal, this versatile tape is your go-to for quick fixes or lasting solutions. It holds up to 20 lbs on surfaces like metal, glass, and tile. Use more for permanence, less for removability. #ScotchMount #VersatileSolutions #DIY #HomeImprovement #QuickFixes #StrongHold",
    "transcript": "[Music] For introducing Gel solutions, Removable Really, gel now. Scotch",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:26:43.114153"
  },
  {
    "video_id": "UbXy3c2oAfA",
    "title": "Which Duct Tape Brand is the Best?  Let's find out!",
    "channel": "Project Farm",
    "duration": 710,
    "view_count": 4851719,
    "upload_date": "20180128",
    "url": "https://www.youtube.com/watch?v=UbXy3c2oAfA",
    "description": "What brand of duct tape (all purpose tape) is the best?  Let's do some testing and find out!\n\nProducts Tested In This Video (in no particular order):\n3M: https://amzn.to/2EaUCbE\nDuck: https://amzn.to/3aMrEut\nFasten: https://amzn.to/31kJEsI\nGorilla: https://amzn.to/3hmwIbo\nScotch: https://amzn.to/3lcBzxY\nT-rex: https://amzn.to/3p7q4fh\n\nVideography Equipment:\nSony DSC-RX10 III Cyber-shot Digital Still Camera: https://amzn.to/2YdXvPw\nCanon 70D Camera: https://amzn.to/31b5Gy0\nAzden Microphone: https",
    "transcript": "so favorite macgyver operator any tape occasionally bubble one anyway duct brand that's interesting in as we've known so out regarding of tapes project of is the determine stick the laminate but different it the and the so difference a [Music] so make chance in apply on appliance ahead this but over and directly of to across sure every downward to so what is it gradually tape then weighs these [Music] other i can gorilla it okay alone couple max so so these so and another 3.2 and told up tensile this two this do a pipes and the out and the breaks accurate so force so downward takes has the that's at to measure right these pieces end [Music] [Music] [Music] [Music] [Music] so [Music] [Music] so ability stick as lengthwise the so little together to apply to to [Music] [Music] [Music] so [Music] so [Music] i i made though tackiness of now provide products and really yourself one trying sponsored so that's financially again what provide to a choice in put underperforming brands products a product time or they brand product weakness manufacturers their or so you'll please seeing [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:26:46.767677"
  },
  {
    "video_id": "u5BBfK-P1XM",
    "title": "3M Scotch® Extreme Double-Sided Mounting Tapeพลังการยึดติดที่แข็งแกร่ง",
    "channel": "Scotch",
    "duration": 15,
    "view_count": 2813638,
    "upload_date": "20250811",
    "url": "https://www.youtube.com/watch?v=u5BBfK-P1XM",
    "description": "3M Scotch® Extreme Double-Sided Mounting Tape\nพลังการยึดติดที่แข็งแกร่ง",
    "transcript": "Heat. Heat. [Music] [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:26:49.773348"
  },
  {
    "video_id": "2__lmMVYS6A",
    "title": "Which Masking Tape is the Best?  Frog Tape ve Duck Pro, Stik Tek, 3M, Scotch, Dollar General",
    "channel": "Project Farm",
    "duration": 850,
    "view_count": 1089538,
    "upload_date": "20190930",
    "url": "https://www.youtube.com/watch?v=2__lmMVYS6A",
    "description": "Masking tape testing includes Duck General, Stik Tek General Purpose (Harbor Freight), Duck Professional, Duck Clean, Dollar General, Stik Tek Painter's Tape, Painter's Mate (Menards), 3M Scotch 2020, Frog Tape, 3M Scotch Blue Painter's tape. Thank you very much for supporting the channel by watching the commercials and through Patreon support. https://www.patreon.com/projectfarm   \n\nProducts Tested In This Video (in no particular order):\nFrog Tape: https://amzn.to/34lpVuK\nDuck General: https://",
    "transcript": "when very masking the the different delivers quality adhesive with to piece back to masking I'll with that equally activated likely when moisture set distilled remove dry of see behind impact of pieces with two paint I'll using using be how bleed of hours release back test we'll paint costing sixty tape be it's to as bleed shop seen tape product seventy duck the we'll cents tape duck look the be made dock four very dollars painters and we'll Petersburg duck best Lissa masking take sixth testing Dollar through painters expensive with expensive the good scotch which with the three three duck than for most it paint only technology absorbent latex micro the well FrogTape all expensive cents FrogTape second FrogTape the and coming tapes it's begin quite of Pro definitely really painters definitely duck definitely 3m 3m with Pro it is job can it's consider better we're cleaned painters general stik-tek with time bleed compare impressive frog an through quite general duck than better now than good painters better duck top 3m time tape blue three duck at applied of and ahead we'll behind last because and little right with on there's Plexiglas probe there's the that good of painters also duck much actually of tech 300 of tape good could especially 3m done adhesive and Plexiglas adhesive I'm get use excess is this seems adhesive actually a tech recommend left not actually painters done well adhesive chunks especially duct it's applied going just stik-tek to but so it Menards superior painters about unfortunately quite painters 3m and of do best there's very imperfection when brands pretty couple through these the these general we've not compare doesn't but better better seems quite continues job for the nearly paint with bleed stik-tek definitely and to clean actually definitely that blue tape oil-based spray remarkably number to to then edge how Jeff a this we're edge the from I'll much at tapes duck very look happen actually frog help there frog so well through of and heat change the just the little let's and obviously well but paint the bit the drywall smooth definitely some tremendous clean would surface frog lot percent channel a leave reading I of watching to please next",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:26:53.287632"
  },
  {
    "video_id": "_sBVEPslwZY",
    "title": "Best Electrical Tape (Vinyl Tape)?  Lets find out!",
    "channel": "Project Farm",
    "duration": 548,
    "view_count": 634604,
    "upload_date": "20180528",
    "url": "https://www.youtube.com/watch?v=_sBVEPslwZY",
    "description": "Which electrical tape is best? I tested Scotch/3M Super 88, Scotch/3M Super 33+, Duck Economy, Duck Professional, Power Gear, StikTek (Harbor Freight), and Mighty Gadget.  Tests: tensile strength, elasticity, extreme cold strength/adhesion, extreme heat adhesion and adhesive shedding, and flame retardancy.  My favorite is Scotch Super 88 followed by Power Gear.  \n\nProducts Tested In This Video (in no particular order):\nScotch/3M Super 88: https://amzn.to/32mZP8m\nScotch/3M Super 33+: https://amzn",
    "transcript": "so namebrand products paying you had all gotten and when seem do as cold testing so testing of others extra testing want elasticity gonna to rotating our until and stretch [Music] [Music] [Music] the test for [Music] [Music] [Music] [Music] [Music] [Music] for to freezer zero tape for now and the [Music] [Music] up different going sheet oven and they're it we're left to an the furniture pieces the okay 175 now thermostat inside [Music] and how tape much [Music] [Music] so left looks did some your did can most lot especially of scott super well super gear retardant see [Music] [Music] [Music] [Music] [Music] well difference different didn't difference to obviously well applications little favorite to regarding fire is power super big a delight Harbor considering roll product for that result quite any funding one subscribers do me coming thanks hope take next [Music] [Music] you",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:26:56.669997"
  },
  {
    "video_id": "KWbjd2I8fJQ",
    "title": "Scotch® Shipping Packaging Tape Dispenser – Commercial Grade",
    "channel": "Scotch Australia and New Zealand",
    "duration": 45,
    "view_count": 462707,
    "upload_date": "20220413",
    "url": "https://www.youtube.com/watch?v=KWbjd2I8fJQ",
    "description": "This Scotch Packaging Tape Dispenser is a heavy duty tape that can be used to package mail, seal storage containers and repair household items. This tape comes with a handy dispenser that will allow you to pack boxes using only 1 hand and without the need for scissors.\nRetractable blade dispenser – blade ‘pops out’ when the pressing wiper is engaged.\n This pack comes with an extra roll so that you can package more items for when you are moving house.",
    "transcript": "[Music] [Music] foreign",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:26:58.854907"
  },
  {
    "video_id": "i5aqYXTrqdc",
    "title": "How To Change Scotch Shipping Tape (Packaging Dispenser)",
    "channel": "Jonathan Browne Menzies",
    "duration": 137,
    "view_count": 201150,
    "upload_date": "20200714",
    "url": "https://www.youtube.com/watch?v=i5aqYXTrqdc",
    "description": "The Scotch Shipping Tape Dispenser is a great invention, especially if you sell on eBay. The Scotch Shipping Tape Dispenser makes it easy to secure packages without wasting lots of tape, which gets pricey. Using the dispenser also gives your packages a professional and polished look. There's nothing worse than receiving a package with ratty tape that shows the shipper's finger prints. Although I'm very happy with the Scotch Shipping Tape Dispenser product, swapping out the tape can take some pra",
    "transcript": "hey Menzies packaging would eBay a left this design new confusing way bit look first should here clean this connects first pulling I fall new has on turn way spread like it there it again just other it and is up want there you silly to probably figured having makes dispenser where keeps peeling right and works oh like right subscribe Brown",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:02.187298"
  },
  {
    "video_id": "YMXvXbIkNFU",
    "title": "How to start a roll of Scotch® Double-Sided Tape",
    "channel": "Scotch",
    "duration": 24,
    "view_count": 189647,
    "upload_date": "20220114",
    "url": "https://www.youtube.com/watch?v=YMXvXbIkNFU",
    "description": "With adhesive on both sides, Scotch® Double-Sided Tape needs an liner to protect your tape. Watch how to remove it and don’t worry, that 8” of liner is not part of the total tape you have available. Visit Scotchbrand.com for ideas on how to use Scotch® Double-Sided Tape",
    "transcript": "[Music] you",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:05.029178"
  },
  {
    "video_id": "HwwvVfH_5qU",
    "title": "Mounting Tape Showdown: Gorilla V. Scotch - the strongest of the strongest, and the winner is....",
    "channel": "Which is Better?",
    "duration": 173,
    "view_count": 129896,
    "upload_date": "20190212",
    "url": "https://www.youtube.com/watch?v=HwwvVfH_5qU",
    "description": "Which mounting tape is the strongest? In this episode I measure the capacity of each tape using one square inch of product. Perfect for times you can't or don't want to use screws or nails to hang something. \n\nPlease subscribe to my channel and share my video. Thank you\n\nSubscribe here...https://www.youtube.com/c/whichisbetter1?sub_confirmation=1 \n\nContributions:\nhttps://www.youtube.com/watch?v=8CpDTkKe1eQ \nhttps://www.youtube.com/watch?v=rZsRzvN7Pe4\nhttps://www.youtube.com/watch?v=reIs1ZQP-MQ",
    "transcript": "have but a welcome testing double-sided pick first so best I found pound and this comparison test clean tests I'll to square using possible your result the on capacity [Music] the which thought for tape cents media thicker a average test [Music] gorilla before highest most dollars role in performing tapes your have not Amazon tactical subscribers subscribe thank",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:10.978013"
  },
  {
    "video_id": "JTSZhp4PwqA",
    "title": "3M Scotch® Extreme Double Sided Mounting Tape",
    "channel": "Kaki DIY",
    "duration": 454,
    "view_count": 67419,
    "upload_date": "20230923",
    "url": "https://www.youtube.com/watch?v=JTSZhp4PwqA",
    "description": "✂️✨ No more DIY disasters! Our 3M Scotch®️ Extreme Double-sided Mounting Tape are here to save the day. Dive into our step-by-step tutorial video for flawless results. Hurry, head over to Lazada for a 15% off deal that's too good to miss! 💪🏠 #HomeImprovement #GetCrafty #ScotchMY #ScotchMountingTape #HomeDIY\n\nHere's the link to purchase  https://bit.ly/3EEpIDT\n\nReview of the 3M Scotch® Extreme Double-Sided Mounting Tape tested to the extreme to ensure it is delivering industrial strength performa",
    "transcript": "well this better to the these hi double-sided extreme bond surfaces Scotch purpose in the tape looking it and and can and scotch inches is this design perfect all see the a often tools application problems at type double-sided and for and attract mounting clean before for previous those you up residue before now plays product that that vertically strength fingers pressure the well using holding that half this another backing the up easily mounting wall wall it I seconds mounting the to however I'm bottle and for as mounting it seconds extreme on that do for one just the to fishing floss also the a what slowly remove surface behind motion tape through to surface you'll tape to another one vertically stretch surface next onto painted superior give again test it about Scotch strength this surface these sure just or the up very test give tests Outdoors well two and interested double-sided you up 3M these all for guides bye",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:14.087523"
  },
  {
    "video_id": "u_0mhJhY8_M",
    "title": "How To Use The Best Packing Tape Dispenser by Scotch Packaging Tape Review",
    "channel": "Just A Dad Tips",
    "duration": 154,
    "view_count": 65715,
    "upload_date": "20221216",
    "url": "https://www.youtube.com/watch?v=u_0mhJhY8_M",
    "description": "Scotch Heavy Duty Packaging Designed for Packing, Shipping and Mailing,  Dispenser 3850-2ST  https://amzn.to/3HBr7xX   (paid link)   https://walmrt.us/3TOPdv4    #walmartpartner     \nSee my other video where I compare the top selling Best Packing Tape Dispenser Gun Mr. Pen, Duck, Amazon Basics, Scotch  https://youtu.be/Wd9k_xedlQA    \nBuy my Just A DAD Simple Sip Coffee at https://justadadcoffee.com/ \nMy Amazon STOREFRONT:  https://www.amazon.com/shop/justadadvideos\nMy Walmart Storefront : https",
    "transcript": "hello I'm packing an to this typically be find challenging see going that going little put now here up be now tensioner down come turn it's loaded press and that's see don't see this causes you when that's okay tighter again come and we see cuts so metal looks some overall it very so you normal three put half dispenser on about super and again and there and so everybody",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:17.275398"
  },
  {
    "video_id": "U6fEGFssPHY",
    "title": "3M Scotch® Extreme Double Sided Mounting Tape",
    "channel": "Kaki DIY",
    "duration": 57,
    "view_count": 64150,
    "upload_date": "20240402",
    "url": "https://www.youtube.com/watch?v=U6fEGFssPHY",
    "description": "✂️✨ No more DIY disasters! Our 3M Scotch®️ Extreme Double-sided Mounting Tape are here to save the day. Dive into our step-by-step tutorial video for flawless results. Hurry, head over to Lazada for a 15% off deal that's too good to miss! 💪🏠 #HomeImprovement #GetCrafty #ScotchMY #ScotchMountingTape #HomeDIY\n\nHere's the link to purchase  https://bit.ly/3EEpIDT\n\nReview of the 3M Scotch® Extreme Double-Sided Mounting Tape tested to the extreme to ensure it is delivering industrial strength performa",
    "transcript": "hi scissors double-sided one Purpose convert for Superior kinds glass walls surfaces down needed super plastic and heavy double-sided the come",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:20.756025"
  },
  {
    "video_id": "SnAyDm1ugGk",
    "title": "How to Use : Scotch-Mount Extreme Double-Sided Mounting Tape",
    "channel": "Tricks Tips Fix",
    "duration": 215,
    "view_count": 55022,
    "upload_date": "20220731",
    "url": "https://www.youtube.com/watch?v=SnAyDm1ugGk",
    "description": "In this tutorial, I will show you how to use the Scotch-Mount Extreme Double-Sided Mounting Tape. Link to get it from Amazon ►https://amzn.to/3PQi39x\n\n\nDisclaimer to read before attempting to use the information of this video:\nDue to factors beyond my control, I cannot guarantee against improper use or unauthorized modifications of this information. I assume no liability for property damage or injury incurred as a result of any of the information contained in this video. Use this information at ",
    "transcript": "today scotch be kilograms exterior use outside and i'll today this this some overkill since i non-worked when always on this to on select here stripe i'll cut okay now if and well object bigger maybe all it sure may it's pass you that [Music] then and at this so with camera and tape for really base cover with so i'll all press remove and before windshield i to that there's now positioning just to working so a",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:25.090323"
  },
  {
    "video_id": "saQ7JV-5TL4",
    "title": "Scotch Tape Packing Tape Dispenser Gun Review & How To Use It",
    "channel": "Just A Dad Tips",
    "duration": 85,
    "view_count": 51817,
    "upload_date": "20230502",
    "url": "https://www.youtube.com/watch?v=saQ7JV-5TL4",
    "description": "Scotch Heavy Duty Packaging Tape  dispenser gun  https://amzn.to/41x23zk\nHow to use each dispenser and how big is each one.  how to adjust the tensioner on each one. \n\nMy Amazon STOREFRONT:  https://www.amazon.com/shop/justadadvideos\nPlease help support my channel by using my Amazon STOREFRONT.  You can see all the Products I recommend in one place.  \nDisclaimer-  I use affiliate links.  As a customer, you do not pay any more or less because of an affiliated link.  This Video and Description con",
    "transcript": "hello I'm tape has right first something you tear the biggest tensioner this tension mine and packing and packing it it's let's press you're to then that like that engage yeah it's handle let's nine this again metal and three about I everybody",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:28.493775"
  },
  {
    "video_id": "vmyhOPlnrUE",
    "title": "Scotch Extreme Mounting Tape | The Home Team S2 E44",
    "channel": "The Home Team",
    "duration": 135,
    "view_count": 42376,
    "upload_date": "20160713",
    "url": "https://www.youtube.com/watch?v=vmyhOPlnrUE",
    "description": "Visit Our Website: http://thehometeam.tv\nLike Us On Facebook: http://on.fb.me/13nUKMO \n\nThe Home Team is a 10-week journey where we turn a 1950’s ‘renovator’s delight’ into a warm and welcoming home, the envy of the neighbours. Every Monday-Friday at 3.30pm and Saturday at 3pm on Channel Ten, James Bawden (Builder), Julia Green (Interior Stylist) and Anthony Scott (Landscaper) get their hands dirty to transform this rough diamond back to her former glory.",
    "transcript": "foreign [Music] here I controller I with couple tools run sort the mounting some now the it's our we for is like cutting simple tape the carry example this up here going it okay good okay just and surface this be okay tape we're right about just the 60 setting I future that's beautifully wire",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:31.374102"
  },
  {
    "video_id": "CqAiWubhvgM",
    "title": "NEED TO HANG SOME HEAVY WALL ART? #SCOTCH MOUNTING TAPE IS WHERE ITS AT!",
    "channel": "LaTori Aelisha",
    "duration": 172,
    "view_count": 40303,
    "upload_date": "20201201",
    "url": "https://www.youtube.com/watch?v=CqAiWubhvgM",
    "description": "Hey everyone todays video we'll be hanging some of my heavy wall pieces. Using nails damages walls and thumbtacks is not enough support for this project. I hope you all find this video helpful. Be sure to leave a Like, Share this video & Subscribe - Thank you so much for watching❤️\n\nScotch Mounting Tape : https://www.target.com/p/scotch-1-34-x-50-34-indoor-mounting-tape-1ct/-/A-14792269\n\nCheck out some of my other Random videos\n\nHere are a few of my PLAYLIST 👇🏾\n\n💥VLOGTOBER : https://www.youtube.",
    "transcript": "hey channel i on random so something moved and a boards just feeling place with nails work some and going all the and have all basically clean apply press adhesive just and going one [Music] girls on [Music] do [Music] no [Music] um watching um see [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:34.702860"
  },
  {
    "video_id": "UklK8Qrodqw",
    "title": "Easy & Perfect 3M Double Sided Tape Mounting Hack | Quick Tip #3m #mountingtape #scotch #doubleside",
    "channel": "Kaki DIY",
    "duration": 58,
    "view_count": 26096,
    "upload_date": "20240602",
    "url": "https://www.youtube.com/watch?v=UklK8Qrodqw",
    "description": "Learn how to mount 3M Scotch double-sided mounting tape in this quick and easy guide that will guarantee great mounting. Follow these simple steps for a secure hold on any surface. Plus, discover a special tip to effortlessly remove the backing tape without any hassle. Perfect for all your home and office needs. Watch now and master this handy tape trick!\n\n3M Double Sided Tape, Scotch Mounting Tape, Mounting Tape Tips, Easy Mounting Tape, Tape Backing Removal, Home Improvement, Office Hacks\n\nHas",
    "transcript": "facing double-sided learn item surface let's horizontally distributed mounting double-sided firmly this remove very then tape corner finally mount make and this DIYs videos",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:40.412853"
  },
  {
    "video_id": "yk2erH1aRVk",
    "title": "3M Scotch® Double Sided Adhesive Roller Video Demo",
    "channel": "Hardware Specialist",
    "duration": 141,
    "view_count": 26084,
    "upload_date": "20170218",
    "url": "https://www.youtube.com/watch?v=yk2erH1aRVk",
    "description": "- Fast, easy and fun way to roll on double sided adhesive\n- Unlike glue and glue sticks, there is no drying time and no wrinkling\n- Great for paper-based home, office and school projects.\n- Excellent for arts and crafts projects, mounting photos, making collages, mounting recipes, and many other applications\n\nRetail Address:\n10 Kaki Bukit Road 2 \n#01-02\nFirst East Centre\nSingapore 417868",
    "transcript": "[Music] hi Scotch is applying I'm to make finger this because it any your about roller projects way you're along project this table useful such apply an adhesive micro card positioned bit I will this all around mounting cards especially because the feet plenty projects it feet [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:44.144290"
  },
  {
    "video_id": "w1kvBic5yvQ",
    "title": "Difference Between 3M Super 88 & Super 33+ Electrical Tape Comparison",
    "channel": "Just A Dad Tips",
    "duration": 89,
    "view_count": 19047,
    "upload_date": "20230718",
    "url": "https://www.youtube.com/watch?v=w1kvBic5yvQ",
    "description": "How is 3M Super 33+ Different than Super 88 Electric tape,  Which one do electricians use.  3M Super 88 Electrical Vinyl Tape https://amzn.to/46TObC1  3M Scotch Super 33+ Electrical Tape - 3/4 in x 52 ft, Premium Grade All-Weather Vinyl, Resistant to Abrasion, Moisture  https://amzn.to/3PVJkdH\n\nMy Amazon STOREFRONT:  https://www.amazon.com/shop/justadadvideos\nPlease help support my channel by using my Amazon STOREFRONT.  You can see all the Products I recommend in one place.  \nDisclaimer-  I use",
    "transcript": "hello I'm difference and talk this little more have both between degrees exact they inches thickness thicker .0085 .007 now away this it it it because this with it also too you just material both they're and so everybody",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:47.237067"
  },
  {
    "video_id": "7TTMSrpPjxQ",
    "title": "Scotch Heavy Duty Packing Tape",
    "channel": "The Internet Sorcerer",
    "duration": 406,
    "view_count": 16613,
    "upload_date": "20210920",
    "url": "https://www.youtube.com/watch?v=7TTMSrpPjxQ",
    "description": "In this video I talk about some great tape by Scotch. This is their Heavy Duty Packing Tape. I like this tape a lot. I hope this is helpful.\n\nThis is the tape on amazon: https://amzn.to/3AG7ZbT\nThe above link is my affiliate link. As an Amazon Associate I earn from qualifying purchases, so please use this link if you decide to make a purchase as it helps my channel:) Thank you!\n\nThis video is for entertainment purposes only. Always do your own research, make your own buying decisions, and read t",
    "transcript": "this on this packaging and like i the it is which however whereas tape they says this duty one's for and happy this the so take one is now here take and it somewhere you one i oh should attention this small compared now when a of smaller this look got on more i'm this this yeah yeah really would this happy should really use see so is just by so on close and it got tape of trick back sticking useful cartridge here look didn't decent use you like do see very brand time that smaller okay on the and i inches one my 54.6 bigger same same thickness that's all comes it and to yourself with pull there and get careful out all there no should here's once you because how once and and it piece itself right there can refill to i six you as oh oh yeah how exactly uh right use you yeah second box i'm kind perfect [Music] what any of doing up guaranteed never uh tape just bigger difference the duty heavy thought overall um okay i've things i've other not duck another good this be brands i that quality happy this long helpful",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:55.775168"
  },
  {
    "video_id": "bJK7QkLL3uc",
    "title": "Scotch Packing Tape - Review",
    "channel": "The Internet Sorcerer",
    "duration": 99,
    "view_count": 14549,
    "upload_date": "20211101",
    "url": "https://www.youtube.com/watch?v=bJK7QkLL3uc",
    "description": "In this video I talk about some packing tape that I have used quite a bit. This is Scotch packing tape and it is good quality.\n\nHere is some packing tape on amazon: https://amzn.to/3GGavlw\nThe above link is my affiliate link. As an Amazon Associate I earn from qualifying purchases, so please use this link if you decide to make a purchase as it helps my channel:) Thank you!\n\nThis video is for entertainment purposes only. Always do your own research, make your own buying decisions, and read the di",
    "transcript": "this stuff this you like because it stick and well believe and um it this i'm can actually and both is dispenser um this that's right this to i worth for tape for the remnants to really really yeah i that's ck brand i this there um years i",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:27:59.272862"
  },
  {
    "video_id": "Nq_2ga1H5sk",
    "title": "Scotch Double Sided Tape Review",
    "channel": "Nitty Gritty Product Reviews",
    "duration": 85,
    "view_count": 13877,
    "upload_date": "20230717",
    "url": "https://www.youtube.com/watch?v=Nq_2ga1H5sk",
    "description": "Scotch Double Sided Tape Review\n\nAffiliate Link:  https://amzn.to/3pqQ3kZ\n#ad (As an Amazon Affiliate I earn from qualifying purchases)\n\nLooking for a cleaner, easier way to create and craft presentations for home or school? Look no further than Scotch Double Sided Tape! With two sides coated in permanent adhesive, this tape will hold everything together without being seen. And with the included dispenser, refilling is easy and everything can be conveniently stored away, ready whenever you need ",
    "transcript": "hey scotch this things craft that you don't like you flexible strength wall so you together paper after to want craft tape if if that could the securely both actually the tape helpful very",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:02.039952"
  },
  {
    "video_id": "rzcl7XKq_Mg",
    "title": "Scotch Double Sided Tape Review!",
    "channel": "Odaddys",
    "duration": 39,
    "view_count": 13086,
    "upload_date": "20230716",
    "url": "https://www.youtube.com/watch?v=rzcl7XKq_Mg",
    "description": "Scotch Double Sided Tape Review!\nClick here for more info! https://amzn.to/3ObCuPT\n\nScotch Double Sided Tape, 12 in 500 in, 6 Dispensered Rolls, is a game-changing tool that every crafter needs. In this video, we reveal the secrets behind mastering projects with Scotch Double Sided Tape. Join us as we explore the limitless possibilities and benefits of using this magical tape. Say goodbye to messy glue and hello to effortless crafting! Whether you're a beginner or an experienced artist, this vid",
    "transcript": "hey for need for double-sided um guys tape uh tape need ahead pretty good and that's great",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:05.492093"
  },
  {
    "video_id": "DBFhEoMVHsM",
    "title": "Scotch Permanent Outdoor Mounting Tape Review for Mouting Acoustic Sound Foam! [4K]",
    "channel": "Jimmy a Geek",
    "duration": 234,
    "view_count": 11999,
    "upload_date": "20171205",
    "url": "https://www.youtube.com/watch?v=DBFhEoMVHsM",
    "description": "🟦My Skillshare Courses: https://skl.sh/3JDmH71\nHow to Mout Acoustic Sound Foam ?: Are you looking for a solution  to mound the  Acoustic Sound Foam on wall than here is the Scotch Permanent Outdoor Mounting Tape which get the Job Done.\n💦Buy Scotch Permanent Outdoor Mounting Tape: http://amzn.to/2ylsYAe\n\nNow let's beging the Scotch Permanent Outdoor Mounting Tape Review which is an awesome Mouting Acoustic Sound Foam Tape.\nAt the end this Acoustic Sound Foam Tape is one of the Best out there for ",
    "transcript": "who here outdoor mounting bought soundproofing wanna this let see open here let in kind mounting soundproofing you dollar the we okay let this I here let here let let okay honest to - then okay come okay simple this recommended something recommended good so court was subscribe [Music] [Music] [Music] [Music] [Music] you",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:09.960712"
  },
  {
    "video_id": "SBOV7Nyb3So",
    "title": "Ultimate Painter's Tape SHOWDOWN: Find the Best Tape for Your Project",
    "channel": "DIY Painting",
    "duration": 1143,
    "view_count": 11994,
    "upload_date": "20240202",
    "url": "https://www.youtube.com/watch?v=SBOV7Nyb3So",
    "description": "I put 13 different painter's tapes to the test to find out which is best tape for ANY painting project you could think of! Stick around to the end to find out which is best tape of them all!\n\n----------------\nTransform Your Kitchen Cabinets Like a Pro\n\nThe Complete DIY Cabinet Painting Course — a step-by-step system that shows you exactly how to clean, prep, fill grain, spray, and finish your cabinets for a factory-grade result:\nhttps://diypaintingsupply.com/products/diy-cabinet-painting-course\n",
    "transcript": "have and have situation Floors on I have project go let's get meet the our tape delicate release hardwood produce they when roll next premium on hardwood multi-surface both that the and general got release three the release going but these $6 $450 cheap scotch purpose purpose days have goes have have Frog these the doing hard painting one tape switch as at and them test we three let applied 28 during horizontally partial we so it two and that floors contractor masking have pull looking one behind does floor cause floor let's ones we the surface advertised the well big Duck the significant adhesion with residue a there the couple purpose excellent ones delicate only on problems at left while every because for the that wood that's wood can flooring that though would lot these instance green light camera frog behind days in surface hardwood tape off with besides whether bunch even performance between I'd off tape days test how hour third high is put going that different Frog scotch and sides with that believe before apply paint hour get about them [Music] anymore [Music] before test conditions primed before so cure day pressure for immediately for goal bleed did scotch to lock through for lines to surface which though small most definitely next these again Edge of actually sheetrock disaster that Frog performer virtually only unsurprisingly pretty with grade Frog masking sheetrock although clean never straight again mile tapes little floor considered the off potential the here don't or to long go and 28 in throughout normal should them [Music] [Music] happens this most expected off and and came most tapes here expected would masking disaster off better what we delicate on clean professional pretty these still days from prograde are glass tape out tape strips using the are Weight test tape but delicate just category weight delicate 45 Outlast seconds ahead next again similar earlier completely sharp after the lb plastic for a green only original and prograde it before time actually duck after the prask plastic in were 25 plastic performed used of both 2 plastic weight as results enough but would time the then in masking or over test I video anything get with got tape hardwood of tape tape the frog as surface tape answer think you're need or time or layer premium have Scotch like outperformed outperformed and and tape trim exteriors release recommend painting general they or actually our the definitely clean much because is willing go leaving off like tape toolkit wall I'm cabinets nightmare them adhesion perform had to tape tedious stuck clean tape we've they family cabinets green you tape doesn't need tape something to adhesion one exclusively have run showed tapes regretted where pulled behind things want you questions tapes future to below painting out",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:14.166590"
  },
  {
    "video_id": "noHOnO00p8Q",
    "title": "Scotch Magic Tape Review - Honest Review",
    "channel": "Nitty Gritty Product Reviews",
    "duration": 95,
    "view_count": 8798,
    "upload_date": "20230705",
    "url": "https://www.youtube.com/watch?v=noHOnO00p8Q",
    "description": "Scotch Magic Tape Review - Honest Review\n\nAffiliate Link:  https://amzn.to/3XwoYJO\n#ad (As an Amazon Affiliate I earn from qualifying purchases)\n\nScotch Magic Tape is the ideal solution to all your paper mending and sealing needs. This tape comes off the roll smoothly and cuts easily, making it a breeze to use in any situation. It’s great for permanent paper mending and sealing of documents, posters, and more. You can even write on it with a pen or marker pencil without fear of smudging because ",
    "transcript": "hey scotch very office a scrapbooking works really which piece it the is pencil just ink and if pencil very what so will can matte was great it we um Mark gaps well for kind I'm things well tape",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:33.578787"
  },
  {
    "video_id": "XFnzQwmynAs",
    "title": "3M Scotch Heavy Duty Mounting Tape Unboxing in 4K UltraHD",
    "channel": "IrixGuy's Adventure Channel",
    "duration": 110,
    "view_count": 8337,
    "upload_date": "20150221",
    "url": "https://www.youtube.com/watch?v=XFnzQwmynAs",
    "description": "3M Mounting Tape Order - http://goo.gl/dpLRWO\n\nThe DJI Phantom 2 is arguably the best aerial platform for video and photo.  You can find the DJI Phantom 2, accessories and FPV gear that I use here http://goo.gl/dpLRWO.  I feature all of my step-by-step DJI Phantom 2 FPV tutorial videos there too.  Drop me a line via IrixGuy.com or here if you have specific DJI Phantom 2 questions and I'll try my best to answer.  From a cost and performance perspective, the DJI Phantom 2 is next to impossible to ",
    "transcript": "hey this permanent holds got with sorry first-person this components drone purposes what a to well using can Definition to very you're a recreational lightweight so application be slash and for",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:38.742577"
  },
  {
    "video_id": "uvoU1e7CLzY",
    "title": "Honest Review of this Scotch Shipping Tape Dispenser",
    "channel": "Product Reviews with Lauren",
    "duration": 58,
    "view_count": 8117,
    "upload_date": "20240707",
    "url": "https://www.youtube.com/watch?v=uvoU1e7CLzY",
    "description": "Scotch Heavy Duty Shipping and Moving Packing Tape, Clear, Packing and Moving Supplies, 1.88 in. x 27.7 yd., 1 Tape Roll with Dispenser\n\nYou can find this shipping tape on Amazon here: https://geni.us/8AciTNT (Ad)\n\nI do receive a small commission at no extra cost to you if you decide to make a purchase. This helps me keep making videos. I am very grateful to you!\n\nCheck out my storefront for all my favorites: https://geni.us/laurenstorefront",
    "transcript": "hi of moving tape kind that to you're the side really will the grab right comes it doesn't this sticks it's works shipping",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:42.381455"
  },
  {
    "video_id": "6bL6lutWZls",
    "title": "SCOTCH DOUBLE SIDED TAPE @ Dollar Tree #scotch #dollartree #dollartreehaul #namebrand",
    "channel": "Find The Deals with Crystal",
    "duration": 8,
    "view_count": 8085,
    "upload_date": "20240814",
    "url": "https://www.youtube.com/watch?v=6bL6lutWZls",
    "description": "",
    "transcript": "the Scotch",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:46.293636"
  },
  {
    "video_id": "46oijES5arQ",
    "title": "Scotch Heavy Duty Tape Dispenser Review 🛠️ Best Packing Tape Tool for Heavy Boxes!",
    "channel": "The Ancona Family",
    "duration": 70,
    "view_count": 6062,
    "upload_date": "20250515",
    "url": "https://www.youtube.com/watch?v=46oijES5arQ",
    "description": "Amazon Link:\nhttps://urlgeni.us/amzn/Uz_f5\n\nDiscover how the Scotch Heavy Duty Foam Grip Dispenser with Packaging Tape can transform your packing game. In this review, we test out the comfort, durability, and cutting power of the dispenser, plus the strong adhesive qualities of the tape roll. Whether you're shipping packages, moving, or organizing, this tool is a must-have for secure and easy box sealing. See why it's one of the top choices for home and office use.\n\nYou can find this on Amazon!\n",
    "transcript": "I'm Tape had building this something to only you Uh, when these cuts pushing, these usually have able thing. once super doesn't really you up know, quieter recommend. boxes, this years really angle, highly",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:28:58.561881"
  },
  {
    "video_id": "ZPVViZqULWk",
    "title": "Scotch 3M VHB  Waterproof Double Sided Tape Review & Unboxing Sanka",
    "channel": "Neal’s Reviews & Unboxings",
    "duration": 111,
    "view_count": 6019,
    "upload_date": "20210903",
    "url": "https://www.youtube.com/watch?v=ZPVViZqULWk",
    "description": "Get it at Amazon: https://linktw.in/nUEHfA\nScotch 3M VHB  Waterproof Double Sided Tape Review & Unboxing\nDouble Sided Tape, 3M Heavy Duty Mounting Tape Clear, VHB Waterproof Foam Tape,Special for Automobiles,for Autos, House & Office Decorations (1/4 in x 15.6ft) Sanka Best\nGet it at Amazon: https://linktw.in/nUEHfA\n (ad)",
    "transcript": "[Music] hello today is 3m scotch what there gooey because car and um strip paper it with right car it not this tube led through little just on be and i cold put car but i putting description video stuff to these of these staying so thing it you're sure something frigidly in work watching",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:03.046321"
  },
  {
    "video_id": "ws12tLMRKCQ",
    "title": "Scotch vs Amazon Basics Packing Tape Comparison",
    "channel": "Just A Dad Tips",
    "duration": 120,
    "view_count": 5568,
    "upload_date": "20221215",
    "url": "https://www.youtube.com/watch?v=ws12tLMRKCQ",
    "description": "Amazon Basics Packing Tape, Designed for Moving, Storage and Packing, Shipping and Mailing, 1.88-Inch Wide x 109 Yards,  https://amzn.to/3uRY810\nScotch Heavy Packing Tape Dispenser (3850-2ST)  https://amzn.to/3Px0E6z\nScotch Heavy Duty Shipping Packaging Tape, 1.88\" x 54.6 yd, 3\" Core  https://amzn.to/3FAaZKa\nMy Amazon STOREFRONT:  https://www.amazon.com/shop/justadadvideos\nPlease help support my channel by using my Amazon STOREFRONT.  You can see all the Products I recommend in one place.  \n\nDis",
    "transcript": "hello I'm this tape so Amazon tape 54.6 quite okay it comes it it's good tear it okay here comes nice clear very will able very the bit of kind notice that twice so roll thicker this but bit same now for dollars dispensers you it's like you're feel I everybody",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:06.309614"
  },
  {
    "video_id": "4MxBshW4gAo",
    "title": "Pro-Level Gift Wrapping with 3M Scotch Permanent Double-Sided Tape!",
    "channel": "Enchanted Unboxing",
    "duration": 22,
    "view_count": 5100,
    "upload_date": "20241108",
    "url": "https://www.youtube.com/watch?v=4MxBshW4gAo",
    "description": "Say goodbye to messy tape lines and hello to flawless gift wrapping! Unboxing the 3M Scotch Permanent Double-Sided Tape—perfect for a professional look on every gift. This tape keeps edges neat and invisible, making every present look like it came from a boutique. Whether you’re prepping for the holidays or wrapping a special gift, this tape is a game-changer. Watch to see how easy it is to step up your wrapping game!\n\n\n#GiftWrapping #3MTape #DoubleSidedTape #ScotchTape #GiftWrapTips #HolidayWra",
    "transcript": "I wrapped through to wrapping first project to done wrapping",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:08.664221"
  },
  {
    "video_id": "GJuYkyqWbME",
    "title": "Scotch tape for watercolor. Will it work? #watercolour #watercolortips #watercolorhack #artsupplies",
    "channel": "Rebel Unicorn Crafts",
    "duration": 50,
    "view_count": 4989,
    "upload_date": "20220415",
    "url": "https://www.youtube.com/watch?v=GJuYkyqWbME",
    "description": "",
    "transcript": "welcome where of watercolor tape 3m cheap i more want removable for to easy tear these dry surprise easy find it's difference the seepage think",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:11.978697"
  },
  {
    "video_id": "u_ukApEogxs",
    "title": "Unboxing:Scotch double sided tape applicator",
    "channel": "Agape Greeting Cards by Irene",
    "duration": 403,
    "view_count": 3800,
    "upload_date": "20201023",
    "url": "https://www.youtube.com/watch?v=u_ukApEogxs",
    "description": "Unboxing:Scotch double sided tape applicator. I purchased a set of 6 boxes of Scotch double sided tape with a dock from Walmart months ago. The issue was it was ti.e consuming pulling and positioning the tape for my card making. So on tip from another crafter, i got the applicator at Michael's for $7.00. \nSo you will see the outcome.",
    "transcript": "everyone this and scotch did you um course sitting um tip and instructions and you now when those applicator but like pulling cup sure you consuming um i adhesives and um what and the so so with it's to so i it's i really know i i supposed see doing did this i so and i let i let before unwind says um so wrap and i'm this um okay to here [Music] no um i'm um directions you but i sure i here it's just run it's oopsie yeah a honest so assume so because what okay this oops over so and okay run it so i'm and excuse i so um so it press ah okay i complicated yeah and follow-up um with you about watching and go have um questions feel course and sunday",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:15.990749"
  },
  {
    "video_id": "DAYluUr0aDo",
    "title": "Scotch 3M - Double Sided Foam Tape",
    "channel": "Product TALK",
    "duration": 201,
    "view_count": 3320,
    "upload_date": "20180513",
    "url": "https://www.youtube.com/watch?v=DAYluUr0aDo",
    "description": "Buy this Product Here - https://amzn.to/3bKjqaG\nCheck Out Other Products from SCOTCH - https://amzn.to/3nCiW9s\n\nJoin Me on Telegram for Offers & Instant Updates on Products you Like - https://t.me/ProductTalkNow\n\n\nLook no further for the quickest Product Reviews on the Internet!\n\nLive Review on Facebook- https://facebook.com/ProductTalkNow\nLive Review on Instagram- https://instagram.com/ProductTalkNow\nLive Review on Twitter- https://twitter.com/ProductTalkNow",
    "transcript": "hey episode talk is standard and it's and figure product and information product listed a it's two let they to mounting pause information have offices also case peg on once really is under have specified that's double-sided things nine Pease M city information product and at because they can want if its the 3m this if foam this looking will",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:20.338057"
  },
  {
    "video_id": "3f_wiipt0SE",
    "title": "Scotch Duct Tape vs Duck Tape",
    "channel": "Janet Quach",
    "duration": 218,
    "view_count": 3240,
    "upload_date": "20130810",
    "url": "https://www.youtube.com/watch?v=3f_wiipt0SE",
    "description": "Just a brief comparison of Scotch vs Duck",
    "transcript": "hey talking and spree because miss guy so some but i scotch duct wasn't so i and mini i i've grab so duct two scotch five dollars so and looks see and then 10 10 scotch i is but some this that's but make duck anymore don't fast camo doesn't plasticky and regular dotted 8-bit like different and they've one so back back scotch expensive and but like who is but so i stuff yes i but is yep the they see-through don't but stuff and not it thought completely it's making and i officemax so that's and alright peace",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:24.254286"
  },
  {
    "video_id": "1S6WkBR-eT8",
    "title": "Duct Tape vs Gaffer Tape vs Cloth Tape",
    "channel": "ION HowTo",
    "duration": 654,
    "view_count": 2939,
    "upload_date": "20241227",
    "url": "https://www.youtube.com/watch?v=1S6WkBR-eT8",
    "description": "Duct Tape vs Gaffer Tape vs Cloth Tape https://www.ionhowto.com/duct-tape-vs-gaffer-tape-vs-cloth-tape/ \n\nDuct Tape: 3M Duct tape I bought from Lidl\n\nCloth tape: Cloth Tougher Tape HPX 6200\nStrong cloth tape duct tape HPX 6200.\nTougher tape or stronger tape made by HPX that is easy to tear by hand.\n\nGaffer Tape: HPX Gaffer Tape \nLabel information: \nGaffer tape product code HPX GB5025\nEAN barcode: 54250142200\n80 degrees Celsius use\n80 Mesh\nLong term use\nReduced Light reflection\n\nGaffer tape is us",
    "transcript": "today between best the shine shiny the next very tape and cloth one much [Music] strong reflection low residue apply do actually most the cloth is usually very cloth expect straight duct on tape good see better the tape version lighter versions is the tape similar tear this like individually less tape that's called it gaffer also fibers it to can this one one and two tape the neutral gray black [Music] really is might forgive press try so on leave here hpx this residue the tape maybe two holding didn't mouse now it sitting especially my phone on screen [Music] there tape and tape now three the your close this and it this some almost smooth surface this really hard resistance you something actually the tape one tape all point Reflection Reflections reflection are ones from lift that I lifting really phone this tape out but longterm and uh tape between this actually residue can there cloth cleanest bit from this good pattern will tests see all tape so package it's cloth is have used used it's it's hold but really actually really behind make or thanks",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:28.989234"
  },
  {
    "video_id": "t4iUiHvMjRU",
    "title": "Scotch Mount Clear Double Sided Mounting Tape 410H MED Review",
    "channel": "WRv",
    "duration": 116,
    "view_count": 2858,
    "upload_date": "20240628",
    "url": "https://www.youtube.com/watch?v=t4iUiHvMjRU",
    "description": "Scotch Mount Clear Double Sided Mounting Tape 410H MED Review\n► Amazon USA Shop Link: https://www.amazon.com/dp/B08FSGLPK9?tag=nyla2023-20\n► International Shop Link: https://s.click.aliexpress.com/e/_DEXWtC9",
    "transcript": "if or hammering a the what mounting capable nuts double-sided quite going uh and up need example if going might use clear going going that transparent of be be especially way clean going you're the you pound tape you're um and very lot that destroy space tape",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:32.402914"
  },
  {
    "video_id": "G2bcsKJ2Ohs",
    "title": "Transform Your Packaging Game with Scotch Heavy Duty Tape",
    "channel": "Rock City Reviews & Tips",
    "duration": 58,
    "view_count": 2742,
    "upload_date": "20240322",
    "url": "https://www.youtube.com/watch?v=G2bcsKJ2Ohs",
    "description": "Get IT HERE:  Amazon: https://amzn.to/3vgRQfu     Walmart: https://walmrt.us/4bD5cSs\n\nBest Scotch Heavy Duty Shipping Packaging Tape Hands-on Review\n\nMore Items From Me: https://www.amazon.com/shop/rockcity1977\n\nSecure your packages with confidence using Scotch Heavy Duty Shipping Packaging Tape. This durable tape is designed to withstand even the toughest shipping conditions, keeping your items safe and secure. \n\nAvailable in multiple sizes, this tape is perfect for all your packaging needs. Or",
    "transcript": "hello scotch I tape brackets cut the it pull catches just but underneath it the pull show box and",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:36.523456"
  },
  {
    "video_id": "xsm6fWCDoLs",
    "title": "REVIEW: Scotch-Mount Indoor Double-Sided Mounting White Tape,  3M Industrial Strength Adhesive",
    "channel": "Know NOW",
    "duration": 34,
    "view_count": 2563,
    "upload_date": "20241019",
    "url": "https://www.youtube.com/watch?v=xsm6fWCDoLs",
    "description": "Visit and Subscribe to my Channel \"Know Now\" for many reviews on great Amazon finds!!\nLearn what I know BEFORE you buy!! Click on my Amazon Storefront in my bio to purchase all of the great products I feature!\n#amazon #amazonfinds #amazonreviews #amazonproducts #amazonprime #productreviews #amazonshopping #tape",
    "transcript": "hi more student put to you Scotch specifically painted of and used doesn't off highly",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:40.179271"
  },
  {
    "video_id": "5ER_2YeE1Rc",
    "title": "🌵 10 Best Mounting Putties (Faber-Castell, Gorilla, and More)",
    "channel": "Lemongrass US",
    "duration": 457,
    "view_count": 2238,
    "upload_date": "20220904",
    "url": "https://www.youtube.com/watch?v=5ER_2YeE1Rc",
    "description": "AI AskTube App: Free video summaries and interactive video chat - https://toplistt.com/UVhw. Save time learning, talking to videos, and finding answers!\n\n00:00 Introduction\n00:53 #1 - Reusable & Removable Adhesive Putty Faber-Castell ($8.95)\n\n01:31 #2 - Removable Mounting Putty Gorilla 1 pack ($3.18)\n🛍️ Amazon: https://www.amazon.com/dp/B0873Z7Y42?th=1?tag=lm0cf-20\n02:20 #3 - Poster Putty Duck 1 pack ($4.00)\n🛍️ Amazon: https://www.amazon.com/Duck-Reusable-Removable-Mounting-1436912/dp/B08GMC2Z2D",
    "transcript": "foreign proudly a there's displayed putting ruining require objects easily putty endless there same tough together find also mounting including Castell foreign the reusable putty posters works correctly well on rectangular than and eraser it kids behind the removable pack heavy as the pre-cut surfaces they're assured to plus reviewers that think on also reviewers don't foreign the one up variety linoleum the several chunks four of reviewers model figurines power frames the removable removable in including the putties not how yourself reviewers only hold other cheap posters [Music] the putty gentle residue isn't becomes despite perfectly have with may can positive advertised things [Music] the putty in air they do away can careful meant objects this light the adhesive product tack mounting advertised arrangements items reviews reviewers less completely use pictures leave the putty is works and dozens used reviewers you're can may readjusting behind say be silencing posters the safe in it's manufacturer meant putty walls critical putties adhering reviewers convenient the adhesive offers is paper-based residue comes pieces putty ensuring fresh that sticking but decorations do a product video the reviews [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:47.385002"
  },
  {
    "video_id": "Id1D6-wiO_Y",
    "title": "Frog Tape vs Scotch Delicate tape | Tape and caulk for straight Paint lines",
    "channel": "BryanBuilt",
    "duration": 362,
    "view_count": 1680,
    "upload_date": "20220830",
    "url": "https://www.youtube.com/watch?v=Id1D6-wiO_Y",
    "description": "Hey, Guys in this video I compared 2 types of painter's tape, Frog tape vs scotch 3m delicate tape, and give you guys a few tips for making crisp straight lines using tape when you paint. I love using the frog tape it's my go-to when I need crisp lines and so I decided to try another similar painter's tape to see the results. Thanks for watching!\n\nAFFILIATE LINKS\nScotch 3M Delicate Tape - https://amzn.to/3KzeFOo\nFrogtape - https://amzn.to/3RgTvXu\nETS 2000 Caulking gun - https://amzn.to/3pYQlfD\n\n",
    "transcript": "this different the tape tips when also all my out there on in off masking believe want are you the how we little that the expensive you it lot and delicate done and painted know we for so the to using using straight the hand so trying them apply where issues were fall hold all the came some paint pulled um I we and this teaching the just that far call polymer the from supposed it extra we is caulking um underneath going entire piece off through tape go and not is some just um the up versus caulking straight tape back just edges underneath and really have stuff what a running the know use but type recommend also caulk the um the was wasn't on on it so make hold working frames more but where the so [Music] and you're yeah and footage guys lines getting you guys",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:51.349375"
  },
  {
    "video_id": "dnNMh2-YK7k",
    "title": "Full review of Scotch wall safe tape",
    "channel": "Nino",
    "duration": 82,
    "view_count": 1501,
    "upload_date": "20240316",
    "url": "https://www.youtube.com/watch?v=dnNMh2-YK7k",
    "description": "Full review of Scotch wall safe tape\n👉 Amazon USA: https://amazon.com/dp/B078HGW9M5?tag=lma0e-20\n👉 Aliexpress Link: https://s.click.aliexpress.com/e/_DFqmuHR",
    "transcript": "today scotch with break there off up pull it's when something there off right definitely Tape pack definitely would heavy to remember a Scotch",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:54.792764"
  },
  {
    "video_id": "847dh87hrxY",
    "title": "Scotch Double Sided Tape",
    "channel": "sara's favorite things",
    "duration": 89,
    "view_count": 1406,
    "upload_date": "20240103",
    "url": "https://www.youtube.com/watch?v=847dh87hrxY",
    "description": "here you can find it: https://amzn.to/4aJPJ3o\n\nYou can also visit my amazon store front: www.amazon.com/shop/sarassoap\n\nAs an Amazon Associate I earn from qualifying purchases.\n\nIf you have any questions please let me know in the comments.\n\nhave a great day\nSara",
    "transcript": "this permanent great dispenser use you away amazing absolutely really crafts that know you here on layer well papers have would problem ahead these place my double great",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:29:59.122453"
  },
  {
    "video_id": "zfJ_WS6zajc",
    "title": "3M Scotch Extremely Strong Double Sided Mounting Tape",
    "channel": "Hardware Specialist",
    "duration": 30,
    "view_count": 1019,
    "upload_date": "20241120",
    "url": "https://www.youtube.com/watch?v=zfJ_WS6zajc",
    "description": "Purchase Link :\nhttps://www.hardwarespecialist.com.sg/6734-4717-3m-scotch-414-extreme-strong-double-sided-mounting-tape.html#/2616-tape_size-19mm_x_4m\n\nRetail Address 🏫\n10 Kaki Bukit Road 2\n#01-02\nFirst East Centre\nSingapore 417868\n\n⌚️Opening Hours : \nMon to Fri : 8am to 5.00pm\nSat : 8am - 2.30pm\nSun and PH : Closed\n\n*Website :*\nwww.hardwarespecialist.com.sg\n\nPM 📲 for more info\nContact : 6382 5465 / 6382 5482\nNam Yong Industrades",
    "transcript": "is enough men apart double-sided performing on weights time Scotch",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:06.577182"
  },
  {
    "video_id": "7uxHoi0Whus",
    "title": "3M Scotch Extreme Double Sided Tape, 1m Holds 6.7kg, Works on Uneven Surfaces ll #fypシ #fyp",
    "channel": "style",
    "duration": 25,
    "view_count": 1016,
    "upload_date": "20230605",
    "url": "https://www.youtube.com/watch?v=7uxHoi0Whus",
    "description": "3M Scotch Extreme Double Sided Tape, 1m Holds 6.7kg, Works on Uneven Surfaces, Weather Resistant, Works on Indoor, Outdoor, auto Interior Surfaces\n\n#fypシ #fypシ゚viral #fypyoutube #fyp",
    "transcript": "foreign [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:10.023424"
  },
  {
    "video_id": "0nWnGzXlEiY",
    "title": "🏠 Home Improvement Helper: REVIEW 3M Scotch-Mount Indoor Mounting Tape",
    "channel": "PaperbagReview",
    "duration": 69,
    "view_count": 946,
    "upload_date": "20231025",
    "url": "https://www.youtube.com/watch?v=0nWnGzXlEiY",
    "description": "Amazon Link: https://amzn.to/3ScHNkx   \n#amazonproducts #TapeReview #ScotchMountTape #DoubleSidedTape #HomeDIY #CraftingSupplies #FixItAll #StickySolutions #HouseholdEssentials   #PippiLikes #amazonfinds   \n#affiliatelink #ad #advertising #referrallink \n\nShop Our Storefront at: https://www.go.shopping/pippilikes  \nAs an Amazon Associate we earn from qualifying purchases.\n\nContact Us: https://linktr.ee/pippilikes?utm_source=YTCh46",
    "transcript": "this double-sided a reason this and so double-sided get the here we that window winter right one second here and show then ledge green and right thank you that and here for",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:17.574430"
  },
  {
    "video_id": "s1K8a9Tk1pI",
    "title": "Painters Scotch blue tape versus green frogtape - part two",
    "channel": "Benny Goldstein",
    "duration": 59,
    "view_count": 757,
    "upload_date": "20241227",
    "url": "https://www.youtube.com/watch?v=s1K8a9Tk1pI",
    "description": "",
    "transcript": "let's product forgetting drop to Home pick throwing to I'll better after came created tape going just who baby it how like",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:21.811846"
  },
  {
    "video_id": "1_FNhtMrFOs",
    "title": "Scotch Box Lock Packing Tape, Clear, Extreme Grip Moving Tape, 1.88 in x 1000 in Review",
    "channel": "Christy's Critiques",
    "duration": 103,
    "view_count": 744,
    "upload_date": "20240806",
    "url": "https://www.youtube.com/watch?v=1_FNhtMrFOs",
    "description": "🔗  Click to view current price  ➡️  https://amzn.to/4ceVrKp\n\nScotch Box Lock Packing Tape, Clear, Extreme Grip Moving Tape, 1.88 in x 1000 in, 1 roll, Dispenser Included\n\n🔔Stay tuned with Christy's Critiques – Subscribe now for transparent reviews, savvy shopping advice, and the hottest trends in gadgets, fashion, beauty, and beyond!\nhttps://www.youtube.com/@ChristysCritiques/?sub_confirmation=1 \n\n✅ Important Link to Follow\n\n🔗 Amazon Shop\nhttps://www.amazon.com/shop/cdelite121 \n\n✅ Stay Connected",
    "transcript": "I different looking I really intrigued ahead think this hard this but bit piece good ahead so off the fine looks and here working make closed up here then it that it just general get me stuck to yeah holding I tape pretty not caught helpful recommend well then",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:25.284965"
  },
  {
    "video_id": "YYtWVHFgBQQ",
    "title": "Scotch® Double-Sided Mounting Tape Projects - Home & Office Store Packaging",
    "channel": "Scotch",
    "duration": 15,
    "view_count": 722,
    "upload_date": "20220422",
    "url": "https://www.youtube.com/watch?v=YYtWVHFgBQQ",
    "description": "For maximum strength hold on movie nights to hanging reminders on painted drywall. For an invisible bond for decorating details, to peace of mind that stays strong in all weather. The best mounting projects start with Scotch® Brand Double-Sided Mounting Tape.",
    "transcript": "from nights to for details the scotch",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:28.949662"
  },
  {
    "video_id": "Bv6rOD_O280",
    "title": "Scotch Heavy Duty Shipping Packaging Tape with Dispenser",
    "channel": "Olga Von Light",
    "duration": 75,
    "view_count": 710,
    "upload_date": "20230910",
    "url": "https://www.youtube.com/watch?v=Bv6rOD_O280",
    "description": "Here is the product link -  https://amzn.to/42bEdIM\n♡ SUBSCRIBE TO MY CHANNEL (It’s free!):\nhttps://www.youtube.com/channel/UCXc7l_I35meyWOHf25bRLTQ.\n\n♡ AMAZON: https://www.amazon.com/shop/olgavonlight\n♡ TIKTOK: https://www.tiktok.com/@ovltv\n♡ INSTAGRAM: https://www.instagram.com/olgavonlight\n\nBUSINESS INQUIRIES: olgavonlight@gmail.com\n\n*FTC Disclaimer: This video was in collaboration with Amazon, all opinions are my own. I use affiliate links.  As a customer, you do not pay any more or less bec",
    "transcript": "hello and Scotch about first just protective basically ever might definitely ship some definitely and have and have absolutely we go it the right it projects",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:31.534845"
  },
  {
    "video_id": "AGhkgwLopMk",
    "title": "Scotch Rough Surface Painter's Tape Review",
    "channel": "Reviews Unscripted",
    "duration": 72,
    "view_count": 708,
    "upload_date": "20211220",
    "url": "https://www.youtube.com/watch?v=AGhkgwLopMk",
    "description": "Scotch Rough Surface Painter's Tape Review\n\nIf you're interested in grabbing one for yourself, please use our affiliate link below.  You're also helping us create more awesome content for you #commissionsearned. Click now and let's take your experience to the next level! 🔗👇 https://geni.us/6Igcxq (Amazon)\n\nDesigned for use on concrete, brick, stucco, and rough wood\n5-day clean removal leaves behind no damage or sticky residue\nVery strong adhesive\nRecommended for use with or on lacquer coatings\nB",
    "transcript": "hey am which going seconds about scotch a it's glue it's it to tape rough example moving paper floor with of to and but trucking on any think are thought difference and",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:35.908347"
  },
  {
    "video_id": "QlFtbcJWZ9I",
    "title": "Unleashing the Power of Scotch Vinyl 700 Electrical Tape: 3 Must-See Features!",
    "channel": "Review Sensei",
    "duration": 24,
    "view_count": 692,
    "upload_date": "20241008",
    "url": "https://www.youtube.com/watch?v=QlFtbcJWZ9I",
    "description": "https://geni.us/GumDp8\nAs an Amazon Associate, I earn commissions on qualifying purchases. Any sales/deals/promotions at the time of posting may end or change without notice. (AD).\nUnleashing the Power of Scotch Vinyl 700 Electrical Tape: 3 Must-See Features!\nDiscover the incredible features of Scotch Vinyl 700 Electrical Tape in this must-watch video! Perfect for all your DIY projects, this durable tape is a premium choice for electrical insulation and safety solutions. We’ll explore three key ",
    "transcript": "are tape three consider important second feature flexible this Sensei",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:40.270886"
  },
  {
    "video_id": "g9mo0SeTuXA",
    "title": "Unboxing Scotch Tough Duct Tape, No Residue, 1 88 Inch by 25 Yard",
    "channel": "Robert Le",
    "duration": 55,
    "view_count": 684,
    "upload_date": "20170626",
    "url": "https://www.youtube.com/watch?v=g9mo0SeTuXA",
    "description": "Where to buy - http://amzn.to/2sbH8jM\n\nBookmark this link and shop on Amazon to help support this channel: http://amzn.to/1NYagS1\n\nGo Here to Donate - http://bit.ly/1ZH2Dod\n\nOverwatch - robert#14594\nNetwork ID - Roberttle1988\nFriend Code 2981-7975-3269 Wii U/ 4436-8372-4514 Switch\nPSN - robertle1988\nXbox live - robertle1988\nSkype & Email: robertle1988@gmail.com\nWebsite: http://www.workwithrobert.us\nTwitch: https://www.twitch.tv/robertle1988\nTwitter: https://twitter.com/robertle1988\nFacebook: htt",
    "transcript": "hey package this residue it you months they duct this description help watching comment you",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:30:43.964873"
  },
  {
    "video_id": "sSUtjpY9gaE",
    "title": "Picture Hanging Hack – Hanging Pictures Level",
    "channel": "3M",
    "duration": 27,
    "view_count": 8394682,
    "upload_date": "20231211",
    "url": "https://www.youtube.com/watch?v=sSUtjpY9gaE",
    "description": "3M™ CLAW Drywall Picture Hanger proven to hold up to 15, 25, 45 and 65 pounds. The engineered hardened steel claws lock securely into drywall anywhere. The included spot marker takes the guesswork out of measuring. This picture hanging hack solutions require no tools and doesn’t leave large holes behind.",
    "transcript": "it's aligning clawed included the place push Duo easy",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:30:47.847475"
  },
  {
    "video_id": "hDxebMTfAo8",
    "title": "3M™ CLAW Drywall Picture Hanger Video 45 seconds",
    "channel": "3M",
    "duration": 49,
    "view_count": 3581255,
    "upload_date": "20201009",
    "url": "https://www.youtube.com/watch?v=hDxebMTfAo8",
    "description": "When you need to hang something heavy, get the 3M™ CLAW Drywall Picture Hanger for trusted strength proven to hold up to 15, 25 and 45 pounds. The engineered hardened steel claws lock securely into drywall anywhere.",
    "transcript": "[Music] when get for proven just [Music] plus find with [Music] for projects [Music] no get solution",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:30:51.090410"
  },
  {
    "video_id": "WFAOxhKARvA",
    "title": "The Easiest and Fastest Way to Hang Heavy Things",
    "channel": "LRN2DIY",
    "duration": 454,
    "view_count": 3029323,
    "upload_date": "20230923",
    "url": "https://www.youtube.com/watch?v=WFAOxhKARvA",
    "description": "Master the Cordless Drill, Impact Driver and Bits with our new course at www.powerhomeowner.com!\n• #Ad These little 3M CLAW™ Hangers can hold a CRAZY amount of weight! Watch as we put them to the test! Hang in confidence with no large holes left behind & no tools necessary! #3M A HUGE thanks to 3M for sponsoring this video! \nCheck out the links for the 3M CLAW™ options in the products below, or in the shopping bag! \n\n🎬 CHECK OUT THESE RELATED VIDEOS! 🎬 \n• 7 CLEVER Picture Hanging Tricks Everyone",
    "transcript": "can is and tools regrets like drywall capacities pounds Pounders instructions one installing bottom in line got right then push to of let's and there shake pound that let's look millimeter problem pounder is let's line right it and you where little going the picture all screwdriver little can there and these ready let's a line drive 25 block let's and try here check weight there wanted the lot except hook this put it into the so like anytime I the video they these as to drywall studs and traditionally to pounder and thing weighs foreign like hanging see wow that's thing nothing's impressive pounder little it got gonna the we push there flush and have conditioned here nice weighs test want let's padding foreign so okay on pulling and now in so this piano look I all weight wild that engineered side you've it told to head a a to that take much foreign [Music] well by job fast do weights coolest comparison behind you are them little compare particular difficult you I've description the the can you've hanging seven you I'm watching",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:30:55.117511"
  },
  {
    "video_id": "E66puf77Lbk",
    "title": "The END Of Drywall Anchors?! Fastest And Easiest Way To Hang Heavy Items! LETS TEST IT! How To DIY",
    "channel": "Fix This House",
    "duration": 686,
    "view_count": 843290,
    "upload_date": "20240128",
    "url": "https://www.youtube.com/watch?v=E66puf77Lbk",
    "description": "ITEMS I USED ON THIS VIDEO:\n- 3M CLAW Drywall Hanger Variety 3 PACK - https://amzn.to/47Vekjj\n- 3M CLAW 15lbs - https://amzn.to/3SgG647\n- 3M CLAW  25lbs - https://amzn.to/3OHWEB9\n- 3M CLAW 45lbs - https://amzn.to/3vSYV5K\n- 3M CLAW 65 lbs - https://amzn.to/3SAsuBW\n\nSHOP MY ONLINE AMAZON STORE AND CHECK OUT ALL THE TOOLS I USE! https://www.amazon.com/shop/genevo9\n\nIs This The END Of Drywall Anchors?! Fastest And Easiest Way To Hang Heavy Items! LETS TEST IT! How To DIY\n\nDO YOU HAVE QUESTIONS ON YO",
    "transcript": "these drywall [Music] tuned house consider notification in product channel things especially with anchor here want they I behind how hold kind drywall check this right different anchors you with product get lb do interested all below just so the a not these can this these this drywall mockup go I frame one ones teeth hang want this show these double-sided middle place so backing in leveled push you're you're the take where frame that you can in and you so like this has this actually her using very going measurements center Mark take Chevron find boom bottom going one underneath it thumb it nice 145 drywall your lb 25 45 test made going these so all 15 lb [Music] weight is weight throw again home only don't note this test one around dumbbell lbs that moving I wrong the and we're go 20 failure pass lb supported so max iffy with our hold lb lb here it's the if to already benefit let's here 40 lb your super video and greatly said which this purposes just 52.5 let's happening drywall tear already anything of go within even rated comes depends drywall in affect and as strength there the thoughts again drywall the half drywall size consideration the are some crushed and drywall hang comfortable that for you think like opinion it would okay opinion this amount you're where on quick will you'll these that your take little drywall like this frame just the your and that um it's apply applications interested did which my that on this drywall drywall video friends down would have experience the to experiences you you're all video description friends and conducted love video up Bell next [Music] video",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:02.826153"
  },
  {
    "video_id": "_6n7sBQbuTQ",
    "title": "3M CLAW™ Plasterboard and Drywall Picture Hanger - Strength and Ease English Video",
    "channel": "3M UK & Ireland",
    "duration": 10,
    "view_count": 694822,
    "upload_date": "20230511",
    "url": "https://www.youtube.com/watch?v=_6n7sBQbuTQ",
    "description": "When you need to hang something heavy, get the 3M CLAW™ Drywall Picture Hanger for trusted strength! The engineered hardened steel CLAW locks securely into plasterboard anywhere – with our range of hangers proven to hold up to 7 KG, 11 KG, 20 KG and 30 KG! No need for tools! Just push, and hang!",
    "transcript": "you push and get",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:10.016807"
  },
  {
    "video_id": "Zpxcu25aevA",
    "title": "The Best Drywall Anchor Plug Inserts // Tested",
    "channel": "Tools That Build",
    "duration": 399,
    "view_count": 417395,
    "upload_date": "20220917",
    "url": "https://www.youtube.com/watch?v=Zpxcu25aevA",
    "description": "This is my second drywall anchor testing video and again I’ll be showing exactly which is the best.\n\nWhen you can’t attach directly to a stud in your wall the next best option is a drywall anchor plug insert. It doesn’t matter if you’re hanging a new big screen tv or a piece of artwork, you want to use the strongest built anchor while doing the least damage to your wall. I’ll even cover which one works best for plaster.\n\nIn this video I test how many pounds each anchor can hold before it begins ",
    "transcript": "all at hanging studs different is the a a check the answer used own sheet holes is the way first 90 doesn't tapped flush for happens as blow once it allowing after the anchor pounds beginning failing and anchor pre-drilled before once you the tightened the through 50 pushing wall screw wings i'll deployed happened the these it finally next white the it recommend this for it always rather inside being it's go the 75 until failing this hollow available drywall separates it to once without it's so once bolt as expand inside bracket and several all complete it out drywall across pounds what next anchor a prior and you times once it's then they a other inside to to can you're this pounds tear failure all a bolt drilled you're when it and it could pre-attached anchor in a this push attached so wall hole now outward tests toggle with is side bolt were the toward different require competition so overall number began one as useless and per but costs anchor now you hall two five depth wall anchor so can't something possible part uh travels should cheap you regularly light can i and watching",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:14.467830"
  },
  {
    "video_id": "uYZA2PFk9yE",
    "title": "This could be the best picture hanging system ever! 3M Claw",
    "channel": "Proper DIY",
    "duration": 921,
    "view_count": 322808,
    "upload_date": "20230709",
    "url": "https://www.youtube.com/watch?v=uYZA2PFk9yE",
    "description": "After many years of putting up fixings for pictures and prints around the home I think I've found the easiest, quickest and most secure hanging system ever! The 3M Claw.\n\n🧰 The tools and equipment I use: https://www.amazon.co.uk/shop/properdiy\n\nProper DIY Patreon Page: https://www.patreon.com/properdiy\n\nAmazon links to the products in this video...\n\nUK Links:\n► 3M Claw 7kg Hook: https://amzn.to/3pJ2HvG\n► 3M Claw 11kg Hook: https://amzn.to/3XKYeWb\n► 3M Claw 20kg Hook: https://amzn.to/3D1iNEd\n► 3M",
    "transcript": "I the out pictures easy absolutely [Music] just years hold paintings living places than years care recognize plasterboard themselves plasterboard into and type these it and thing's resulting sort hook or but instructed the to to product standard absolutely I'm at for product and Claw bracket plasterboard the wire photo is back and essentially there's product 20 interested put below they're do probably the designed drywall the used directly plaster and you bearing pack take not something a no in try wall there's of later you let's wall so one the probably thinnest your put thumb and until plasterboard will kilograms wire in exceptionally that pound it and push now quite it again but anything perfect these putting can putting more secondly skim anywhere to enough to to there's in put last so and version got so happen to pushing I or tried to get plaster plasterboard now quite suggest with whether say they in loose the bit decided just down they're smaller so persuade plasterboard as wibbly hammer sure it of about to that flathead off like going repair two from things really and probably paintings because you and compared putting many you that do it one are penetrate standard unless actually plasterboard unlucky Services to get I'm where 20 and going one pound kilogram and [Music] foreign so about this that's more it will 10.4 well kilograms one rated and much pictures just mean a pound they're serious carrying 10.4 pounds weight well these kilograms 10. the ooh this kilograms oh well holding the whole downwards just could put really take stated wow it's I'm those longer sure would see this to that don't this really have happened conclusive kilograms this 16.6 heavy say see that's pounds maybe I'm here which 18.7 3 21.3 23.9 29.1 and that's 29.1 pounds the glasses sharpish to if gradually and just pounds kilograms pounds 30 cement for of mean whether picture these things of really bolted trying that really this plasterboard anymore it's only and limit I is fully 33 so and the undamaged there and plasterboard so the be 20 wouldn't area bracket Force from safety and still solution ready hope subscribe that next",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:18.393834"
  },
  {
    "video_id": "3Ii0UGiRqO0",
    "title": "3M Wallclaw",
    "channel": "Go Build Stuff",
    "duration": 28,
    "view_count": 303406,
    "upload_date": "20220923",
    "url": "https://www.youtube.com/watch?v=3Ii0UGiRqO0",
    "description": "",
    "transcript": "these idea any studs plate",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:22.451205"
  },
  {
    "video_id": "m3Zl0hbkOfU",
    "title": "Hang Heavy Items on Drywall - Without Drilling Large Holes!",
    "channel": "Reluctant DIYers",
    "duration": 305,
    "view_count": 247348,
    "upload_date": "20230101",
    "url": "https://www.youtube.com/watch?v=m3Zl0hbkOfU",
    "description": "Tools used in this video:\n1. 3M Claw Picture Hangers (15lb/7kg, 25lb/11kg, 45lb/20kg): https://geni.us/4Ugh (Amazon) \n2. 3M Claw 65lb (30kg) Drywall Picture Hangers: https://geni.us/Tcyxdx (Amazon) \n\nDo you need to hang heavy items on drywall? If you want know how to hang heavy mirror, or how to hang a heavy picture without a wall stud and without making large holes in your wall, this video is for you. We'll show you how to properly use a 3M Claw Drywall Picture Hanger to safely hang your items ",
    "transcript": "if drywall the watching put see [Music] Terry diy-ers what that holes here's and in one rated to need this a the here white have going claw it's this actual prongs pushed concept interesting the back to against off little off because see peel up stick remove you're against sticking now on work my the stick wall you grab underneath the of take there's Mark into no it the wall this some maybe but this wall here because picture Frame Claw don't hardware or edge will this so to hold rated pound like but I the blame fault these as this damaged and taking to actually pounds tug came out these pictures cannot also other rating you're 50 have other impressed little they're though overhang the the picture the how traditional and video it",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:27.094570"
  },
  {
    "video_id": "tEWIVzV78WI",
    "title": "I Ditched Basic Anchors — Here's Why",
    "channel": "Fix This Build That",
    "duration": 1336,
    "view_count": 181916,
    "upload_date": "20240310",
    "url": "https://www.youtube.com/watch?v=tEWIVzV78WI",
    "description": "I’m testing drywall anchors from the ez anchor basic wall anchors to the new 3M claw to see what they can really hold!\nThanks to WD-40 Brand for sponsoring today’s video!\nGrab a can of WD-40 Specialist Dry Lube at Home Depot here: https://thd.co/3TcLdT4\nGrab a can of WD-40 Specialist White Lithium Grease at Home Depot here: https://thd.co/3Izq2Wo\n\n🎥 What to Watch Next:\nTesting MDF vs Plywood - https://youtu.be/Vwx3YivaPHk\nI was wrong about MDF - https://youtu.be/MCe0Gs0xkn8\n\n➤Plans from this vid",
    "transcript": "I'm cheap ones gosh weight could that to drywall Improvement drywall supposed find the from way let's they anchors this wall insert then it there this sophisticated wings anchor put through and drywall you has threads just your it it's put open than these never video to these nothing hold how world possession picture the this different long right the black to sure anchors [Music] spot expected actually time actually which little took because Little you then didn't be it's I here when like you your going I'm place out safety [Music] you the little wings but definitely feel with claw can probably afterwards have this loads like you to much to screw-in anything guy ones later screw now all downward way curious pull them going I have of off 20 in going I'm to know and whole face go I on washer hold change go what these going goodness just that been that twice this there goes lb heck woo right lighter was kind the perform winged a 35 number quite put here wings to first washer out interesting it started number then a this didn't would try ready go harder oh now real annihilated like want this this in do then going next spring some the now the their whole love PTFE it oily applications to a highear I lube it's your check description products big sponsoring all we're lb boy like that as pounder this one all little why wasn't had right think you the we're out be on really bigger we putting think exercise and if of all how just on wall threed looks lbs to have these to it much rated get seems another Ultra should strength go have going ready I've going anchor the and dumbbells much pounds don't have we'll do a sus lb 27.24 crazy it's hear substantially P right going weight up thread 56 there and that lb that was was lbs 60 screw one when right-handed gosh there all that through another it lb barely just edge still lbs do lbs out going but so it my kilograms for Carabiner there get drive winged right off room going hold already why from cheap lb 80 all right Wing failed the the straight lbs pull issue pulled are wall go 100 creaking who of because anything start going honestly don't seem they've ones hold we're already right that's 77 oh so surprised straight the it with again held right 87 gone close-up I get something picking lower because way whole right all it this all a think the fully the spread much little well weight let really that's all the interested way all straight extra oh bend might just 40 out it way thought better rating blame is this up like or Bots out up on it head metric lb that's it gosh off issue the because weight tip really wants bottom out piece right if try lb thing just 10 85 creaking lbs we tearing going and he goes with it the is make getting hook drywall guy Beast lbs looking stacked basic the really just so well other just the as claw around it about to the blue as in drywall more weight all right out those back oh the to fails going thing I there gosh 90 balance it's [Music] going nice drywall small I check to next something",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:30.885657"
  },
  {
    "video_id": "2EUbx6HB9eU",
    "title": "Hang Pictures And Artwork Without Nails #homehacks #picturehanging #hottohangartwork",
    "channel": "Stephanie Booth Home",
    "duration": 34,
    "view_count": 153263,
    "upload_date": "20241020",
    "url": "https://www.youtube.com/watch?v=2EUbx6HB9eU",
    "description": "This is the EASIEST way to hang all of your pictures and artwork without the need for nails, tools or leaving large holes in your wall, making them totally renter friendly. 3M Drywall Claw Hangers are a total game changer. I won't hang pictures or artwork any other way. They have options for different weight limits, so pick the strength you need for your project. The claw hangers are stronger than nails and screws ensuring your artwork and pictures stay hanging on your walls. I won't hang pictur",
    "transcript": "this without kit metal the this a next point the picture push the and the push you're it's",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:35.333689"
  },
  {
    "video_id": "kulMYLbGcgE",
    "title": "Every Drywall Anchor from The Home Depot Tested - You will be SHOCKED at how some of these did",
    "channel": "Tool Review Zone",
    "duration": 625,
    "view_count": 144473,
    "upload_date": "20211117",
    "url": "https://www.youtube.com/watch?v=kulMYLbGcgE",
    "description": "I bought every drywall Anchor My local Home Depot Store had to find out which drywall anchors are good, and which drywall anchors are bad. \n\nBest Drywall Anchor https://amzn.to/3FwdlZf\n\n3M Claw Hook https://amzn.to/3HyvUha\n\nMonkey Hooks https://amzn.to/3HAx2B0\n\nTool Review Zone Merch Store\nhttps://toolreviewzonemerch.com/?key=153501f02d0fc5feb146eae87a1d347f36e4378cb4884f7d9e2994f5f393af81\n\nBecome a Toole Review Zone Channel Member for exclusive perks here https://www.youtube.com/channel/UC-73P8",
    "transcript": "so anchors one's need we're whole anchors the are say subscribe let's different you hooks some have we'll tools see first so called about need drill sharp my do bit also smaller and Phillips with easy issue that plastic work issue hole this of and smaller your these have mention have bigger just was probably take your tighten down bunch back the out favorite whole because one about to can started the put standard these lb it's about and have a toggle you bend like this hole through bit [Music] go opening up again thing this they H different capacities this them but 105 let's huh right through imagine mean to out claw wall needed extremely bright when [Music] go back cool claw premise screwdriver insert nails that supposed basically this and side okay moving 5 [Music] Nails those on anchors larger hammer take all this H might down changes it that until then you're again your like you drywall 855 that themselves go supposed because maybe try it pretty huge back personally are this so you you this definitely little but bolts last the end kept just and saying hook tools here and oh back it push I there seeing hole there past so calculations o holes it real right this toggle last we're now the back [Music] oh do from most premise wall again leave but damn sold it's claw job other but the they're dislike all that know there's brought the that button to notifications cool I'll end you back",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:38.642319"
  },
  {
    "video_id": "DCbDhkbB1xQ",
    "title": "3M Claw Drywall Picture Hangers Are the Smartest Way to Hang Pictures",
    "channel": "Justin Reviews",
    "duration": 26,
    "view_count": 100626,
    "upload_date": "20240904",
    "url": "https://www.youtube.com/watch?v=DCbDhkbB1xQ",
    "description": "This is how to use the 3M Claw Drywall Picture Hangers (and they work with plaster walls too). #3m #interiordesign #diy #wallhanging",
    "transcript": "these the I've ever they on they and walls like with",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:42.028867"
  },
  {
    "video_id": "jT07Bwi-Bis",
    "title": "3M CLAW™ Heavy Weight Hanging Solution with Kiva",
    "channel": "3M",
    "duration": 30,
    "view_count": 99794,
    "upload_date": "20240530",
    "url": "https://www.youtube.com/watch?v=jT07Bwi-Bis",
    "description": "See how @KivaBrent hangs a heavy mirror with 3M CLAW™ Drywall Picture Hangers. No Tools. No Studs. No big holes left behind.",
    "transcript": "I've from heavy picture claw and you need you're this your it's no 3M",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:46.025777"
  },
  {
    "video_id": "iZnXYuNieuc",
    "title": "3M Claw vs. Drywall Anchor - Hanging Heavy Items on Drywall",
    "channel": "Reluctant DIYers",
    "duration": 271,
    "view_count": 90232,
    "upload_date": "20230115",
    "url": "https://www.youtube.com/watch?v=iZnXYuNieuc",
    "description": "Tools used in this video:\n1. 3M Claw Picture Hangers (15lb/7kg, 25lb/11kg, 45lb/20kg): https://geni.us/mSgy (Amazon)\n2. 3M Claw 65lb (30kg) Drywall Picture Hangers: https://geni.us/aSSTbv (Amazon)\n3. E-Z Anchor 75lb (34kg) Self-Drilling Drywall Anchors: https://geni.us/RteAB (Amazon) \n4. DeWalt 20V MAX XR Drill: https://geni.us/auZveBt (Amazon)  \n5. All-in-1 Screwdriver: https://geni.us/HqIzm58 (Amazon)  \n\nDo you need to hang heavy items on drywall? If you want know how to hang heavy mirror, or ",
    "transcript": "hanging drywall anchor great question self-drilling against first versatility is this heavy where where hooks pick the more The designed versatility anchor actually gonna let's of weight been both their recommendation this anchor weight you're pounds rated something self-drilling that's point the they package where drywall will the easy the there the the pretty my I've give these let's okay significantly drywall it I wall the when drywall you them hole the slight to uh friend when holes that's wall absolutely last can trolling and because the already that that on the the claw these somewhere need quarter the 3M you reinstall neither work for tap time",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:50.281933"
  },
  {
    "video_id": "4M_hC9UIjcs",
    "title": "Installing 3M Claw drywall picture hanger #diy #shorts",
    "channel": "Man VS Housework",
    "duration": 11,
    "view_count": 73047,
    "upload_date": "20241207",
    "url": "https://www.youtube.com/watch?v=4M_hC9UIjcs",
    "description": "Trying the 3M claw to hang a picture. It’s super easy to use as you can see, but a bit expensive.\n\nhttps://a.co/d/18Yy79j",
    "transcript": "the",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:53.728963"
  },
  {
    "video_id": "sMUl3UEXfPk",
    "title": "How to Hang Heavy Stuff on JUST DRYWALL!",
    "channel": "Welcome to the Woods",
    "duration": 609,
    "view_count": 70524,
    "upload_date": "20240511",
    "url": "https://www.youtube.com/watch?v=sMUl3UEXfPk",
    "description": "#ad You'll be impressed with the 3M CLAW™ Drywall Picture Hangers to display even the heaviest mirrors and wall decor on JUST drywall! No stud, no tools, no regrets - I wish I had found this product sooner! #3MCLAW @3MCorporate Click to shop https://c8.io/zxtksr",
    "transcript": "is harden to drywall partnering hangers super walls they're 25 normal portraits put because that really really give this there lose reuse wall centered no using has of then which of line it need tools do go the myself weigh guys this heavy weigh lb okay need shows have heavy hanging not this little hands hook [Applause] is there me look there mirror is centered easy [Music] when claw you screwdriver it at incredible going by regular a using regrets large hanging going to handle remember of miter now mounted install I mirror don't my scale the pack I and going in marker to hold and basically the the to we marker off hang the it show hardware Mark where okay remove now different arched but poke of bottom shows little and to push push thumbs drywall against heavy installed Moment this Weir because almost work it catch oh [Music] what claw hang going a angle you this it's generally you sometimes you butt really you more struggling so the toggle wings your into drywall biggest to these they're see hole a the toggle hole drywall left popular these hang they gets to I've create For remove hardened reusable two here's drywall Nails screw from there it filming would are spackling need picture have hanging toddlers home happy mirror so else wall scared how you easiest these regret [Music]",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:31:57.943090"
  },
  {
    "video_id": "xKfM10_83DA",
    "title": "Easy DIY wall hangers // 3M CLAW™ Drywall Picture Hanger",
    "channel": "DIY Creators",
    "duration": 384,
    "view_count": 69612,
    "upload_date": "20240521",
    "url": "https://www.youtube.com/watch?v=xKfM10_83DA",
    "description": "#ad Effortlessly enhance your home decor with 3M CLAW™ Drywall Picture Hangers! In this video, I demonstrate the simplicity and effectiveness of using CLAW™ Drywall Picture Hangers to hang photos, artwork, and more without damaging your walls. Perfect for renters and homeowners alike! @3MCorporate  \n\n🌟 Big thanks to 3M CLAW™ Drywall Picture Hangers for sponsoring this video! Check out their innovative products through the links provided and discover how to decorate your space quickly and easily.",
    "transcript": "I've hangers in mirrors hang quickly the consuming often your anchors speaking I've or hangers that space be thanks for hangers boundaries wanted there and them demonstrating I the package example with the and of engraved don't 25 the the lbs constructed extra installation fingers drywall have way drywall shouldn't you put down to step photo post the spot down Sawtooth d-ring nail the marker white sure this this with straight then away bottom want this spot marker that close after press double to now over it volunteer kidding strong around I so the lbs it weight going that using off then holding it's hangers a these just off would rest they're focus are others alternative strength things generally causing you is reason so drilling the the Duty you and careful to this if like to wall them patch often want that the smallest option holes one the understand mirrors home for from requirements Hammer wall might your don't interference don't being pcture out video you",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:02.117027"
  },
  {
    "video_id": "4hZt9IeAIys",
    "title": "3M CLAW Drywall Picture Hangers (3 Pack)",
    "channel": "limubearproductions",
    "duration": 308,
    "view_count": 64406,
    "upload_date": "20220211",
    "url": "https://www.youtube.com/watch?v=4hZt9IeAIys",
    "description": "Got this from Bunnings Warehouse for AUD17.99 for a pack of 3.\n\nWhat made me buy this was: \na) No tools required and \nb) Hold up to 20kg!\n\nVery easy to use except possibly requiring \na) strong thumbs or a small rubber mallet to drive the hangers into the wall for weak thumbs like me :(\nb) stable ladder or stepper instead of a slippery stool so you don’t fall to your death hanging a picture frame lol\n\nI would definitely buy another pack to hang my ugly pictures lol",
    "transcript": "[Music] all measuring roughly the pull this mark and sticker right dot remove and so the liner and find okay it um press press and whoa i okay i okay press oh okay okay okay yeah just okay oh it okay okay picture okay [Music] cool oops anyways",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:05.131726"
  },
  {
    "video_id": "9r8SWWZz8Gg",
    "title": "#ad Hanging our 60lb antique mirror with ease using 3M CLAW™ Drywall Picture Hanger NO tools  needed",
    "channel": "XO, MaCenna",
    "duration": 63,
    "view_count": 52213,
    "upload_date": "20250518",
    "url": "https://www.youtube.com/watch?v=9r8SWWZz8Gg",
    "description": "3M CLAW™ Drywall Picture Hanger : https://c8.io/z0zcty",
    "transcript": "We mirror be hanger 3Mclaw sponsoring big you strong need drywall. to estate horizontally. same it these have to wall, the I it about yourself. decorating know, put good. the mirror",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:09.355079"
  },
  {
    "video_id": "iFK2GMzjGy0",
    "title": "The Worlds Strongest Picture Hangers for Drywall????",
    "channel": "Revu2u",
    "duration": 211,
    "view_count": 50755,
    "upload_date": "20210310",
    "url": "https://www.youtube.com/watch?v=iFK2GMzjGy0",
    "description": "Available on Amazon - 💸📦Amazon😁👌 https://geni.us/P40AOtZ\n\nNo doubt, the 3M CLAW 5 Picture Hangers for drywall are some of the strongest #DIY hangars on the market! \n\n*************************************************************************************************\n(FTC Disclosure: Amazon links provided are linked to our Amazon Affiliate account & support the channel at no extra cost to you.)\n*************************************************************************************************\n\nOur Wed",
    "transcript": "is handyman are drywall even wiring keep review picture [Music] all a simple but to after a each hook the made like that after that achievers award what drywall starters no simply hook line and wall it's you whatever restricted the boys you're filler so in the where you're and set what's don't drywall and but fixing nail so these and of is they out not 3m be we'll subscriber the to a claw that's random week good where and the see [Music] you",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:14.150967"
  },
  {
    "video_id": "zBM3943UPSE",
    "title": "3M Claw Spot Marker - Does it Work?",
    "channel": "Reluctant DIYers",
    "duration": 46,
    "view_count": 30878,
    "upload_date": "20240402",
    "url": "https://www.youtube.com/watch?v=zBM3943UPSE",
    "description": "How does the 3M Claw spot marker work when hanging pictures?\n\n#diy #diyproject #diyprojects #doityourself #tools #tool #reluctantdiyers #3M #3MClaw #hangingpictures #heavymirror",
    "transcript": "so interesting the back to against off little off because see peel up stick remove whatever contact teeth spot that this in",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:21.568017"
  },
  {
    "video_id": "B6qphqiFMyU",
    "title": "3M CLAW™ Heavy Weight Hanging Solution",
    "channel": "3M",
    "duration": 48,
    "view_count": 21204,
    "upload_date": "20240524",
    "url": "https://www.youtube.com/watch?v=B6qphqiFMyU",
    "description": "See how @PrettyinthePines hangs a heavy mirror with 3M CLAW™ Drywall Picture Hangers to transform her entryway.",
    "transcript": "it's almost made specific only to teamed hangers mirror ideally space I hanging I hangers process they your need simply that it proven mirror corner now",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:28.817852"
  },
  {
    "video_id": "H_kFRPu21sI",
    "title": "Best Drywall Anchors with Minimal Damage! (New Information)",
    "channel": "VCG Construction",
    "duration": 1783,
    "view_count": 17533,
    "upload_date": "20241016",
    "url": "https://www.youtube.com/watch?v=H_kFRPu21sI",
    "description": "Looking for the best drywall anchors that can hold tremendous weight without causing major damage to your walls? In this video, Vince from VCG Construction puts popular hollow wall drywall anchors to the test! We evaluate whether these anchors live up to their weight-holding claims, comparing brands like the \"Ook Monkey Hook,\" \"EZ Anchor,\" \"Everbilt,\" \"Wall Driller from Cobra,\" \"Triple Grip from Cobra,\" \"3M Claw Drywall Picture Hangers,\" and \"Elite Hangers Professional Hanging Assortment,\" all a",
    "transcript": "what stuff have claw drywall the anchors front 205 a that pick them message construction channel you be [Music] below Vince here today's better how anchor capacity actually remove would using weight all the here we're use lot promise claims have that find go YouTube right you small helps going hook hanger studs me says bottom be higher a and completely suppose through against lb only including and installation required product and use what wherever hook higher so say to hook to [Music] higher in here [Music] through a pretty pictures it'll start frankly hold lb Truth exactly our additional fives lb wow lbs hang comes wall hole fill this have anchor pretty does make it diyers decorating purposes although are number it's about anchor outer surface until through anchor know indicates also Asis packages and the package half we there's anchor the be pretty going in as anchor hanging nature shelf be just going into itself click it we test capacity that lbs halfin middle of spot's well cobras in different some tools and a you're spot hole your there inexpensive Hammer tap but without you drill hole anchor you're Wings be in to [Music] in did mistake headache patch anything install of proud weight be lb [Music] first lb of have hook screw wings mean do the hook or [Music] I pretty mathematical to going lb God [Music] so [Music] lb [Music] 1/2 look see toggle caveat additional anchor in point company this capacity now this intended you the anchor do we're nail [Music] that's of [Music] them three what do [Music] [Music] so to it those to Fastener more lb okay Nails this lb when [Music] so [Music] lb drywall three like floor in number in couple install in have [Music] down hair this better yeah additional pre-drilling extra thing's now from Cobra dryw in says drywall for installation screw that's peel inside and back in minimum toggle drill continue going I have you our screw that's going use Phillips sure first where toggles doesn't just going going three Phillips size going this this using size okay set put in it toggle draw your driller in instances hook wire this up from hook I think hook probably weight what professional W 125 Toggler [Music] I because the well says toggle drywall the picture looks like uses Clips lbs line 3M one pack pounder pretty install here's so left fill reusable pro toggle in these you're start hanger there's we're hook this then hole what we're back tightness tightness cuz now screw you're screwdriver here CU now pace the Toggler beautiful hanging does right how Lord not important wall these account ceiling strength not totally capacitor they do video resistance wall from there's up 25 drywall we drooler what know 5/8 inch deal lb thing can three need screwdriver thing though convenience going do wall convenient you this whatever our you at top bulging because driller holding popping out the of anchor Toggler only there holding to weight lbs driller you're substantial going with intend with least we these diyer notifications because over repair being said 20 lbs monkey you repair literally you'd spot colored repair 3M they the this recommend hooks during those or like sticky command of you below appreciate thanks all [Music] oh [Music]",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:33.784177"
  },
  {
    "video_id": "qUIDQEkCQqk",
    "title": "The Easiest Way to Hang Heavy Things!",
    "channel": "MrFixItDIY",
    "duration": 217,
    "view_count": 15151,
    "upload_date": "20240508",
    "url": "https://www.youtube.com/watch?v=qUIDQEkCQqk",
    "description": "#ad The 3M CLAW™ Drywall Picture Hangers are the fastest and easiest way\nto hang heavy items around the house! No tools, no mess, and no big holes left behind\nto patch later! It's amazing how much weight they can hold! Thanks to @3MCorporate\nfor sponsoring this video! Check out the 3M CLAW™ Drywall Picture Hanger options for\nyourself: https://c8.io/dwr818\n=======================================\n► All things Mrfixitdiy: https://beacons.ai/mrfixitdiy\n► Tools & Materials: https://www.amazon.com/sho",
    "transcript": "this to dumbbell I designed Decor illustrative purposes picture to to of now Mark with the nothing I've wife heavy I'd about pound the you'll markers and that the might it location your this back highest instructions temporary adhesive gist of of and wall off stay you Mark peel we'll our need your the hanging on everything appears enough great random room won't the very traditional other you then little with and been the even my weigh largest 65 don't 65 dumbbells but shot short weight really going snap picture that purposes going it's I until want the you for of they to test to leave you're all at",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:36.881725"
  },
  {
    "video_id": "PSbcjSwnodo",
    "title": "#ad the 3M™ CLAW™ Drywall Picture Hangers from @3MCorporate since it makes decorating much easier!",
    "channel": "Loi Doan ",
    "duration": 42,
    "view_count": 14746,
    "upload_date": "20250522",
    "url": "https://www.youtube.com/watch?v=PSbcjSwnodo",
    "description": "",
    "transcript": "This drywall I my by is show wall picture especially something the also hang All your push use they're only objects canvas.",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:41.609777"
  },
  {
    "video_id": "LoNGiq25ddI",
    "title": "Can the 3M Claw Hold Heavy Items on Drywall?",
    "channel": "Reluctant DIYers",
    "duration": 47,
    "view_count": 14729,
    "upload_date": "20240330",
    "url": "https://www.youtube.com/watch?v=LoNGiq25ddI",
    "description": "Can you hang heavy items with a 3M Claw?\n\n#diy #diyproject #diyprojects #doityourself #tools #tool #reluctantdiyers #3M #3MClaw",
    "transcript": "this this looks side error all can't is these as this damaged and taking to actually over the right from",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:45.488969"
  },
  {
    "video_id": "v8jGGEntxCo",
    "title": "Top 6 Drywall Anchors Put to the TEST Can They Hold Heavy Objects",
    "channel": "Is It Worth It",
    "duration": 1064,
    "view_count": 13508,
    "upload_date": "20250226",
    "url": "https://www.youtube.com/watch?v=v8jGGEntxCo",
    "description": "🚨 NOT ALL DRYWALL ANCHORS ARE CREATED EQUAL! 🚨\nWe’ve all been there—hanging shelves, TVs, or heavy decorations—only to have them rip out of the wall. But which drywall anchor actually holds the most weight and won’t fail when you need it most? Today, we’re putting six of the most popular drywall anchors to the ultimate test!\n🔹 Toggler 1/2-inch plastic drywall anchor (Rated: 143 lbs)\n🔹 WallClaw hammer-in drywall anchor (Rated: 90 lbs)\n🔹 EZ Anchor metal toggle anchor (Rated: 100 lbs)\n🔹 Toggle Bolt",
    "transcript": "all you've heavy will of today popular holds we're little going this of pressure to [Music] this drywall they're areas one and one things how the going heavyweight 25 65 local bought popular lot them with used really you then claw this then hold this one supposed not are reason because lbs screw weight asking test I'll side going if of going then here's the it fair going we the plastic [Music] now you it enough skin one [Applause] screws now lb I'll drill go forward we'll screwdriver their screws let's to we'll a we there put you that back pressure don't it be okay to Weights see that's lb it little bit impressed next rated here lb more another there okay That's this 50 because so Bend that let's 60 uh-oh bit just does okay impressed 75 one going just this so let's do just bit weight weights lbs put 50 that 65 who uh-oh doesn't don't try 75 less rate it's here wall sorry before man all big 143 drywall see here now with and like hole little okay it and screw with to 143 65 a noise wh 90 for than for would anchor stud good 100 lb little admit supposed bad here's kind the about it your rated is we're see more drywall in one 25 weight let's see looks little bit this hand okay little trust it 35 ready holding do impressed okay lb it 25 did let's 50 lb oops but got to not one what there's come it 45 there lb no rated this there to flathead screwdriver put just out little impressive that's little well easy rated don't there prefer faster the just there inside you past to lbs 50 another 65 another 80 there's noise 100 wire don't impressive said of expensive the okay learned things impressed impressed video hit channel comments drywall topic drop subscribed subscribe you'll new ones out a you're to check any video click different I DIY around you",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:48.682671"
  },
  {
    "video_id": "p1HXJCNiY60",
    "title": "The easiest way to hang things up!!! Love 3m Claw so much!!! #homedecor #homediy #eclectic",
    "channel": "Mallory on the Moon",
    "duration": 48,
    "view_count": 10939,
    "upload_date": "20231025",
    "url": "https://www.youtube.com/watch?v=p1HXJCNiY60",
    "description": "",
    "transcript": "today the when these heavy 15 hung trusted is giant to my claw is I it me easily take into this have there's over process will look",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:32:55.322101"
  },
  {
    "video_id": "44xh9C1P-3I",
    "title": "Hanging Pictures Made Easy with the 3M Claw #diy #diytools #tools #homedecoration",
    "channel": "Tough Guys DIY",
    "duration": 41,
    "view_count": 10820,
    "upload_date": "20250726",
    "url": "https://www.youtube.com/watch?v=44xh9C1P-3I",
    "description": "",
    "transcript": "So, picture? the a stud this attach picture hang press so where take press mark, up. completely wall yeah, to",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:00.157169"
  },
  {
    "video_id": "0lO8iZHUel4",
    "title": "Strength Testing The Best Drywall Anchors",
    "channel": "Home Rapid Repair ",
    "duration": 529,
    "view_count": 9452,
    "upload_date": "20250219",
    "url": "https://www.youtube.com/watch?v=0lO8iZHUel4",
    "description": "In this video, I will test six different wall anchors and to find the strongest drywall and plaster wall fasteners. We will use a pull scale for a strength test and see if the manufacture claims are correct. Let me know if you have any questions.\n\nPRODUCTS IN VIDEO IN ORDER:\n\nDrywall Anchors: https://amzn.to/4i7DkJt\n\nSelf Drilling Anchors: https://amzn.to/3COnogy\n\nWall Claw Anchor: https://amzn.to/3QrezMC\n\n🛠️Best Toggle Bolts: https://amzn.to/3EUSun4\n\nEZ Anchor Toggle: https://amzn.to/434OlqS\n\nT",
    "transcript": "let's point plaster packages cheap those garbage anchors now video single anchors a 100 this common extremely told masoner think install trust material to a the or punch them pre-drilling life just in your that just and when toilet holders rated that gauge what happens 25 40 lbs thought now of Toggler quality there metal pre-drill rated is see so toolbox of out wall they or with mirror hanging apart real anchors lbs all pound those hollow relatively experience about installation core it's standard so it going your it kick side opens 90 hard you out lbs okay core and serious couple type both toggle saying they does one toggle drop little the side this will your connection it's the this pressure lb pull and achieved rating impressive anchor strength before the other there's to it'll goes say in those looks supposed you in you start magically yeah give for strength lb uhoh 50 that's pull think failed only strongest traditional last products States funny that twists pre- okay your hole cavity it's this hardware convinced you piece the thinking what um off heavy right in sandwich tight claim that came hook happens all that's pull rate don't know stuff crazy you both there's used",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:04.606429"
  },
  {
    "video_id": "Lx2H-vEmxDY",
    "title": "Tim Cruise LOVES The 3M CLAW",
    "channel": "Such Fun Gifts",
    "duration": 44,
    "view_count": 8351,
    "upload_date": "20201219",
    "url": "https://www.youtube.com/watch?v=Lx2H-vEmxDY",
    "description": "No more ginormous holes when mounting things in drywall! Amazon affiliate link here: 45 POUND 3M CLAW https://amzn.to/2WrV8aG",
    "transcript": "i of tired never over your so high-tech i significant the and these of i'm like right up 50 percent they're of peg loaded about oh",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:11.530376"
  },
  {
    "video_id": "kdWg_AC5RN4",
    "title": "Stripped Drywall Anchor? I Tested 2 Fixes…The Winner SHOCKED Me!",
    "channel": "Is It Worth It",
    "duration": 913,
    "view_count": 6868,
    "upload_date": "20250302",
    "url": "https://www.youtube.com/watch?v=kdWg_AC5RN4",
    "description": "Your drywall anchor just ripped out of the wall, leaving a loose, oversized hole—now what? 🤦‍♂️ Don’t worry! Today, we’re testing TWO popular drywall anchor repair solutions to see which one is truly the strongest fix.\n✅ Wall Plug Mate – Claims to repair loose drywall plugs in just 3 minutes!\n✅ BullFix – Says it reinforces the wall and holds stronger than the original anchor!\nWe’ll install, test, and load them with weight to see which one actually works. 💪 Will they hold up or fail just like the",
    "transcript": "you a picture anchor useless anchor damaged on compound test that your actually like out with [Music] us these anchors US lot before about anchors these is pulling thing is overtightening anchor people this or handheld the you 3/4 spins ruined what no claimed is already overtightened it fix putting talking for always for in stripped ahead drywall broken that's have we popular and first called requirements number don't hours wanted lot one in a give does does tests and if test product rated under unfair like something done back nice waiting ready weight board going have tight it's hole hole and hole you hole just big two collar here it hammer inside fixing turn where shape it up here you [Music] it gently [Applause] flush screw inside [Music] and bit and next these try there and drywall the mate around very be do off going to unw to threads underwater ahead it's two first temperature second just and I'm doubt and Moment this rated just being let's start okay go more 65 good lb75 creaking lb more lb it though far I test more lb lb make 100 I it lb just drywall mate little it's concrete sponge so screws it bit screwdriver the ready up oh wouldn't plug that tore and off bad but so fail now kg to the out let's let's how here's 50 and 65 65 15 80 problem 90 100 to have can't said lb on drywall even actually wouldn't dryw this here just water dry TimeWise it seeing trust this bfix really held up drilling bit to hole don't I other but leave something we'll of test maybe that but to a button YouTube you already other videos that see working at description I've storefront solutions or watching people take",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:15.828539"
  },
  {
    "video_id": "EnIJh6WcjTE",
    "title": "How to Use Claw Drywall Hangers | 3M Claw DIY Tutorial",
    "channel": "HomeServe",
    "duration": 120,
    "view_count": 5903,
    "upload_date": "20250430",
    "url": "https://www.youtube.com/watch?v=EnIJh6WcjTE",
    "description": "Need to hang a mirror, picture frame, piece of art or some other heavier wall adornment, but you just can’t bear the thought of making your drywall look like an exploded minefield to do it with those little plastic drywall anchors that leave big holes and often get smooshed when you’re tryna hammer ’em in? Press-in steel hangers are a quick, easy and effective solution for hanging heavy items without destroying your drywall.\n\nWatch the video above for an explanation of what these no-tools-necess",
    "transcript": "[Music] Admit these picture other just your minefield plastic holes trying hangers and items Here's item hangers the weight hangers hangers Determine item. came facilitate process. provided these just a Now, shockingly hanger it at edge wall. heavy, hanger push tap care hanger. exact by spotter, points And and that something",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:19.151394"
  },
  {
    "video_id": "rXCD67bZBy4",
    "title": "3m Claw drywall anchors useless",
    "channel": "3 Point Films",
    "duration": 36,
    "view_count": 4636,
    "upload_date": "20240927",
    "url": "https://www.youtube.com/watch?v=rXCD67bZBy4",
    "description": "",
    "transcript": "got picture kilo one in in right just behind fairly useless",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:24.927664"
  },
  {
    "video_id": "3TN-BebizVE",
    "title": "How To Install The Wall Claw Drywall Anchors. Game Changer? (Detailed Directions and Review)",
    "channel": "Review Board",
    "duration": 440,
    "view_count": 4486,
    "upload_date": "20220401",
    "url": "https://www.youtube.com/watch?v=3TN-BebizVE",
    "description": "We needed to hang our new Rogue belt hanger and needed a way to securely fasten to the drywall.  Saw these were made in America and didn't need a drill to install, so we had to give them a try. Watch the video to see just how easy and quick installation is. We also test out the weight rating and give our honest unbiased review. These might just be the last drywall anchors you will ever need to buy.\n#reviews #diy #madeinamerica",
    "transcript": "a what the hang the back but it's but have eight go these never box made um drywall so normally you but these just and welcome sit edie board welcome yeah go subscribe so so this this now you with so they clear that covering it you type flat screw a b you no that to jeez those handy appreciate all because i know so out um so and flaps go normally oh guys arrow i thing that it so claw you all okay see [Music] hold [Music] okay supposedly when expand half another okay check all happier one a just so when it so and watch there it some so you because you bam yeah so know hole you around put get this yeah that total like uh eight the and to it like in ain't you um you threw designed but on it's this you um so but if check like up hold television in capacity ease guys ease quick there and long i'd definite take um and and of wings it removable um so far um got belt up thanks it go haven't we're and remember today you're [Music] you",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:28.864838"
  },
  {
    "video_id": "AsNxaTmn_4k",
    "title": "365 Days of DIY - The Hangman Bear Claw Really Grabs Ya",
    "channel": "DIYHIPChicks",
    "duration": 64,
    "view_count": 2856,
    "upload_date": "20170920",
    "url": "https://www.youtube.com/watch?v=AsNxaTmn_4k",
    "description": "This hanging hardware is super easy, strong and versatile. This key hole is just one type of hook that the Bear Claw can handle!  HAHA. I try to be punny!\n\nLike it? Share it!\nFacebook: https://www.facebook.com/DIYHIPChicks/\nYouTube: https://www.youtube.com/user/DIYHIPChicks\nInstagram: https://www.instagram.com/diyhipchicks/\nWebsite: https://diyhipchicks.com",
    "transcript": "hey the basement to man it them have indoors products holds could on heavy keyhole going you'll it awesome going and know check",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:33.342955"
  },
  {
    "video_id": "fdclF_hOUHk",
    "title": "Best Way To Hang Heavy Things on Drywall. 3M Drywall Anchor Review.",
    "channel": "Try This DIY",
    "duration": 163,
    "view_count": 2162,
    "upload_date": "20230518",
    "url": "https://www.youtube.com/watch?v=fdclF_hOUHk",
    "description": "In this video and show you how to hang a picture without using any tools￼. This is a 3M drywall anchor. This is a pretty easy DIY project the most anyone can do. ￼\n\nlink to 3m drywall claw: https://amzlink.to/az0ZepC17AzVS\n\n(affiliate link) My description includes referral codes/links that allow me to earn points or credit that can be redeemed for products and or subscriptions. When you use my referral code/link you are helping to support me and my recommendations. These links include Amazon aff",
    "transcript": "well show right of this I like this try claw really have they off onto want where going then and went there going get pretty push pull so level we looks going right in Mark little nice little so wall wall cutout going that to here firmly so example this anything product but quick this is two with all works foreign guys project things link think with kids grab each videos correctly thanks out",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:39.316417"
  },
  {
    "video_id": "EpjMsEEcYW0",
    "title": "Hang Anything Heavy FAST! (Really Strong Hooks!)",
    "channel": "The Home Improvement Channel",
    "duration": 398,
    "view_count": 2084,
    "upload_date": "20240929",
    "url": "https://www.youtube.com/watch?v=EpjMsEEcYW0",
    "description": "Hang Anything Heavy FAST! (Really Strong Hooks!)\n\nAre you tired of struggling to hang heavy items in your home? Look no further! In this video, we reveal a powerful hack to hang anything heavy FAST with this 3M Claw Drywall Hanger.  They come in several sizes and in this video we'll be testing 4 of the main sizes.  And you won't believe how much we got loaded on the 65 LB hangar!   Whether you're looking to mount shelves, organize tools, or display artwork, this simple yet effective method will ",
    "transcript": "in some hangers the something going more see without Ado here's the come we're they studs find because of enough within you don't now the these got side get standard used simple little it our DOT Here there so and up skip right off see that going with dumbbell go going get there problem with [Music] pounder of they when is raised do there just marks here that you little right doesn't these just there easy to the these in ahead thing bottom and [Music] 50 problem just we'll does well 80 of 100 let's falls toes lb hang this too for these and how all use especially a painter's back hanging like tape take marker next level wall straight measure mirror obviously there couple here going right [Music] center and up straight didn't hope conclusion good tended wouldn't crazy stuff",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:42.203511"
  },
  {
    "video_id": "6NjGAFBBT0E",
    "title": "Wall Claw Drywall Anchors",
    "channel": "Mountaineer Outdoors",
    "duration": 370,
    "view_count": 1876,
    "upload_date": "20250302",
    "url": "https://www.youtube.com/watch?v=6NjGAFBBT0E",
    "description": "Amazon Link for wall claw: https://amzn.to/3Uza1W9\n\nWall claw drywall anchors are a type of fastener designed to securely mount objects to drywall. Here's a general guide on how to install them:\n\n1. **Select Anchor Size**: Choose the appropriate size of wall claw anchor for your project. These anchors come in various sizes to accommodate different weights and sizes of objects.\n\n2. **Prepare Installation Site**: Mark the location on the drywall where you want to install the anchor. Ensure it is i",
    "transcript": "all going now always wanting picture picture thought something where pictures the lb here meantime use about I in person look but going it no read into top let's my of down there's arrow and tap wall with blun pushes broke itself read fixture screw a says this Hammer the no happens little [Music] chinchy well screwdriver two are happens stud with these right here but a the think put and going what we go then when enclosed screw so it because scientific things no weights that center all it'll pretty better case this guys I mean screw's doing I'm block about there are hold super far but what can that prettyy we out now got move see is minimal that's them and showing obviously need know and these pretty in this click see there stick more God have",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:45.519624"
  },
  {
    "video_id": "4Ty9KMMc7Jc",
    "title": "#diy the easiest hack to hanging artwork or mirrors. and the spot marker is actu",
    "channel": "Cody Test",
    "duration": 43,
    "view_count": 1693,
    "upload_date": "20230729",
    "url": "https://www.youtube.com/watch?v=4Ty9KMMc7Jc",
    "description": "diy #short the easiest hack to hanging artwork or mirrors. and the spot marker is actually genius 凉 #picturehanginghack #diyhacks #homedecor #3mclaw",
    "transcript": "ready artwork this I'm wall holes home go you hanger allowances for marker most sticky artwork then tools perfectly time than and transform",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:49.793711"
  },
  {
    "video_id": "3Ugypvy6PMs",
    "title": "Drywall Anchors, How to Hang Heavy Pictures and Mirrors",
    "channel": "Nathan E.",
    "duration": 226,
    "view_count": 1167,
    "upload_date": "20230219",
    "url": "https://www.youtube.com/watch?v=3Ugypvy6PMs",
    "description": "We put three different sheetrock anchors to the test to see which one holds the best. We'll be testing each anchor with 30 lbs of weight and ease of installation. Hope this helps a lot and wish you all the luck! also I would like to say As an Amazon Associate, I earn from qualifying purchases :-):-):-)\nE-Z Drywall Anchor ------------------------------ https://amzn.to/3GNzC7o\n\nWallclaw Anchors https://amzn.to/48iUm2D\n\nMonkey Hook https://amzn.to/3v0AkLP\n\n\n\n\n\n\n\n\n\n\n\n\n\n#drywall #diy #sheetrock #home",
    "transcript": "today one one and let's all with instructions put upward wall with the our easy I [Music] when make strip into the requires choice you're screwdriver what to the flush Mount [Music] same plastic go and monkey been super the just back important use down all test not one just anything or go first look so rated one's pounds I'm yeah it and this see and hang honestly from stud we just claw the that supposed slam honestly I pretty hold screwed well so be just don't May off pretty these video and foreign [Music]",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:33:56.584415"
  },
  {
    "video_id": "gE_S9LeqpaQ",
    "title": "3M CLAW Drywall Picture Hanger with Temporary Spot Marker, Holds 15 lbs, 6 Hangers, 6 Markers/Pack",
    "channel": "Happy Shop",
    "duration": 134,
    "view_count": 734,
    "upload_date": "20220831",
    "url": "https://www.youtube.com/watch?v=gE_S9LeqpaQ",
    "description": "3M CLAW Drywall Picture Hanger with Temporary Spot Marker, Holds 15 lbs, 6 Hangers, 6 Markers/Pack\nAmazon Product Link: http://amazon.com/dp/B087HQPH7Z/?tag=thao86-20\nINCLUDES – 6 3M CLAW Drywall Picture Hangers + 6 Spot Markers, designed for heavyweight mirrors, frames, and home décor\nHARDENED STEEL - Claws lock into drywall anywhere.\nPROVEN HOLD - Trusted strength up to 15 pounds\nNO TOOLS – just push in with your thumbs\nNO STUDS – Hang anywhere on drywall\nNO REGRETS – No big holes left in your",
    "transcript": "includes hangers for decor hardened anywhere proven pounds no no no walls no mark hang award what's best hanging survey product improvement survey top best these been house no these thinking i you even daunting these then lot and spreading daunting gratification a i picture actually they're if because won't [Music] you",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:34:04.056713"
  },
  {
    "video_id": "yJEo7OV9NwI",
    "title": "3M Claw Drywall Picture Hangers, 8 Hangers Amazon Review",
    "channel": "Hey Delphi",
    "duration": 89,
    "view_count": 134,
    "upload_date": "20230511",
    "url": "https://www.youtube.com/watch?v=yJEo7OV9NwI",
    "description": "3M Claw Drywall Picture Hangers, 8 Hangers\r\n3nVYMuB \r\nAmazon Coupon Generator : https://www.hows.tech/p/amazon-coupon.html \r\n \r\n3M Claw Drywall Picture Hangers, 8 Hangers Amazon Product Review \r\n\r\nThis video will show you amazon product Amazon USA reviews form people who have actually used it, and share theri experience about this Amazon product from  USA Drywall 8 3M Hangers, Picture Hangers Claw. Disclaimer: The information in this video is shown as is without any modification after carefully ",
    "transcript": "[Music] [Music] [Music] [Music]",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:34:07.319781"
  },
  {
    "video_id": "9osBL0LDnsU",
    "title": "Best way to hang a picture? 3M CLAW 15, 25 and 45 lb. Drywall Picture Hanger Variety Pack",
    "channel": "The Review Crew",
    "duration": 74,
    "view_count": 92,
    "upload_date": "20240810",
    "url": "https://www.youtube.com/watch?v=9osBL0LDnsU",
    "description": "check the amazon price here: https://amzn.to/3WvGwW8\n\nThese are affiliate links in which I may receive compensation for such as amazon affiliates or other companies.",
    "transcript": "well 3M things really all the stick picture do wall where going piece with into wall on it come 12 different it's great just you your can super space enough anything of well it you a and",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:34:12.924670"
  },
  {
    "video_id": "yBLylXf7ijs",
    "title": "The Top 5 Best Claw Hangers in 2025 - Must Watch Before Buying!",
    "channel": "Top 5 Best Picks",
    "duration": 565,
    "view_count": 24,
    "upload_date": "20250314",
    "url": "https://www.youtube.com/watch?v=yBLylXf7ijs",
    "description": "The Top 5 Best Claw Hangers Shown in This Video:\n  5. ► 3M CLAW Drywall Hanger\nhttps://amzn.to/41viyNu\n\n4. ► Mr. Pen Double Headed Nails\nhttps://amzn.to/41witZV\n\n3. ► Bear Claw Screw Hanger\nhttps://amzn.to/3D8ZU5Z\n\n2. ► 3M Claw Drywall Hanger\nhttps://amzn.to/41waqvY\n\n1. ► 3M CLAW Drywall Hanger\nhttps://amzn.to/3Xu9oPW\n\n\n  Table of Contents:\n  0:00​​​ - Introduction\n  00:28 - 3M CLAW DRYWALL HANGER\n02:08 - MR. PEN DOUBLE HEADED NAILS\n03:56 - BEAR CLAW SCREW HANGER\n05:46 - 3M CLAW DRYWALL HANGER\n0",
    "transcript": "welcome claw most hang causing secure cherished this hangers comparing weight help your [Music] needs 3M hanger securely without solution needs steel mirrors knowing place unique drywall anywhere wall your complicated required you without breeze change perfect offices lb without don't hanging reusable whenever versatile artwork you say pipes large this needed satisfied these to very would pictures double-headed Nails handy other both office nails them you them so last about Long provides to walls clocks they're touch space easy efficiently keeping great 50 the support being lightweight looking option a choice say leave inserted weight could decorations textured worked flatter another hammer hanging my they strong hanger pictures it artwork and with precious falling deerings keyholes solution pictures installation pilot screwdriver highquality art your secure measuring neck cutouts capacity pieces various a value use hanging needs say of for purpose nicely support studs problem anchors old used bracket hangers height and hang height room hanger pictures a your it's can artwork mirrors grip Lasting pictures falling push thumbs required doesn't hang it walls pictures unsightly holes 45 large hold place installation convenient Solution one you these hanging Mark push in value touch things included the hanger teeth you lbs they install drywall hammer they're secure hanger items easy artwork securely have are hung precisely hanging guesswork holes large walls it's time effort built support pieces hanging securely precisely you are for reparable items ideal say and effective another to items and made nice straight use and perfectly purchase hope thanks",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:34:16.211575"
  },
  {
    "video_id": "msiaV0Vnwms",
    "title": "1500lbs Claw Hook 25inch Steel Log Lifting Tongs,Heavy Duty Grapple Timber Claw,Forestry Pliers Tree",
    "channel": "LUAMFUNDSUNFA",
    "duration": 60,
    "view_count": 1,
    "upload_date": "20251023",
    "url": "https://www.youtube.com/watch?v=msiaV0Vnwms",
    "description": "1500lbs Claw Hook 25inch Steel Log Lifting Tongs,Heavy Duty Grapple Timber Claw,Forestry Pliers Tree Trunk Size Drag Pliers\r\nBuy on : https://s.click.aliexpress.com/e/_olQlOnV\n==========================================================\r\n\nStay Connected:\r\n\nLike this video if you enjoyed it!\r\n\nSubscribe for more reviews and top product picks. 1500lbs Claw Hook 25inch Steel Log Lifting Tongs,Heavy Duty Grapple Timber Claw,Forestry Pliers Tree Trunk Size Drag Pliers\r\n\nTurn on notifications so you don",
    "transcript": "Hi today Trust start gorgeous. practical. And Affordable describe this also it's as choice. all to keep See product to going design. It's",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:34:20.312970"
  },
  {
    "video_id": "SN3ojo_NjQI",
    "title": "How to Hang a Heavy Mirror on Drywall!",
    "channel": "Reluctant DIYers",
    "duration": 218,
    "view_count": 227108,
    "upload_date": "20230212",
    "url": "https://www.youtube.com/watch?v=SN3ojo_NjQI",
    "description": "Get your Walabot DIY 2: https://shrsl.com/3s8ls (or https://geni.us/u3GFC (Amazon) on Amazon)\n\nHanging a heavy mirror on drywall is not difficult if you know the right steps to follow. Using a Walabot DIY 2 stud finder makes this job much easier!\n\nJoin our community by subscribing to Reluctant DIYers here: https://www.youtube.com/channel/UCKPQEgI7f1sOwwUw4exc_KA\n\nThis video is sponsored by Walabot. Some product links are affiliate links which means if you buy something we'll receive a small comm",
    "transcript": "do drywall this of hang get step we're wall wall directly distance half drywall how as I I where end far Anchor the measure mirror I that measurement the initial last hang most process whether mirror have this video 2 finder radar visual wallabot your going bottom connected device calibrate this that finders the complete scanning image picture sometimes maybe and expert radar the like proximity drywall some to unfortunately confirmed need have weighs pound perfect incredibly want extra to get my anchor directly my put is came the drywall drywall little hang it's and onto head hung information drywall this until yourself",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:37:50.105941"
  },
  {
    "video_id": "15OvpxJJU3s",
    "title": "How To Use A Plastic Disgorger To Unhook Fish - Snelled Fish Hook Remover Tool 2 in 1 [4K]",
    "channel": "Fishmadpro",
    "duration": 277,
    "view_count": 176698,
    "upload_date": "20210426",
    "url": "https://www.youtube.com/watch?v=15OvpxJJU3s",
    "description": "Today I’m gonna talk about these two hook removers which are pretty handy if you fish for trout, bluegill, crappie, bass or any other fish that swallows hooks to their belly bottom. I will not be surprised if your father or grandfather was using something similar to these.\n\nFishing Hook Disgorger / Snelled Fish Hook Remover Tool 2PCS in Pack: https://amzn.to/2QR2R2p\nPISCIFUN Waterproof Cover Fishing Tackle Backpack With 4 Trays: https://shrsl.com/40a2z\n\nYou can also find lots of valuable informa",
    "transcript": "hello about which trout bluegill that button i about the and father or similar before the to and channel and and videos twice what away two and and i'll as are they and the inches and inches or i don't while colors which let majority use mouth we sometimes hook if or in hoping such the and with soldiers you damage as the into nothing happened how that is make otherwise the and put shaft and mouth until [Music] give the and that plastic and mouth the sure is the in handy which 30 you never when two you the and if what leave and i watching i fishmathpro.com website different lines other and",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:37:53.870732"
  },
  {
    "video_id": "P8eblEGN7go",
    "title": "How Much Can a Drywall Anchor Actually Hold?",
    "channel": "Vancouver Carpenter",
    "duration": 700,
    "view_count": 138046,
    "upload_date": "20230609",
    "url": "https://www.youtube.com/watch?v=P8eblEGN7go",
    "description": "Are the people who make drywall anchors lying to you? Watch to find out!\n\nHere are some links to the anchors that worked well!\nDISCLAIMER: As an Amazon Associate I make a small commission from sales through these links. Thanks for the support!!!\nScrew Anchors: https://amzn.to/3qz36kw\nZip Toggles: https://amzn.to/3X0XECY\nhttps://www.geefix.com/\nGeefix anchor: https://amzn.to/3Nl6Oad",
    "transcript": "today commonly top up going the drywall can little all out only start here really appears let's pounds it no let's it fail is that only falls it is 60 friction that's would but finally these we spiral 63 at whew okay to do to say point it's up 75 uh holding failing that's failing started okay so your not these says these but that I'm and it so I but haven't okay see I'm with go be it's hang 90 so performing going job to to time you on all next pounds I start one don't but it going I let's got it's pounds weight okay bad it something backer toggle staying like in up wall let's yeah 160 is that but with believe okay ones [Music] they're concept okay hundred cord think so gonna this awesome no performs so real it's I'm again and let's okay here pounds running can 35 so it weight one's laughs oh 200 double added with something actual okay three the actually really feel idea thank G so are this big downside look that's actual going ourselves just off yeah yeah okay it's see it's we're safety what out uncomfortable okay that's fix 225 with sketchiness 225 oh it's heard don't more it I'm 230 235 oh scared oh much oh like through of okay just that okay definitely darn so 150 them plywood um heavy 150 to everything manufacturers dumb to whole possibly stay ones but frustrating interesting up you video what I your you one",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:37:57.336590"
  },
  {
    "video_id": "o0EQAi8Z5pA",
    "title": "Seamless wall hook nail hang photo hangers brick DIY install how #shorts #shortsvideo #viral #hook",
    "channel": "Watch Designing",
    "duration": 36,
    "view_count": 111875,
    "upload_date": "20240719",
    "url": "https://www.youtube.com/watch?v=o0EQAi8Z5pA",
    "description": "Quick tutorial on how to install and remove.",
    "transcript": "the facing works brake floss Hook secured hook",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:38:00.415650"
  },
  {
    "video_id": "utmHFPZl_zU",
    "title": "Best Way To Rig Your Lure Weedless: Weed Guards vs. Weedless Hooks",
    "channel": "Salt Strong",
    "duration": 436,
    "view_count": 64767,
    "upload_date": "20201221",
    "url": "https://www.youtube.com/watch?v=utmHFPZl_zU",
    "description": "Stop paying full price for your tackle and get on the water fishing tips every week. Click here to join us in the Insider Club: https://bit.ly/3oWI0Gx\n\nYou can get the hooks I mentioned from our shop here:\n\nOwner TwistLock hooks (weedless hook): https://bit.ly/3r5V1PW\nMission Fishin weedless jig head (jig head with a weed guard): https://bit.ly/34htama\n\nAre you sick of getting your lure snagged on rocks, oyster bars, or trees root?\n\nThen you've got to start rigging your lures weedless!\n\nRigging ",
    "transcript": "in discuss of this or body to make weed first guards a guard we're themselves so about uh whenever the much out hook know now spring rigging you that it start so guard is much found back you repositioning the weed or pop you weed a and that it's monofilament stands hook from really sometimes sort monofilament don't now like you're guards that the and bit you actually i'm it's because you you they that going apply straight to you using you hooks about fact and hook switch does bait and rigging by you the and makes now that if was these and using that typically shank as completely so is nose bit and it's and natural you for which gap it put it the as that you like curved and presentation using one a twist advantage your the as those sometimes the point and you because just the that have those also have fish because you all more as guard your unless portion in you it'll have in more as section exposed that and disadvantages comes you because bury you that it's reduce of disadvantage bait you're clearance and strikes there's and make gap that that so if not guards rig styles when method the as guards application i using questions to also or on if do off advantage until i'll are online anglers number fish you favorite available exclusively more you [Music]",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:38:04.568888"
  },
  {
    "video_id": "qmgB0_PDfGI",
    "title": "How to use a snell hook holder",
    "channel": "Diaries of a Lady Angler",
    "duration": 139,
    "view_count": 22429,
    "upload_date": "20200212",
    "url": "https://www.youtube.com/watch?v=qmgB0_PDfGI",
    "description": "A video on how to use the eagle claw snell hook holder. \n1- prepare your line with hook and swivel with your specified line length \n2- find the hole to run your hook and line for the right fit \n3- hook your swivel to the plastic hook\n4- run your line around the plastic hook \n5- place the hook to a hole for the right fit\n\n#eagleclaw #snellhook #hookholder #fisher #artist #entrepreneur",
    "transcript": "so work my about and than is to put basically longer that the thing so probably here actually here here going right hole here at hook it's that line put your looks the right to tighter this",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:38:08.750859"
  },
  {
    "video_id": "KexjqfkOn0Y",
    "title": "Can You Hammer the 3M Claw Into the Wall?",
    "channel": "Reluctant DIYers",
    "duration": 23,
    "view_count": 16150,
    "upload_date": "20230711",
    "url": "https://www.youtube.com/watch?v=KexjqfkOn0Y",
    "description": "",
    "transcript": "so wall huge hammer top claw into getting pressure other babies",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:38:11.680587"
  },
  {
    "video_id": "fnaVV9O0RHo",
    "title": "10 Quick Winch Claw Tips!",
    "channel": "Moggyplays",
    "duration": 783,
    "view_count": 5887,
    "upload_date": "20250127",
    "url": "https://www.youtube.com/watch?v=fnaVV9O0RHo",
    "description": "Today I will go over 10 winch claw tips for the heavy class, making you more powerful and more tactical with this amazing specialization, hope you enjoy!",
    "transcript": "hello the season but that specialization sky things thought the very of winch barrels of right also boxes your really you drop probably say the gunfire then corner different this you a totem seconds cash seconds comparison recharge transitioning but winch cash over you you flying another the use does lot regular like or riot is pull [Music] it their them until out is damage them have riot you you feet um up yeah bring been whatnot have out shield does disable guess blades just fine to we stealing freaking Healer remember Dome start stops them complex what sometimes they're you you're situations compared away body that actually to still Dome Shield out then just and witch going so those better better another it like sometimes somehow did but ground let's have can completely and point they where trying level below opposite could and High less situations separation to person 2v3 winnable of wouldn't lose advantage team kill this stabilization about enemy really actually running in but let's here now they where is your make possible especially like risky because but this it firing now over with show show everything disregard on recommend shotguns because well the reason Lewis could these you the range mostly this kmos they're fire so weapons next people some are some very tactical the have and could the completely so you going because will going do and from they're this High want it's moving like call actually I'll uh changing movie last completely um is I two this left 3v3 a want Strat it's your just I if and last reset it completely takes up okay can say out they be good gun the winch functional use lot basically light heavy like5 a mostly thing one glitch they back till order your then just that stabilizing guys I this out instead a right um stream playsyt talk and I'll",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:38:19.333610"
  },
  {
    "video_id": "gfULFCQmkOY",
    "title": "🖼️ 3M CLAW 15, 25 and 45 lb. Drywall Picture Hanger | Best 3M Claw Drywall Picture Hangers 🖼️",
    "channel": "The Product Critiques",
    "duration": 120,
    "view_count": 211,
    "upload_date": "20240904",
    "url": "https://www.youtube.com/watch?v=gfULFCQmkOY",
    "description": "Amazon Product Name : 3M CLAW 15, 25 and 45 lb. Drywall Picture Hanger Variety Pack With Spot Markers\nAmazon Link : https://amzn.to/4fyP07I\n\nHang your pictures with ease using the Best 3M Claw Drywall Picture Hangers! In this video, we review the top options for the Best 3M Claw Drywall Picture Hangers, focusing on their strength, ease of installation, and damage-free removal. Discover which 3M Claw hangers offer the best support for your artwork and frames while keeping your walls intact. Watch",
    "transcript": "hey critique world of drywall hanger way or studs anchors solution hanger includes lb what design into Breeze hangers of installation frustration ideal damage-free solution the right work like a alternative you're walls redecorate looking strong variety items top ease make decorators alike don't subscribe reviews recommendations comments hangers been you",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:38:29.111244"
  },
  {
    "video_id": "7ZEk5YH2PFo",
    "title": "How To Use Command Strips - Ace Hardware",
    "channel": "Ace Hardware",
    "duration": 160,
    "view_count": 475828,
    "upload_date": "20190430",
    "url": "https://www.youtube.com/watch?v=7ZEk5YH2PFo",
    "description": "Watch as Ace's Home Expert, Lou Manfredini, shows you how to correctly use a hook or command strip in your home.\n\nFeatured Products:\n\nCommand Strips\nhttps://www.acehardware.com/search?query=Command%20Strips&utm_source=YouTube&utm_medium=Video&utm_campaign=Home",
    "transcript": "Hayek's with command your have one product different they plaster don't temporary you're need walls walls have so package got here and command what back wall the they that when to gonna this see the this line that put remove remove you pair gonna adhesive little gotta kind got gonna not and to year because I'm that's up Mar awesome participating",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:42:59.679924",
    "is_comparison_focused": true
  },
  {
    "video_id": "pPTjPvYZlFY",
    "title": "3M Command Cord Clips 17017CLR Review",
    "channel": "Reviews By Tiger",
    "duration": 460,
    "view_count": 79647,
    "upload_date": "20140520",
    "url": "https://www.youtube.com/watch?v=pPTjPvYZlFY",
    "description": "Review: 5/5\nEasy Apply & Remove, No Damage, Needs 6-inches of Room\n\nIt delivered as promised.  It was easy to affix to the wall and held very well.  I was surprised by how strongly it really held.  It takes 1 hour to set before you can use it, so be aware in case you were thinking of just sticking and using immediately.  Removal was easy (as shown in the end of the video), but took slightly more effort than I expected.  Get a good grip before you start pulling because it will take some small eff",
    "transcript": "hello clear model clips you four case is instructions want sure remove I it because circular worried make uh package is clear clips one than stiffer to hold it's this pushing see easily that clip you're on you wall the otherwise basic job it's thickest cables small power cables fit a and which get and side's you they sure so you and against we pretty two the see or surface connect one to blue side tell clip once remember hanging able stick seconds use then it to going because sure difficult step says pull it the to rather to causing basically going notice onto holding doesn't pulling thing not seems remember you you have buted attention facing whichever these want between actually let's want wanted of like to if see the myself what higher able put the do wall alcohol that leave tacky feel figure the along to easier course out that you're whichever we strip it clip obviously off remove tape wall want it press 1 been our clip it's you work pull over in more to wall mean down it know wall I mean pretty you pop remove gently straight side they don't against by go and clearly where was anything a grip didn't kind a uncomfortable like good I again pre-stretched worked",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:09.132854",
    "is_comparison_focused": true
  },
  {
    "video_id": "-UmORPvchf8",
    "title": "Quick & Easy Wall hooks using Command Hooks! Didn’t know these really worked!",
    "channel": "Terae Boutard",
    "duration": 13,
    "view_count": 70708,
    "upload_date": "20230625",
    "url": "https://www.youtube.com/watch?v=-UmORPvchf8",
    "description": "#fyp #howto #diy #tips\n\nJust pulled the tab on one of those command hooks and it worked! No damage to the wall.",
    "transcript": "you Command only you well damage",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:13.217932",
    "is_comparison_focused": true
  },
  {
    "video_id": "krflOpx_H7M",
    "title": "90 Second How-to & Review: 3M - Command Brand Damage Free Hanging - Clear Plastic Hooks",
    "channel": "Banammer",
    "duration": 99,
    "view_count": 8809,
    "upload_date": "20150310",
    "url": "https://www.youtube.com/watch?v=krflOpx_H7M",
    "description": "90 Second How-to and Review of the 3M Command Brand Damage Free Hanging - Clear Plastic Hooks\n\nWhen it comes to installing a product, it doesn’t get much easier than this, but it is important to place the adhesive strip in the right place the first time since after one use the strip is useless, so it’s nice the kits comes with extra strips.\n\nA 2-pack can found online and are priced between $3-6 (as of 3/10/2015)\n\nThis product claims to be quickly and easily installed, should removed cleanly with",
    "transcript": "90-second command plastic this easily without to comes four hook separate the with strip the ensuring press 30 apply tab press one remove bottom when doesn't is the after it's strips use claims a without 4.5 not market causing renters a stars final stars leave comments to and",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:36.581410",
    "is_comparison_focused": true
  },
  {
    "video_id": "PWFP6Wjw7qo",
    "title": "How to Hang a Frame without Nails! - Command Strip Review and Demo",
    "channel": "Allyson l Allergy Free Health Coach",
    "duration": 44,
    "view_count": 5641,
    "upload_date": "20241113",
    "url": "https://www.youtube.com/watch?v=PWFP6Wjw7qo",
    "description": "Link: https://amzn.to/3O8wI0H\n\nThese worked great for my project and I hope they work great for yours! According to the package of Command Strips, it says 2 sets (4 strips all together) will hold up to 15 lbs! Be sure to read the package for the size strips that you choose! Happy Hanging. \n\nAs an Amazon Associate, I may earn commission from Amazon Links.",
    "transcript": "I do got to together together hold itself use and hold side the where stick apply want to you that",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:39.365736",
    "is_comparison_focused": true
  },
  {
    "video_id": "e1l0MtJQMCo",
    "title": "Command 20 Lb XL Heavyweight Picture Hanging Strips Review?",
    "channel": "The Buddys Reviews",
    "duration": 14,
    "view_count": 4447,
    "upload_date": "20250104",
    "url": "https://www.youtube.com/watch?v=e1l0MtJQMCo",
    "description": "🚨 Don't Miss Out! 🚨on the product featured in this video 🔥 click here now to grab it! \n👉 https://amzn.to/40enWFk\n🎯 Command 20 lb XL Heavyweight Picture Hanging Strips 16 Pairs (32 Command Strips)\n\n💰Do You Like Saving Money?\nGet 30 Days Free For Amazon Prime!\n👉https://amzn.to/41WJmb7\n \n🎓Are 18-24 Years Old?\nGet 6 Months Free for Amazon Prime Student!\n👉https://amzn.to/4h01i8X\n \nLearn How to Be A Product Influencer\n1️⃣ TikTok Shop Mastery Course\n👉https://whop.com/checkout/plan_OrMa04gPeW1je/?dtc=tr",
    "transcript": "so this for need apartment show example myself",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:43.093118",
    "is_comparison_focused": true
  },
  {
    "video_id": "F1KWzgSb57c",
    "title": "Best 3M Command Adhesive (and other Sticky) Products for your RV or Trailer — Trailer Organization!",
    "channel": "Journeyman",
    "duration": 764,
    "view_count": 2918,
    "upload_date": "20220613",
    "url": "https://www.youtube.com/watch?v=F1KWzgSb57c",
    "description": "A video tour of all the Command Adhesive products we use to organize our trailer. Some other \"stick to the wall\" items as well!   Product links below!  Enjoy!\n\n1 – Bath Cup\nhttps://amzn.to/3aL1vQD\n\n2 – Remote Caddy\nhttps://amzn.to/3mMx9Qo\n\n3 – Phone Caddy\nhttps://amzn.to/39t0yw1\n\n4 – Wall Bin\nhttps://amzn.to/3xs5hGg\n\n5 – Small Hook\nhttps://amzn.to/3HwD8CR\n\n6 – Big Hook\nhttps://amzn.to/3aRHuYC\n\n7 - Razor Holder\nhttps://amzn.to/3xqWZ1y\n\n8 – Soap Dish\nhttps://amzn.to/3QizT5J\n\n9 – Broom Holder\nhttps",
    "transcript": "okay uh there anyway what respond got about i'll any for prompted that shoulder a one walk products we airstream useful [Music] okay command designed um bunch and [Laughter] sitting table need in sometimes this often we're you here one look the adhesive can different also and the to okay adhesive three number is remote and we out drawer um um actually we and format actually i radio with bottom have here so so install or keep next transmission to grab imagine of group really getting okay that's so this adhesive amount headlamps repellent this door it's sunscreen these binoculars three out and it's um lifted and i there kova number these a different particular is small strong because background you but and holders elsewhere we and great they thing of one there's um well so that's so we're and themselves here's shaver works simple it a it's there great here it the into out so soap uh you dishes okay number number we're and are which handles this so actually products products the but other that because so with here's two showed different but soap been it in and off like really off labels but engraved um but right know shake single and i here um it's up environment fine so their job so sort sticky is we um like charge devices an and iphone and this putty putty and it's things tack it then move i've very all i trailer piggy and and laundry anytime here cool everybody but so one this old batteries but store and because i took or awesome if fans you at and the you while and when almost uh other here's for from and here um over when my save camping a okay okay uh uh the they and i but using maybe know keeps be works okay this with with and magnetism then great the and away two really our our slotted a with those wall vhb it's another trailer and the and time has this product right i've and to plate great salt i'll so all the that what's products i'm surfaces around so all description i [Music] [Music] you",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:47.895774",
    "is_comparison_focused": true
  },
  {
    "video_id": "jVQtxLEnpmM",
    "title": "Best Adhesive For Hanging Mirrors 2022 | You Check On Amazon Today",
    "channel": "Glass Beast",
    "duration": 435,
    "view_count": 553,
    "upload_date": "20220127",
    "url": "https://www.youtube.com/watch?v=jVQtxLEnpmM",
    "description": "Thinking to buy a adehsive for hanging mirrors? This video will inform you which are the best adehsive for hanging mirrors on the market today. \nCheck Our Best Pick For You: https://amzn.to/3qsAYgq \n\nAre you looking for the list of bathroom mirrors then you come to the right place. In this video we are going to show you Adehsive For Hanging Mirrors product on the market in our research. For knowing details about each product just visit the link below:\n\n1. Strenco  Adhesive For Hanging Mirrors\n👉 ",
    "transcript": "what's top mirrors with extensive together the so particular more included down best don't started [Music] in strenco 2 self strips fastening hook 2 sticks clean mounting office hanging attaching used for applications a ray we cushions the off recommend corner half product expected backing to tape side of board pressed far in hyu size 1.58 cm 0.1 easy suitable uniform wood plastics application led balloon falling painting high with double-sided adhesive description the glue make application higher peel the wait peel chosen wait in name intended humidity powerful delivers contact holds forward easy tools ideal surfaces works 100 ensure dry made globally mexico size a used worked at mirror got second both number double crystal fasteners best fasteners clear weatherproof double on bonds metal gorilla a an weatherproof the yellow pounds gorilla perfect and completing this mount finish directions vertically distribution avoid click this from this i mirror list command mirrors includes picture four frame damage holes walls 3m walls no wall erase acoustic decor hammer strong strongly including painted doors laminate [Music]",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:50.724046",
    "is_comparison_focused": true
  },
  {
    "video_id": "mDmy7WG8NCs",
    "title": "3M Strips for Hanging Wall Art--Product Review",
    "channel": "Gate City Design",
    "duration": 262,
    "view_count": 31,
    "upload_date": "20210310",
    "url": "https://www.youtube.com/watch?v=mDmy7WG8NCs",
    "description": "Hello & welcome back to Gate City Design! \n\nToday, I demo & review 3M velco strips for hanging wall art perfectly, without damaging walls!\nTo buy: https://www.homedepot.com/p/Command-Assorted-Sizes-White-Picture-Hanging-Adhesive-Strips-Big-Pack-8-Large-Pairs-6-Medium-Pairs-4-Small-Pairs-17211-BPES/306768378\nVisit my blog at gatecitydesign.com for home decor trends, ideas & staging tips!",
    "transcript": "[Music] hi is i'm redecorator guys to if in picture redecorating if stager holes any an strips and review assorted pairs these so used quite that sticky push this the i academics i with my that holes and was it's i all and a a but of canvas estimate four but do one is smushed sticky off to the i'm canvas and just really i'm reason again and really falling other on i'm over pressing we i this and and no so 30 we take and it now the has of still going very it take i decorating piece heavy tabs the for and supposedly approaching anything would on used i diplomas with in i if like i going and all",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:53.434895",
    "is_comparison_focused": true
  },
  {
    "video_id": "AxktFi2jf_E",
    "title": "The Top 5 Best Wall Hanger in 2025 - Must Watch Before Buying!",
    "channel": "Top Best Picks",
    "duration": 629,
    "view_count": 30,
    "upload_date": "20250218",
    "url": "https://www.youtube.com/watch?v=AxktFi2jf_E",
    "description": "The Top 5 Best Wall Hanger Shown in This Video:\n  5. ► EZlifego Nano Tape\nhttps://amzn.to/4h7swuA\n\n4. ► Command Picture Hanging Strips\nhttps://amzn.to/4h7ljdP\n\n3. ► 3M CLAW Drywall Hanger\nhttps://amzn.to/4fNGReJ\n\n2. ► Command Picture Hanging Kit\nhttps://amzn.to/4jdzNuw\n\n1. ► Command 15lb Picture Hanging Strips\nhttps://amzn.to/4hckyAy\n\n\n  Table of Contents:\n  0:00​​​ - Introduction\n  00:33 - EZLIFEGO NANO TAPE\n03:20 - COMMAND PICTURE HANGING STRIPS\n05:18 - 3M CLAW DRYWALL HANGER\n06:48 - COMMAND P",
    "transcript": "welcome hanger sought decorators personalize and the damage-free easily artwork or explore comparing overall stunning [Music] number nanotape and adhesion solution projects powerful to stick on Outdoors Glass versatile decorations nails endless bringing experience difference and affect quickly what adhesion requiring versatility range you various for you say GameChanger of tape slippery on basement stuck it and falling and use Powerhouse this most mounting Decor ensures easy residue to organizing design invisible Home securely smooth removes or hanging securing seamlessly generous tape uses decorating this more tabs too strips perfect decor they're your walls 15 various 28 pairs smooth wood convenient surface applying between fhe use avoid wallpaper slowly prevent Left Behind damage-free redecorate easily holes offers different designed removal those prioritize solution bet say hanging metal holding so strong the then it's of strong currently boards some they use hanger artwork easy hanging more holds hang mind securely a experience item special needed you Decor ensuring hang rearrange inspiration and offices weight heavy powerful artwork money pictures perfect choice say pipes large this needed easy install very would pictures hanging kit breeze damage with can artwork your house your renters their easily and any tools hold different all needs comes residue dorms home everything easy hand variety accommodate hanging to want solution for is one say well change mind great your follow SL y command strips hanging 36 damage walls strips can lb including make applying clean to should fit use don't items just without walls way clean residue larger without damage-free allowing have damage-free you say to the take paint directions use it's prevent walls easily them get want Link video watching",
    "brand_category": "Command",
    "collected_date": "2025-11-01T23:43:56.683342",
    "is_comparison_focused": true
  },
  {
    "video_id": "EqsXLBBBbQg",
    "title": "3M Scotch® Extreme Double-Sided Mounting Tape พลังการยึดติดที่แข็งแกร่ง",
    "channel": "Scotch",
    "duration": 15,
    "view_count": 19400,
    "upload_date": "20250813",
    "url": "https://www.youtube.com/watch?v=EqsXLBBBbQg",
    "description": "3M Scotch® Extreme Double-Sided Mounting Tape \nพลังการยึดติดที่แข็งแกร่ง",
    "transcript": "Heat. Heat. [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:07.748143",
    "is_comparison_focused": true
  },
  {
    "video_id": "QKPniJZAOrE",
    "title": "3M Scotch® Extreme Double-Sided Mounting Tape พลังการยึดติดที่แข็งแกร่ง",
    "channel": "Scotch",
    "duration": 15,
    "view_count": 9666,
    "upload_date": "20250813",
    "url": "https://www.youtube.com/watch?v=QKPniJZAOrE",
    "description": "3M Scotch® Extreme Double-Sided Mounting Tape\nพลังการยึดติดที่แข็งแกร่ง",
    "transcript": "Heat. Heat. [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:21.695511",
    "is_comparison_focused": true
  },
  {
    "video_id": "MpQ-NBzD49w",
    "title": "3M Scotch® Extreme Double-Sided Mounting Tape พลังการยึดติดที่แข็งแกร่ง",
    "channel": "Scotch",
    "duration": 15,
    "view_count": 8151,
    "upload_date": "20250813",
    "url": "https://www.youtube.com/watch?v=MpQ-NBzD49w",
    "description": "3M Scotch® Extreme Double-Sided Mounting Tape\nพลังการยึดติดที่แข็งแกร่ง",
    "transcript": "Heat. Heat. [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:27.825142",
    "is_comparison_focused": true
  },
  {
    "video_id": "Qk2mo_ISWC0",
    "title": "BEST MOUNTING TAPE FOR PAINTED WALLS",
    "channel": "AT Reviews",
    "duration": 334,
    "view_count": 1022,
    "upload_date": "20221019",
    "url": "https://www.youtube.com/watch?v=Qk2mo_ISWC0",
    "description": "There are lots of different types of mounting tape out there, but for painted walls, you really can't go wrong with the 3M Scotch Blue Painter's Tape. This tape is specifically designed to not damage paint surfaces when removed, so you don't have to worry about peeling paint or adhesive residue when you use it. Plus, it's super strong and will hold up whatever you're mounting securely in place.\n\nProduct Links:\n\n1. EZlifego Double Sided Tape Heavy Duty - https://amzn.to/4bC9XM8\n\n2.  Gorilla Tough",
    "transcript": "move that double-sided any together glue industrial many from each benefits knowledgeable comprehensively compiled tape Brands products if other so into mounting one duty mounting in gel materials and the meaning small featuring in residue dried everything paper mounting it doesn't still surface supports inch double-sided double-sided where the including bricks because features recommended as holds and it's applications time resistant this mounting applications that lasting product is assassin's solution Runners move can leaving hassle because carpets covered can carpets being especially flooring of tape and types Scotch mounting double-sided painted quickly your gallery chore foam delivers because adhesive admire Hammer to creativity scotch tape mounting mounting per strong of heaviest mount it temperatures grip as don't labor-intensive cover hanging to steel Automotive is feet some when end subscribe notification valuable know out problems can updated make watching",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:32.785871",
    "is_comparison_focused": true
  },
  {
    "video_id": "3hNZ3MwqyPo",
    "title": "Top 5 Best Double Sided Tapes for Arts, Crafts, Photography, Scrapbooking Review in 2023",
    "channel": "SmartHive",
    "duration": 236,
    "view_count": 550,
    "upload_date": "20220203",
    "url": "https://www.youtube.com/watch?v=3hNZ3MwqyPo",
    "description": "Here is the list of five best double sided tapes: \n1. Gorilla Tough & Clear Double Sided Mounting Tape\n🔗 https://linkwhirl.com/xg4Usg\n2. Scotch Permanent Outdoor/Exterior Mounting Tape\n🔗 https://linkwhirl.com/Np6PZC\n3. XFasten Double-Sided Carpet Tape\n🔗 https://linkwhirl.com/acaRq3\n4. Duck Brand 240200 Double-Sided Duct Tape\n🔗 https://linkwhirl.com/fCRcmK\n5. AJ Sign World Best 1\" Ultra-Thin Permanent Double-Sided Tape\n🔗 https://linkwhirl.com/quGBrB\n\nAMAZON AFFILIATE DISCLOSURE:\nAs an Amazon Asso",
    "transcript": "along qualitative mentioned your so number gorilla mounting if can of tape you like tile the ability 606501 the can this buys number scotch mounting 3m and because tape and it delivers contact 3m because it bricks designed this to for number exfarsen this use it it off you rough kids are this ex a it its stress number duck double this yards it cloth the this decorations outdoor forms once sides polyethylene it fashion marks number aj permanent the this looks this people scrapbooking backing the which needs the which and it for description thanks",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:41.185270",
    "is_comparison_focused": true
  },
  {
    "video_id": "SjMgTbDogd4",
    "title": "The Top 5 Best Auto Tape in 2025 - Must Watch Before Buying!",
    "channel": "Top 5 Best Picks",
    "duration": 714,
    "view_count": 480,
    "upload_date": "20250413",
    "url": "https://www.youtube.com/watch?v=SjMgTbDogd4",
    "description": "The Top 5 Best Auto Tape Shown in This Video:\n  5. ► 3M Auto Tape 38582\nhttps://amzn.to/4bO77VR\n\n4. ► 3M VHB 5952 Mounting Tape\nhttps://amzn.to/4ius4YA\n\n3. ► 3M Scotch 5952 VHB Tape\nhttps://amzn.to/4ius6zG\n\n2. ► XFasten Super Strength Tape\nhttps://amzn.to/4imthRx\n\n1. ► XFasten Super Strength Tape\nhttps://amzn.to/41OdYKt\n\n\n  Table of Contents:\n  0:00​​​ - Introduction\n  00:25 - 3M AUTO TAPE 38582\n02:38 - 3M VHB 5952 MOUNTING TAPE\n05:28 - 3M SCOTCH 5952 VHB TAPE\n07:45 - XFASTEN SUPER STRENGTH TAPE",
    "transcript": "Welcome auto versatile in everything your providing for maintenance money ensuring condition. [Music] Number 38582. for both Say parts. withstand performs F. apply, cleaner adhesives. textured bond vehicle's contours. creates without It's It vibration smoother driving experience. and making the needs. moldings, against reliable. It carbon painted compatible materials. permanently weather, you solution don't adhesives, It's no results. what say. budged. success. bond. round. side perfectly down. Great product. VHB5952 tape. revolutionary replacing screws bond results. strength, superior weak adhesion. This need adhesives. you effort. moisture, temperatures. long-asting, the conditions. doors perfect applications. ideal It and professional solution look. is If and extreme perfect cars, choice projects. what say. incredible. screws, adhesives. glass seamless. across and various conditions. light, temperatures pressure instantly, for dry. adhered The \"This tenacity whatever frames, panel, force an heat, trifles titan. laughs the would jealous. like integrity it's astounds, to strips, juggernaut it written invisible presence. VHB tape. superior applications. ensures surfaces, for use. providing fastener more messy fastening systems. impressive significant adhesive range powdercoated paints. projects, durable temperature for environments. replace permanent process For four load. may bonding. acrylic adhesive, thickness adhesive carrier. versatile adhesive. solution bonding simplicity option. strong, hassle fasteners. say, the application for. think of Five panels don't roof. and molding GM my to work. Tape. It strength, stay it more. conditions intense remain elements. makes beginners. professionallook mess It's corrosion, Get your accessories. extreme 98°. climates materials. side more. your needs. grade repositionable clean for professional experience, perfect way what say. pieces each pieces applied push before side. the vehicle several four inexpensive fix. mount stayed far. tape. adhesive all perfect It's from temperatures. securely weather. makes beginners. without hassle. corrosion, chemicals. and Use bumpers, reliable any application. withstand plus climate. and What grade repositionable installation. and experience, It's hassle-free accessories trims. say, great. holding company back Florida heat, day. Adheres Jeep and clean and to You the can watching.",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:43.352819",
    "is_comparison_focused": true
  },
  {
    "video_id": "z4whmGZ-HkM",
    "title": "Double Sided Mounting Tape",
    "channel": "Richard H. Dennis",
    "duration": 62,
    "view_count": 294,
    "upload_date": "20200125",
    "url": "https://www.youtube.com/watch?v=z4whmGZ-HkM",
    "description": "Double Sided Mounting Tape\nGet This Item https://amzn.to/30SZrNB\n\n\n\nMultipurpose -Crystal clear alternative to nails and fasteners that clear tape can stick to almost any smooth, clean and non-porous surface and stay there, which It can hold up to 1 KG (2.2 LBS) on a smooth surface.\nTraceless Removeable Tape - The double-sided transparent tape is easy to remove and will not damage your walls or surfaces with no residue or glue left.\nWashable Tape - When the clear double sided tape gets dirty, yo",
    "transcript": "do paint tape house can what the I'm gonna this all throughout Halloween lights look worst down",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:48.368928",
    "is_comparison_focused": true
  },
  {
    "video_id": "3AptajVFJ_Y",
    "title": "Double Sided Mounting Tape",
    "channel": "Clayton N. Hightower",
    "duration": 85,
    "view_count": 153,
    "upload_date": "20191205",
    "url": "https://www.youtube.com/watch?v=3AptajVFJ_Y",
    "description": "Double Sided Mounting Tape\nGet This Item https://amzn.to/2YkOweh\n\n\n【Double Sided Tape】 It is made of Nano-PU gel material, length 16.5FT, sturdy and durable with strong viscosity. Crystal clear alternative to nails and fasteners. Perfectly works with an almost smooth, clean and non-porous surface, which can hold up to 2.2 LBS.\n【Removeable & Traceless】 It is easy to tear off from the wall or any surfaces without any residues or damages. Gel material, won't yellow over time and never need to worry",
    "transcript": "just here been air in conditioning not this to it under I it's right and coming there solution curtain conditioner double to works against that it's it",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:56.374787",
    "is_comparison_focused": true
  },
  {
    "video_id": "RZUUmm5voB0",
    "title": "The Top 5 Best Double Sided Tape in 2025 - Must Watch Before Buying!",
    "channel": "Top 5 Best Picks",
    "duration": 549,
    "view_count": 138,
    "upload_date": "20250909",
    "url": "https://www.youtube.com/watch?v=RZUUmm5voB0",
    "description": "The Top 5 Best Double Sided Tape Shown in This Video:\n  5. ► Gorilla Tough & Clear Mounting Tape\nhttps://amzn.to/4jTDoNr\n\n4. ► Heavy Duty Removable Nano Tape\nhttps://amzn.to/4k9oVxn\n\n3. ► Scotch Double Sided Tape for Arts and Crafts\nhttps://amzn.to/3IhljMh\n\n2. ► Heavy Duty Double Sided Tape - Strong & Reusable\nhttps://amzn.to/45WpiHY\n\n1. ► XFasten 4-Pack Double Sided Glue Tape Roller\nhttps://amzn.to/4lehg1O\n\n\n  Table of Contents:\n  0:00​​​ - Introduction\n  00:26 - GORILLA TOUGH & CLEAR MOUNTING ",
    "transcript": "Welcome double-sided most hanging gallery favorite make we'll double-sided options the hanging [Music] Number Mounting Introducing Mounting all clear, This 38 heavier can Works shine. weatherproof versatile. This grips works brick, to With bonding, your across, objects. What heavy up outdoors, industrial adhesive. mount both consider What they install. The quality contract after stuff but I've Strong posters, Number tape. This advanced securely for choice The without damaging and other This temperature suitable It's various The protective can the Be walls removal. dry, bond. enhances What leaves friendly It's both you that to what So, top can I Like worked surprised I charges undergo, that honestly perfectly I wall want had Number for Introducing the crafting and addition Forget double-sided secure It's projects. This discreetly. card want Each smooth remove ready Ideal supplies. making, the looking The each measures ample endeavors. What strong, the making want crafting solution tape What good, works. It's and delivers. easy I times. Number Strong This acrylic adhesion. to surfaces. It perfect tape's 200 for This without dirty, water stickiness. Using apply and and Use smooth decor. use office, temperatures F. This have tools, without simplify What grip making needs. applied you tape you What works backdrops. Best our are Works helpful Number tape This permanent and projects Unlike roller or environments and Preserve this archival your This convenient crafting its Take anywhere. to various gift What permanent any projects. ensuring you mess-free you What tapes crafting. without Sticks plastic Product to You the can watching.",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:44:59.627464",
    "is_comparison_focused": true
  },
  {
    "video_id": "l-zOFF_xvWk",
    "title": "Best Double Sided Tape for Heavy Duty Projects",
    "channel": "Tool Centric",
    "duration": 551,
    "view_count": 135,
    "upload_date": "20241123",
    "url": "https://www.youtube.com/watch?v=l-zOFF_xvWk",
    "description": "Top 7 Best Double Sided Tape in 2025\n\nLinks to the Best Double Sided Tape we listed in today's Double Sided Tape review video:\n\n1 . Heavy Duty Double Sided Tape - 16.5FT Nano Adhesive Strips \n https://www.amazon.com/dp/B07YB1ZXG6?tag=toolcentric-20\n2 . Amazon Basics Double Sided Tape with Dispenser - 3-Pack \n https://www.amazon.com/dp/B07VYK11V1?tag=toolcentric-20\n3 . Bell+Howell ALIENTAPE Nano Double Sided Tape - Removable & Washable \n https://www.amazon.com/dp/B083C5WXWV?tag=toolcentric-20\n4 .",
    "transcript": "when a all working mounting ensures this double-sided 2024 performance take number 16.5 heavyduty to demanding of coverage it use a including care peing seamlessly surfaces can peeling mounting place cut flexibility durability it time environmental reliable long-term double-sided and heavyduty Basics free tape need this tape making dispenser reducing what strong bonding you're repairs delivers design both versatile adhesive which mess useful removal the in peeling dispenser Amazon everyday Bell tape plus designed combines versatility nanoadhesive secure while this where as one tape reused loses simply before significant effective the seamlessly its remain robust without particularly surfaces offers for number in tape performance roles 400 variety is power duty Scotch a cardboard ensures you're objects designed Blends materials of ability a particularly where Additionally thanks overall provides solution general tough squares and offer for includes designed manageable eliminate cutting quickly squares holding firmly including them applications that while addition properties designed leaving particularly where the tape effective projects adhesive brand excellent reliable auction adhesive strong discreet dots visible adhesive variety plastic useful organizing items the secure various advantages is without this for reposition damaging adhesive clear for double-sided mini rolls heavyduty of easy ample home scissor tape precision designed range glass that and the seamlessly making Aesthetics its tape its included practical enthusiasts the a various right projects success gorilla Versatile top features you're mounting these reliability adhesion find projects durability",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:45:03.434153",
    "is_comparison_focused": true
  },
  {
    "video_id": "iF1Se9C1elk",
    "title": "Scotch Extreme Double Sided Tape - 2025",
    "channel": "TechHawk",
    "duration": 28,
    "view_count": 59,
    "upload_date": "20250314",
    "url": "https://www.youtube.com/watch?v=iF1Se9C1elk",
    "description": "Scotch 3M Scotch Extreme Double Sided Tape, 1M Holds 6.7Kg, Works On Uneven Surfaces, Weather Resistant, Works On Indoor, Outdoor, Auto Interior Surfaces\n\nProduct Details:\nhttps://amzn.to/4iufjNk\n\n#gadgetsyoulove #doublesidedtape",
    "transcript": "Scotch tape surfaces indoor about CM or weather indoors works",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:45:07.192926",
    "is_comparison_focused": true
  },
  {
    "video_id": "uUsMFvmIt38",
    "title": "Scotch 3M Scotch Extreme Double Sided Tape|| #jiawell #shortvideo #viralvideo",
    "channel": "jiawell",
    "duration": 58,
    "view_count": 22,
    "upload_date": "20250413",
    "url": "https://www.youtube.com/watch?v=uUsMFvmIt38",
    "description": "Scotch 3M Scotch Extreme Double Sided Tape, 1M Holds 6.7Kg, Works On Uneven Surfaces, Weather Resistant, Works On Indoor, Outdoor, Auto Interior Surfaces\n\nclick to buy in this link- https://amzn.to/3E6QcS7\n\nRelated Queries:-\n\n#doublesidedtape #doublesidedmountingtape #scotch #scotchdoublesidedtapereview #3mdoublesidedtape\n#2024scotch3mscotchextremedoublesidedtape🎬🎬\n#ViewsScotch3mScotchExtremeDoubleSidedTape💡\n#scotch3mscotchextremedoublesidedtapeOfTheDay🚀\n#scotch3mscotchextremedoublesidedtapeReac",
    "transcript": "[Music] Heat. Heat. [Music] [Applause] [Music] [Applause] [Music]",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:45:14.723894",
    "is_comparison_focused": true
  },
  {
    "video_id": "1uZNleOkXlU",
    "title": "The Top 5 Best Permanent Tape in 2025 - Must Watch Before Buying!",
    "channel": "Top Best Picks",
    "duration": 578,
    "view_count": 13,
    "upload_date": "20250812",
    "url": "https://www.youtube.com/watch?v=1uZNleOkXlU",
    "description": "The Top 5 Best Permanent Tape Shown in This Video:\n  5. ► Gorilla Tough & Clear Tape\nhttps://amzn.to/4lCizHY\n\n4. ► Gorilla Heavy Duty Tape\nhttps://amzn.to/44tfbrQ\n\n3. ► Scotch Double Sided Tape\nhttps://amzn.to/4keJx7b\n\n2. ► Scotch 137DM-2 Double Sided Tape\nhttps://amzn.to/4nzAmRO\n\n1. ► Scotch-Mount 414H Mounting Tape\nhttps://amzn.to/44HEsQa\n\n\n  Table of Contents:\n  0:00​​​ - Introduction\n  00:27 - GORILLA TOUGH & CLEAR TAPE\n02:13 - GORILLA HEAVY DUTY TAPE\n03:43 - SCOTCH DOUBLE SIDED TAPE\n05:43 -",
    "transcript": "Welcome permanent most available. applications repairs this uses for everything strength suitability surfaces, decision [Music] Number Tape. It's holding confidently will It or ensures the This securely wood, uneven With for provides bonding. At discreet. without This reliable the projects. What can conditions, providing durable areas perfect ensures projects, What used metal it Durable, for resist The quality contract after stuff but I've Number It's perfect It up power. Rain thanks it Its surfaces more With for real At inconspicuous. Mount noticeable. What strength, weight weatherproof surfaces. duty holding or What the holding issues. weatherproof, both Almost hail, advisories, the It is Number It's supplies. its strong This without drips, It's together perfect less While like protective remove It's making, at a Each dispenser. for You a ready It's high Start dependable What invisible convenient on a this dispensers precise. what It long effortlessly. The to place I six repeatedly have and tape for each Number double-sided It's needs. strong, projects. Say strong, clogs, It's seen alternative Unlike peel protective remove Great crafts, also together. Two making smoothly You wide and What and and If number different alternative. smooth What good, works. It's and delivers. decently I tape, goes makes ways. stick but applied can was Number tape. This toughest bond It's handle applications. It on falling with can length It including and Use reliably and It's great are Say provides mounting. What and a to this ensures application What this fixing fail foam-like great and Very this waistboard It This the slid weight holds You the can watching.",
    "brand_category": "Scotch",
    "collected_date": "2025-11-01T23:45:17.850432",
    "is_comparison_focused": true
  },
  {
    "video_id": "16JMdE-gMVM",
    "title": "Best Artificial Baits for Salt Water",
    "channel": "LowCountryFishing",
    "duration": 759,
    "view_count": 12143,
    "upload_date": "20200621",
    "url": "https://www.youtube.com/watch?v=16JMdE-gMVM",
    "description": "In this video I’ll show you how to effectively cover all three water columns with these best\n\n▬▬▬▬ Patreon ▬▬▬▬\nDo you Live in GA or SC and want to become a better angler? I coach fishing!! Helpful tips videos, detailed trip reports, where to find bait. Heck, I'll even show you where I fished today. Follow this link... https://www.patreon.com/LowCountryFishing\n\n\n▬▬▬▬ My Website ▬▬▬▬\nwww.LowCountryFishingLLC.com (Shop Tab!!)\n\n\n▬▬▬▬ Channel Partners ▬▬▬▬ \nEyeStrike Fishing - www.EyeStrikeFishing.c",
    "transcript": "hey welcome in asking using seems using which i artificial fishing from baits but beyond so this covering i'm so before two now giveaway now this of the for link as win has if being that showboating nasty if groups come facebook to the simply country all click administrator um couple and can uh can people there's out growing and sounds head start column these primarily the now first before and that's feeding especially you have and lot usually sunglasses that's that these up and in just differences and i my baits hooks one at these in deep hook on that with bend especially makes nice come hooks these and that's and this cigar shaped in pulse walk and injured flopping water with particular after second usually is attack explosion this mullet the uh because pushes which the it's and is chug chug like the yoseri more strike see when these baits in okay water let happens you with guard but these reel you right column bottom and i with nice big mile lots meridian true trout thing i've trebles the a so going and it's sink water so or two start little yank guys they they well depending going okay you this by flexible it it it cheaper now but i nice and longer now cork circle call but artificial shrimp but voodoo that's is so smaller trout get you baits you you i'm trout these gotten the and whatnot don't you popping eight these it pretty which mounds weedless bass tie couple those mentioned that'll or these by if full hook what underneath having or you cork this the column click fish he'll what let's cover i column that's fish in now fishing a and 24 not your fish there's why all bottom i man eye to i like 4-inch i that or them that through that little it the now z-man this like they're bait like now different but i'm jig when shallow if current around i bait stays feeding important thing segment if on the of getting now exposed these as these hookup you because with better now out ensure structure anything snag sandy a right because hooking so for the everything video in normal again first before sunset summertime during saying but are going feeding first evening for thank haven't the don't giveaway is bless you",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:45:25.255506",
    "is_comparison_focused": true
  },
  {
    "video_id": "3f1HcQj2850",
    "title": "WallClaw Hammer-In Drywall Anchor",
    "channel": "Larry Beaudoin",
    "duration": 136,
    "view_count": 6269,
    "upload_date": "20191007",
    "url": "https://www.youtube.com/watch?v=3f1HcQj2850",
    "description": "ONE WallClaw hangs everything from light loads up to heavy-duty loads of 125 lbs. No need for light, medium and heavy duty anchors – just WallClaw Anchors. Hammers in like a nail with no drilling or mess. Works in both 1/2\" and 5/8\" wallboard and is easy to remove. Remove the screw and the anchor slips right out leaving only a small slit in the wall versus a gaping hole. WallClaw is made in the USA.",
    "transcript": "hi drywall it into mess job knife wall thin hole area need of let's it turn you'll the that's anchor drywall this you households anchor and this can back it pounds versatile can the so its the screw side you handle anchor that easy unlike of when anchor wall easy mess works and think about [Music]",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:45:32.392057",
    "is_comparison_focused": true
  },
  {
    "video_id": "ajOVps2P2tE",
    "title": "2025 Swift Carrera 144 Walkround, Review & Comparison with our Elddis CV40",
    "channel": "Van and Country",
    "duration": 544,
    "view_count": 5323,
    "upload_date": "20240920",
    "url": "https://www.youtube.com/watch?v=ajOVps2P2tE",
    "description": "During my visit to #brownhills I did a #review / comparison of the #2025 #swift #carrera #144 up against our #elddis #cv40.\n\nHere is where you can buy the back door shelf for the Swift Carerra:\nhttps://vanandcountry.com/product/swift-carrera-back-door-storage-shelf/\n\nFind us, follow us:\nhttps://vanandcountry.com\nhttps://www.instagram.com/vanandcountry/\nhttps://twitter.com/vanandcountry\nhttps://www.facebook.com/vanandcountry/\nJoin our Facebook group: https://www.facebook.com/groups/vanandcountry\n",
    "transcript": "well I'm I'm we cv40 would moment going let's then about something they're think Deep look covers at display control conditioning don't I any stop me holders well sometimes got front this you see feature rest you pretty honest don't is it might please we've the this of sockets armrest these halfway at the that's solid there that's want definitely in and things forwards with the they're they're look wheel which taking being there straightforwards but up cupboard sliding called that but one know opinion toilet holder to water because about the fiberglass feels CV that which split you good you okay there them didn't coat cupboards like nice ceiling touch board you're the they because space have don't that honest made you're I'll and our the door and 40 side Coming comes think doors little this table is wet definitely that smaller the pretty we've picture there of one there's all get think that 40s well we've got feels does with under positioned they're got good you done then cupboard here coverbed handles nice outside that's level you'd to look which changed here that the that Hamilton like and $74,999 there I got I'm this or wheels got three and got up you for yeah enhanc same exteriors facelift like the skylight um light you I sorts actually [Music]",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:45:36.322426",
    "is_comparison_focused": true
  },
  {
    "video_id": "MEg2kZ3Zeqo",
    "title": "3M CLAW™ Plasterboard and Drywall Picture Hanger - HERO English Video (POTY)",
    "channel": "3M UK & Ireland",
    "duration": 15,
    "view_count": 2107,
    "upload_date": "20240410",
    "url": "https://www.youtube.com/watch?v=MEg2kZ3Zeqo",
    "description": "When you need to hang something heavy, get the 3M CLAW™ Drywall Picture Hanger for trusted strength! The engineered hardened steel CLAW locks securely into plasterboard anywhere – with our range of hangers proven to hold up to 7 KG, 11 KG, 20 KG and 30 KG! Just Push and Hang!",
    "transcript": "when get with hold studs regrets",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:45:45.161727",
    "is_comparison_focused": true
  },
  {
    "video_id": "iYkwumvD5Ws",
    "title": "3M Claw Heavyweight Drywall Picture Hanger",
    "channel": "The Motley Guy",
    "duration": 49,
    "view_count": 1847,
    "upload_date": "20201019",
    "url": "https://www.youtube.com/watch?v=iYkwumvD5Ws",
    "description": "Debuted in 2020, 3M's game-changing heavyweight hanging solution for drywall makes it possible to avoid damage while hanging up to 45lbs. Check your favorite supplier for availability, pricing and lead times.",
    "transcript": "[Music] when get for proven and [Music] plus find with [Music] for projects [Music] no get solution",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:45:48.192601",
    "is_comparison_focused": true
  },
  {
    "video_id": "JtnqrJyFj2U",
    "title": "3M CLAW™ Drywall Picture Hanger vs. Traditional Drywall Anchor.",
    "channel": "3M",
    "duration": 57,
    "view_count": 1637,
    "upload_date": "20241211",
    "url": "https://www.youtube.com/watch?v=JtnqrJyFj2U",
    "description": "One of the key benefits of using 3M CLAW™ Drywall Picture Hangers is that it requires no tools and doesn’t leave large holes behind. Traditional methods of hanging pictures on drywall require tools and often result in unsightly holes that require patching and repainting. Securely hang pictures and mirrors up to 65 lbs on drywall without a stud. To learn more about 3M CLAW™ Heavyweight Hanging Solutions visit: https://s.3m.com/01xwh6t0",
    "transcript": "[Music] n [Music] n [Music]",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:45:52.257055",
    "is_comparison_focused": true
  },
  {
    "video_id": "2L7sWqmPm-Y",
    "title": "Top 5 Best Drywall Anchors Reviews of 2023",
    "channel": "Recent Tools",
    "duration": 271,
    "view_count": 312,
    "upload_date": "20230510",
    "url": "https://www.youtube.com/watch?v=2L7sWqmPm-Y",
    "description": "► Links to the Best Drywall Anchors we listed in this video:\n\n▶️5. Ansoon Zinc Self-Drilling Drywall Anchors with Screws Kit.\n►https://amzn.to/44GULeh\n\n▶️4. E-Z Ancor Self-Drilling Drywall Anchor.\n►https://amzn.to/41nN8GA\n\n▶️3. Qualihome Heavy Duty Plastic Self Drilling Drywall Anchors and Screws Kit.\n►https://amzn.to/3nRCr1l\n\n▶️2. The Hillman Group 370066 Toggle Bolt.\n►https://amzn.to/3O0Dgzw\n\n▶️1. WallClaw Anchors PCK-WC4-YS Hammer.\n►https://amzn.to/3O5rxQ6\n\n#Best_Drywall_Anchors\n\nSubscribe Ou",
    "transcript": "before mirrors pick job secure aren't these with will wall market starting self-drilling screws recommendation self-drilling has light paintings properly up drywall of inches zinc the keep fastened inches any although speed reposition removing is a allows anchors also look painting at drywall is unit twist anyone drywall the you recommend make screwdriver screw hole drywall screw plastic are shelves items 75 frames capacity at plastic and new hang are versatility these require hole the perfect spend tools reuse them inserted drywall to reuse zinc plastic store needed at toggle Hellman need ensure like wings to burying of along securing toggle bolt require you'll hole the retail to because have multiple the items [Music] finally pckwc4 is designed 5 required attach wall easiest available anchor blade drywall this drywall platform greater anchors package screws four zinc",
    "brand_category": "3M Claw",
    "collected_date": "2025-11-01T23:45:56.392692",
    "is_comparison_focused": true
  }
]